{"6.63": " Reduced  Mist Coil cast range from 600 to 300.", "6.60": " Reduced  Mist Coil cooldown from 7 to 6.  Curse of Avernus now applies the buff on Abaddon on his first attack, instead of second attack on the same target. Added  Aghanim's Scepter upgrade for Abaddon: Increases  Borrowed Time duration from 3/4/5 to 5/6/7.", "6.64": " Increased  Mist Coil cast range from 300 to 800. Reduced  Aphotic Shield cast range from 800 to 300.", "6.49": " Reduced  Mist Coil cooldown from 15 to 11.", "6.52": " Increased movement speed from 295 to 300.", "6.42": " Reduced movement speed from 300 to 295.", "6.50": " Reduced  Mist Coil cooldown from 11 to 7.", "6.33": " Increased base  intelligence from 17 to 21. Increased movement speed from 295 to 300.  Aphotic Shield Moved from first into the second ability slot. Increased damage block from 100/150/200/250 to 125/175/225/275. Reduced cooldown from 25 to 21. Replaced Mark of the Abyss with  Mist Coil", "6.35": " Increased base armor from 1 to 2 (total armor is now 4.38).", "6.34": "  Aphotic Shield Reduced cast range from 1000 to 800. Increased cooldown from 21 to 23.", "6.39": "  Aphotic Shield can no longer be cast on  Doomed units.", "6.72d": " Undid melee hero collision change from 6.72c", "6.54": "  Aphotic Shield No longer causes Abaddon to heal when cast on self while under the effect of Borrowed Time. Reduced damage block from 125/275/225/275 to 100/125/150/175. Reduced duration from 20 to 15. Increased manacost from 100 on each level to 100/105/110/115. Reduced cooldown from 23 to 18/15/12/9. Notes: When cast on same unit twice before the first shield expires, it refreshes the duration and max damage block.  Borrowed Time Now turns every damage taken into heals, instead of only blocking the damage and only healing when affected by Aphotic Shield. Is now compatible with  Refresher Orb (previously, casting it multiple times within a cooldown period had no effect). Increased cooldown from 45 to 60.", "6.79": " Reduced base armor from 0 to -1 (total armor is now 1.38). Increased  Mist Coil self damage from 50/75/100/125 to 75/100/125/150.  Aphotic Shield is now dispellable.  Borrowed Time no longer passively activates while  Doomed.", "6.78": " Increased movement speed from 300 to 310.", "6.72c": " Melee hero collision size now reduced from 24 to 12.", "6.75": " Reduced base armor from 2 to 0 (total armor is now 2.38). Reduced  Mist Coil cooldown from 6 to 5. Reduced  Aphotic Shield cooldown from 14/12/10/8 to 12/10/8/6. Increased  Curse of Avernus slow duration from 2 to 2.5. Reduced  Borrowed Time cooldown from 60 on each level to 60/50/40.", "6.71": " Increased  Aphotic Shield cast range from 300 to 350.", "6.70": " Increased  Curse of Avernus movement speed bonus from 10% to 15%.", "6.73": "  Aphotic Shield Now explode at the end of its duration if it has not taken sufficient damage. Reduced cooldown from 18/15/12/9 to 14/12/10/8. Increased cast range from 450 to 500.", "6.72": " Increased attack range from 100 to 128. Increased  Aphotic Shield cast range from 350 to 450.", "6.81": "  Aghanim's Scepter upgraded  Borrowed Time now redirects 35% of all damage dealt to allied heroes within a 900 radius of Abaddon to Abaddon when active.", "6.82": " Rescaled  Mist Coil manacost from 75 to 50/60/70/80.", "6.83": " Increased  Borrowed Time duration from 3/4/5 to 4/5/6.", "6.84": "  Borrowed Time can now be cast while disabled.", "6.57": " Increased  Aphotic Shield damage block from 100/125/150/175 to 110/140/170/200.", "6.24": "  Aphotic Shield Can no longer be cast on buildings. Reduced cooldown from 45 to 25. Reworked Mark of the Abyss", "6.23": " Mark of the Abyss no longer turns Abaddon phased for its duration.", "6.20": " Created.", "6.28": " Increased base  agility from 13 to 17. Increased  Aphotic Shield cast range from 600 to 1000.", "6.29": "  Aphotic Shield now applies a strong dispel on the target upon cast. Mark of the Abyss Now also increases movement speed by 10% on each level. Reduced manacost from 100 to 75.  Borrowed Time Can now also be manually cast, instead of being only passively triggered at 400 health. Same cooldown and duration. Now applies a strong dispel when activated. Reduced cooldown from 60 to 45."}