{
  "6.44": "  Unstable Concoction Increased cast range from 600/650/700/750 to 650/750/850/950. Increased damage per channeled second from 50 to 60 (max possible damage: 120/180/240/300). Increased  Chemical Rage health regen from 10/30/60 to 15/30/60.",
  "6.45": "  Acid Spray Increased radius from 550 to 625 Increased cast range from 550 to 625. Reduced  Chemical Rage Base Attack Time reduction from 1.45/1.35/1.25 to 1.45/1.35/1.2.",
  "6.60": "  Unstable Concoction is now properly blocked by  Linken's Sphere.",
  "6.47": " Increased movement speed from 290 to 300.  Unstable Concoction no longer gets canceled when  Chemical Rage expires during the channeling.",
  "6.67": " Added to Captain's Mode.",
  "6.65": "  Unstable Concoction reworked:",
  "6.68": "  Unstable Concoction Increased manacost from 90 to 120. Reduced damage from 150/200/250/300 to 120/180/240/300.",
  "6.69": " Reduced  Unstable Concoction stun duration from 2.5/3/3.5/4 to 1.75/2.5/3.25/4.",
  "6.49": " Increased  Acid Spray duration from 12 to 16.",
  "6.43": " Reduced movement speed from 300 to 290. Reduced  strength gain from 2.4 to 1.8. Reduced  intelligence gain from 1.5 to 1. Reduced base armor from 1 to -1 (total armor is now 0.54).  Acid Spray Increased manacost from 120 to 160. Reduced radius from 700 to 550. Reduced cast range from 700 to 550.  Unstable Concoction now provides 500 radius ground vision around the target, starting upon cast, lasting until the projectile reaches it. Alchemist also faces the target for the whole channeling duration now.  Greevil's Greed Reduced Gold bonus cap from 20 to 18. Reduced stack duration from 20 to 18.  Chemical Rage Reduced health regen] from 15/30/60 to 10/30/60. Now grants 0/5/10 movement speed.",
  "6.50": " Increased  Acid Spray cast range from 625 to 900. Increased base  intelligence and gain from 17 + 1 to 25 + 1.8.  Chemical Rage Increased duration from 20 to 25. Increased health bonus from 200/400/600 to 350/700/1050. Increased movement speed bonus from 0/5/10 to 60/60/60.",
  "6.37": " Reduced movement speed from 300 to 290. Reduced base attack damage from 28-37 to 24-33 (total attack damage is now 49-58). Reduced base  strength and gain from 26 + 2.7 to 25 + 2.4. Reduced base  agility and gain from 17 + 1.5 to 11 + 1.2. Reduced  Acid Spray armor reduction from 4/5/6/7 to 3/4/5/6.  Unstable Concoction Increased cast range from 600 to 600/650/700/750. Reduced manacost from 80/95/110/125 to 75 on each level. Reduced cooldown from 20 to 16. Rescaled  Greevil's Greed extra gold bonus from 1/2/3/4 to 2 on each level.  Chemical Rage Increased Base Attack Time from 1.4/1.3/1.15 to 1.45/1.35/1.25. Increased health regen from 10/20/30 to 10/25/40. Increased cooldown from 40 to 45.",
  "6.36": " Created.",
  "6.39": " Increased movement speed from 290 to 300.  Unstable Concoction now deals damage:",
  "6.38": " Increased  Chemical Rage health regen from 10/25/40 to 15/30/60.",
  "6.36b": " Reduced base attack damage from 32-41 28-37 (total attack damage is now 54-63).  Acid Spray Reduced damage from 10/20/30/40 to 8/16/24/32. Reduced armor reduction from 4/5/6/8 to 4/5/6/7. Increased cooldown from 20 to 22. Reduced  Greevil's Greed gold bonus cap from 36 to 20. Increased  Chemical Rage Base Attack Time from 1.45/1.2/0.95 to 1.4/1.3/1.15.",
  "6.72d": " Undid melee hero collision change from 6.72c",
  "6.79": "  Chemical Rage No longer provides 250/500/750 bonus health. Increased health regen from 15/30/60 to 50/75/100.",
  "6.52": " Added an allied only visual indicator to  Unstable Concoction, showing for how long Alchemist is channeling it. Reduced  Chemical Rage movement speed bonus 60/60/60 to 30/40/60.",
  "6.72c": " Melee hero collision size now reduced from 24 to 12.",
  "6.75": "  Acid Spray Increased damage from 8/16/24/32 to 14/20/26/32. Reduced manacost from 160 to 130/140/150/160.  Unstable Concoction Increased max damage from 130/200/270/340 to 150/220/290/360. No longer displays the countdown numbers to enemies. Now always affects a 175 area around where it explodes (Includes when it explodes on Alchemist).  Greevil's Greed Increased stack duration from 20 to 25. Increased base bonus gold from 2/4/6/8 to 4/6/8/10. Rescaled extra gold bonus from 2 to 1/2/3/4. Reduced  Chemical Rage Base Attack Time from 1.45/1.3/1.15 to 1.4/1.2/1.0.",
  "6.74": " Increased base armor from -1 to 0 (total armor is now 1.54). Increased  Unstable Concoction max damage from 120/180/240/300 to 130/200/270/340.",
  "6.76": "  Unstable Concoction now explodes around you if you are killed while charging it up. Increased  Greevil's Greed gold bonus cap from 26 to 30.",
  "6.71": " Reduced Movement speed from 300 to 295. Reduced  Chemical Rage health bonus from 350/700/1050 to 300/600/900.",
  "6.73": " Increased  Greevil's Greed gold bonus cap from 18 to 26. Reduced  Chemical Rage Base Attack Time from 1.45/1.35/1.2 to 1.45/1.3/1.15.",
  "6.59": "  Acid Spray no longer damages  Tombstone Zombies.",
  "6.80": " Reduced night vision from 1400 to 800.  Unstable Concoction Reduced maximum brew duration from 7 to 5.5. Max power is still reached after 5 seconds. No longer continues to get stronger while it is in the air.",
  "6.82": "  Acid Spray Changed damage type from composite to physical (still pierces spell immunity). Increased armor reduction from 3/4/5/6 to 4/5/6/7. Reduced damage from 14/20/26/32 to 12/16/20/24.",
  "6.83": "  Greevil's Greed Increased base bonus gold from 4/6/8/10 to 6/8/10/12. Rescaled extra bonus gold per stack from 1/2/3/4 to 3. Rescaled gold bonus cap from 30 to 12/20/28/36. Increased stack duration from 25 to 30.",
  "6.84": "  Unstable Concoction Damage is no longer reduced by Damage Block. Countdown can now be seen by enemies. Now has an area targeting cursor.  Greevil's Greed now grants 4x gold bounty from runes. Added  Aghanim's Scepter upgrade for Alchemist: Alchemist can cast Aghanim's Scepter to directly grant any allied hero all Aghanim's Scepter bonuses as a buff (the hero upgrade and the stat upgrade). The scepter is consumed in the process. Multiple instances of this buff do not stack. Alchemist can target himself as well.",
  "6.78c": " Reduced  Chemical Rage health bonus from 300/600/900 to 250/500/750."
}