{"6.80": "  Ice Vortex Increased magic resistance reduction from 10%/15%/20%/25% to 15%/20%/25%/30%. Increased debuff linger duration from 0.1 to 0.5. Increased vortex duration from 12 to 16.", "6.81": " Increased  Chilling Touch attack speed slow from 15 to 20.", "6.84": "  Ice Vortex no longer ignores ancient creeps, Roshan and creep-heroes.  Chilling Touch buff can now be removed by clicking on the buff icon.", "6.78": " Reduced  Ice Vortex cooldown from 6 to 5. Increased  Ice Blast projectile and initial radius from 225 to 275. Added  Aghanim's Scepter for Ancient Apparition: Increases  Ice Blast duration from 8/9/10 to 17 on each level.", "6.65": " Created.", "6.81b": " Increased  Ice Vortex movement speed slow from 18%/22%/26%/30% to 15%/20%/25%/30%.", "6.77": " Reduced  Chilling Touch manacost from 140 on each level to 110/120/130/140", "6.76": " Increased  Chilling Touch number of attack from 2/3/4/5 to 3/4/5/6.", "6.70": " Added to Captain's Mode.", "6.72": " Reduced base armor from 1 to -1 (total armor is now 1.8).", "6.75": "  Chilling Touch Now also applies the damage and uses a charge when attacking creeps. Increased radius from 450 to 525. Increased damage from 40/50/60/70 to 50/60/70/80. Reduced duration from 40 to 30.  Ice Blast no longer allows Fountains to heal debuffed heroes.", "6.66": " Increased  Cold Feet manacost from 90 on each level to 90/100/110/120.  Ice Blast No longer ignores  Shallow Grave. Debuff is now dispelable. Reduced second projectile minimum speed from unknown to 750.", "6.79": " Reduced night vision from 1400 to 800. Reduced  Ice Vortex cooldown from 5 to 4.  Chilling Touch The buff is now always applied to Ancient Apparition even if he is not within the target area. Reduced cooldown from 50/46/42/38 to 50/42/34/26. Reduced  Ice Blast cooldown from 45 to 40.", "6.68": " Reduced base armor from 2 to 1 (total armor is now 3.8). Increased  Ice Blast cooldown from 44/32/20 to 45 on each level.", "6.67": " Increased  Cold Feet manacost from 90/10/110/120 to 150 on each level."}