{
  "6.63": "  Battle Hunger Reduced duration from 10/15/20/25 to 10/13/16/19. Increased damage from 15/15/20/25 to 15/17/25/33. Overall, same damage over a shorter duration.",
  "6.60": " Reduced base armor from 0 to -1 (total armor is now 1.8).  Battle Hunger is now properly blocked by  Linken's Sphere.",
  "6.40": " Increased  Berserker's Call radius by from 275 to 300.",
  "6.67": " Reduced  Aghanim's Scepter upgraded  Culling Blade cooldown from 20 to 15.",
  "6.42": "  Battle Hunger Reduced cooldown from 25 to 25/20/15/10. Reduced manacost from 105/115/125/135 to 75/85/95/105.",
  "6.65": " Added  Aghanim's Scepter upgrade for Axe: Reduces  Culling Blade cooldown from 75/65/55 to 20.",
  "6.00": " Created.",
  "6.68": "  Battle Hunger now slows the target by 8% until it runs out or kills another unit.",
  "6.69": " Reduced  Aghanim's Scepter upgraded  Culling Blade cooldown from 15 to 10. Increased  Battle Hunger slow increased from 8% to 10%.",
  "6.04": "  Counter Helix no longer has a chance to trigger on attacks from wards.",
  "6.46": " Fixed  Battle Hunger failing to detect when the affected unit killed a units with certain spells.",
  "6.07": " Fixed some memory leak issues on  Berserker's Call.  Counter Helix Fixed an issue where its chances to proc got worse if many units attacked axe. Fixed Axe permanently spinning until Axe is ordered to move. Fixed some memory leak issues.  Culling Blade Fixed interaction with  Blade Mail. Fixed some memory leak issues.",
  "6.83c": "  Berserker's Call No longer affects invulnerable units. No longer keeps targets disabled when Axe dies while the targets still have the debuff on. Reduced  Culling Blade kill threshold from 250/350/450 to 250/325/400. Reduced  Aghanim's Scepter upgraded  Culling Blade kill threshold from 300/450/625 to 300/425/550.",
  "6.53": " Fixed  Berserker's Call not affecting sleeping units.",
  "6.50": " Increased base  strength from 19 to 25. Reduced base  agility from 22 to 20.",
  "6.35": " Increased base armor from -1 to 0 (total armor is now 3.08). Fixed  Berserker's Call being able to get units out of  Chronosphere.",
  "6.34": " Fixed  Culling Blade interaction with  Dispersion.",
  "6.09": " Reduced  Berserker's Call radius from 250/300/350/400 to 100/150/200/250.  Counter Helix Increased cooldown from 0.25 to 0.6. No longer damages wards.",
  "6.02": "  Battle Hunger Reduced cooldown from 30 to 25. Increased manacost from 75/90/105/120 to 105/115/125/135. Increased damage from 10/15/20/25 to 15/15/20/25. Reduced duration from 20/25/30/35 to 10/15/20/25.  Counter Helix Increased damage from 150 to 175. No longer whirls the triggering unit around axe when it was in range.  Culling Blade Increased damage from 100/200/300 to 200/300/400. Increased kill threshold from 175/290/400 to 290/400/550. Increased manacost from 95/135/175 to 120/160/200. Reduced cooldown from 75 to 75/65/55.",
  "6.72d": " Increased base health regeneration from 1 to 1.25. Undid melee hero collision change from 6.72c",
  "6.03": " Changed primary attribute from  agility to  strength. Increased  Battle Hunger cast range from 650 to 900.",
  "6.79": " Increased  Berserker's Call radius from 275 to 300.  Battle Hunger Reduced duration from 10/13/16/19 to 10/12/14/16. Reduced damage from 15/21/27/33 to 15/20/25/30. Increased Movement speed slow/bonus from 8% to 10%. Is now dispellable.  Counter Helix Reduced cooldown from 0.55/0.5/0.45/0.4 to 0.45/0.4/0.35/0.3. Now hits siege units.  Culling Blade No longer goes on cooldown if it successfully kills a hero. Reduced manacost from 120/160/200 to 60/120/180. Reduced kill threshold from 300/450/625 to 250/350/450 Increased speed bonus from 25% to 40% Increased speed bonus radius from 600 to 900. The 40% speed bonus now applies to attack speed as well.  Aghanim's Scepter now increases the speed bonus duration from 6 to 10.  Aghanim's Scepter now increases the kill threshold from 250/350/450 to 300/450/625.",
  "6.78": " Reduced  Counter Helix cooldown from 0.65/0.6/0.55/0.5 to 0.55/0.5/0.45/0.4.",
  "6.51": " Increased  Counter Helix proc chance from 15% to 17%.",
  "6.72c": " Melee hero collision size now reduced from 24 to 12.",
  "6.75": " Increased  Berserker's Call armor bonus from 30 to 40.  Battle Hunger Reduced slow from 10% to 8%. Increased movement speed bonus from 4% to 8% per affected enemy. Increased  Counter Helix damage from 100/130/160/190 to 100/135/170/205.",
  "6.10": "  Berserker's Call Increased radius from 100/150/200/250 275 on each level. Increased duration from 3.5 on each level to 1.5/2/2.5/3.  Counter Helix Changed damage type from universal to physical. Reduced damage from 175 to 100/125/150/175. Rescaled proc chance from 5%/10%/15%/20% to 15% on each level. Fixed some memory leak issues on  Battle Hunger.  Culling Blade Reduced damage from 200/300/400 to 150/250/300. Increased kill threshold from 290/400/550 to 300/450/625.",
  "6.71": " Reduced  Battle Hunger cooldown from 25/20/15/10 to 20/15/10/5.",
  "6.70": " Increased  Berserker's Call armor bonus from 5/10/15/20 to 30 on each level.",
  "6.73": " Reduced  Aghanim's Scepter upgraded  Culling Blade cooldown from 10 to 6. Increased base  intelligence from 14 to 18. Increased base health regeneration from 1.25 to 2.  Battle Hunger now grants Axe a 4% bonus movement speed bonus per affected enemy. Reduced  Berserker's Call cooldown from 14 to 10.  Counter Helix Increased damage from 100/125/150/175 to 100/130/160/190. Reduced cooldown from 0.7/0.65/0.6/0.55 to 0.65/0.6/0.55/0.5.  Culling Blade now applies a 25% movement speed bonus for 6 seconds to all allied units within 600 radius of Axe if he successfully kills an enemy with Culling Blade.",
  "6.72": " Increased base health regeneration from 0.25 to 1. Increased attack range from 125 to 128. Increased  Battle Hunger damage from 15/17/25/33 to 15/21/27/33.",
  "6.58": " Rescaled  Counter Helix cooldown from 0.6 to 0.7/0.65/0.60/0.55.",
  "6.80": " Increased base health regeneration from 2 to 3.  Berserker's Call Increased duration from 1.5/2/2.5/3 to 2.0/2.4/2.8/3.2. Increased cooldown from 10 to 16/14/12/10.",
  "6.81": "  Counter Helix now uses Pseudo Random chance. This reduces the chances that very lucky or unlucky streaks of procs occur.",
  "6.82": " Increased  Counter Helix proc chance from 17% to 20%.  Culling Blade is now blocked by  Linken's Sphere.",
  "6.83": "  Battle Hunger Reduced duration from 10/12/14/16 to 10. Increased damage from 15/20/25/30 to 16/24/32/40. Reduced cast range from 900 to 750. Increased movement speed bonus and slow from 10 to 12%. Reduced manacost from 75/85/95/105 to 75.",
  "6.84": "  Berserker's Call No longer ignores ancient creeps, Roshan and creep-heroes. Increased cast point from 0.3 to 0.4.  Counter Helix Damage is no longer reduced by Damage Block. Now triggers when attacks land rather than when they start. Reduced  Culling Blade movement speed/attack speed bonus from 40%/40 to 30%/30.",
  "6.57": " Fixed being able to drop items while affected by  Berserker's Call.",
  "6.27": " Fixed a bug with  Berserker's Call and  Shackles.",
  "6.45": " Fixed  Battle Hunger malfunctioning when the target is affected by  Gush.",
  "6.29": "  Berserker's Call no longer affects ancient creeps and Roshan (originally, this change was done to prevent an exploit with call and roshan)."
}