{"6.63": " Increased  Fiend's Grip manacost from 100/175/250 to 200/300/400.", "6.60": " Increased  Enfeeble cast range from 800 to 1000.  Brain Sap is now properly blocked by  Linken's Sphere. Added  Aghanim's Scepter upgrade for Bane: Increases  Fiend's Grip damage per second from 100/155/215 to 155/215/270.", "6.00": " Reduced  Nightmare manacost from 175 to 165.", "6.68": " Reduced  Brain Sap cooldown from 20 to 16.  Aghanim's Scepter now also increases  Fiend's Grip mana drain per second from 5% to 10%.", "6.69": " Rescaled  Enfeeble attack damage reduction from 30%/60%/90%/120% to 40%/60%/80%/100% (above 100% didn't work properly). Increased  Brain Sap damage/heal from 75/150/225/300 to 90/160/230/300.  Nightmare Fixed not canceling enemy consumables. Added Disablehelp support for Nightmare.", "6.07": " Increased attack range from 300 to 400.", "6.30": "  Nightmare Now puts attacking units asleep instantly upon attack start, instead of 0.5 seconds after attack start. Now transfers the nightmare to the attacking unit, instead of putting the attacking unit asleep without waking up the attacked unit. Fixed transfered Nightmare's duration being 5/7/9/11, instead of 4/5/6/7.", "6.16": " Fixed  Enfeeble being castable on self. Fixed  Nightmare not canceling consumables.", "6.36": " Reduced  Nightmare cast range from 650 on each level to 500/550/600/650.  Fiend's Grip now properly stops when running out of mana.", "6.72d": " Reduced  Enfeeble manacost from 125 to 95/105/115/125.", "6.10": "  Enfeeble Increased attack damage reduction from 20%/30%/40%/50% to 20%/40%/60%/80%. Reduced duration from 40 to 20. Reduced cooldown from 20 to 15.", "6.50": "  Enfeeble. Increased cast range from 500 to 800. Increased attack damage reduction from 20%/40%/60%/80% to 30%/60%/90%/120%.", "6.75": "  Enfeeble Can no longer be dispelled by anything. Increased attack damage reduction from 25/50/75/100 to 30/60/90/120. Increased  Aghanim's Scepter upgraded  Fiend's Grip duration from 6 to 7.", "6.76": " Reduced  Enfeeble cooldown from 12 to 10. Added a new sub-ability,  Nightmare End, which allows Bane to wake himself up from  Nightmare.", "6.71": "  Aghanim's Scepter now also increases  Fiend's Grip duration from 5 to 6.", "6.70": " Reduced  Fiend's Grip cooldown from 120 to 100.", "6.73": " Increased movement speed from 305 to 315. Increased base  strength from 18 to 22. Increased base  agility from 18 to 22. Increased base  intelligence from 18 to 22.", "6.72": "  Enfeeble Now reduces a fixed of 25/50/75/100 attack damage, instead of 40%/60%/80%/100% of main attack damage. Reduced cooldown from 15 to 12. Reduced  Brain Sap cooldown from 16 to 14.  Fiend's Grip now gives shared vision of the target.", "6.29b": " Increased movement speed from 297 to 305. Fixed being able to cast  Brain Sap on allies.", "6.58": "  Enfeeble no longer reduces health regeneration by 1/2/3/4 (dying to this counted as self-deny). Reworked  Fiend's Grip", "5.75": " Created.", "5.76": " Reduced  Brain Sap damage/heal from 100/200/300/400 to 75/150/225/300.  Nightmare Reduced cast range from 800 to 650. Reduced duration from 5/7/9/11 to 4/5/6/7.", "6.82": " Changed  Nightmare damage type from HP Removal to Pure.  Aghanim's Scepter now causes any enemy hero attacking Bane while channeling  Fiend's Grip to be afflicted with his current level of  Nightmare.", "6.83": " Rescaled  Nightmare cooldown from 15 to 16/15/14/13.", "6.84": " Reduced  Brain Sap manacost from 125/150/175/200 to 100/125/150/175.  Nightmare now causes the target enemy to no longer provide vision.  Nightmare End now wakes up every unit put asleep by Bane.", "6.20": " Changed  Nightmare damage type from HP Removal to pure.", "6.21": "  Nightmare Reverted damage type change of last patch. No longer deals damage to courier.", "6.29": " Fixed  Brain Sap requiring channeling and potentially doing nothing when canceled fast enough."}