{
  "6.63": " Increased  Hawk  Invisibility duration from 4 to 6.",
  "6.60": " Replaced  Beast Rage with a new ability:  Inner Beast.",
  "6.40": "  Hawk Reduced movement speed from 350 on each level to 280/280/350/350. Reduced day vision from 1600 on each level to 500/500/1600/1600. Reduced night vision from 1200 on each level to 500/500/1200/1200. Reduced health from 300/300/875/875 to 25 on each level. Increased Gold bounty from 0 on each level to 30/30/100/100.",
  "6.67": " Fixed  Wild Axes being unable to cut down the trees from  Sprout. Increased  Hawk bounty from 30/30/40/40 to 30/30/65/65 gold.",
  "6.69": "  Hawk Reduced health from 100/100/200/200 to 50/50/100/100. Reworked  Invisibility:  Invisibility If motionless for 8 seconds, the Greater Hawk becomes invisible (passive ability). The invisibility is lost instantly upon moving.",
  "6.49": " Increased  Call of the Wild cooldown from 45 to 45/50/55/60.",
  "6.46": " Reduced  Hawk movement speed from 280/280/350/350 to 280/280/320/320.  Primal Roar no longer shoves allied units aside.",
  "6.66": "  Wild Axes now properly hit invisible units.",
  "6.52": " Reduced  Hawk movement speed from 280/280/320/320 to 280 on each level.  Primal Roar Increased cooldown from 70/65/60 to 80/75/70. Fixed a bug when the target blinked away upon cast.",
  "6.72c": " Melee hero collision size now reduced from 24 to 12.",
  "6.31": "  Hawk True Sight replaced with  Permanent Invisibility. Fixed Beastmaster getting slowed when  Wild Axes damage an enemy which has a frost armor on (from  Lich or the Ogre Frostmage).",
  "6.30": " Created.",
  "6.33": " Fixed minor casting bug with  Wild Axes.  Beast Rage Now adds a stack on each attack, instead of every 4th/3rd/2nd/1st attacks. Increased attack speed bonus per stack from 10% to 5%/10%/15%/20%.  Primal Roar Reduced cooldown from 180 to 120/100/80. Reduced manacost from 175/250/325 to 150/175/200.",
  "6.35": "  Wild Axes now move a bit faster (take 3 seconds to fully return to Beastmaster, instead of 4 seconds). Increased armor from -1 to 0 (total armor is now 2.52).",
  "6.34": " Increased  Primal Roar stun duration from 2/3/4 to 3/3.5/4.",
  "6.37": " Reduced  Primal Roar cooldown from 120/100/80 to 60. Reduced  Call of the Wild manacost from 50 to 25.",
  "6.30b": "  Primal Roar no longer damages and slows allied units (still shoves them aside though).",
  "6.38": " Increased base armor from 0 to 2 (total armor is now 4.52).",
  "6.50": " Fixed some bugs on  Wild Axes. Increased  Primal Roar cooldown from 60 to 70/65/60.",
  "6.72d": " Undid melee hero collision change from 6.72c",
  "6.55": "  Call of the Wild Reduced cooldown from 45/50/55/60 to 40 on each level. According to the official changelog, the duration was reduced from 60/70/80/90 to 60, but that was not the case.  Hawk Replaced  Permanent Invisibility with an active  Invisibility: Duration: 5 seconds, Fade Time: 1 second, Cooldown: 30 seconds Increased health from 25 on each level to 100/100/200/200. Increased gold bounty from 30/30/100/100 to 30/30/40/40. Increased movement speed from 280 on each level to 280/280/400/400.  Boar Reduced health from 400/400/700/700 to 400/400/500/500.",
  "6.79": "  Inner Beast Reduced radius from 1000 to 900. Rescaled attack speed bonus from 18/26/32/40 to 15/25/35/45.  Call of the Wild Now has two abilities for summoning each unit independently:  Call of the Wild: Hawk &  Call of the Wild: Boar Reduced manacost from 25 to 15. Reduced cast time from 0.5 to 0.3.",
  "6.78": " Decreased  Hawk  Invisibility fade time from 5 to 4.",
  "6.84b": " Reduced Hawk movement speed from 250/300/350/400 to 250/275/300/325.",
  "6.72": " Increased attack range from 100 to 128.  Wild Axes now move at similar speed to the max range (so it isn't as slow for short range targeting). Decreased  Hawk  Invisibility fade time from 8 to 5. Added  Aghanim's Scepter upgrade for Beastmaster: Increases  Primal Roar cast range from 600 to 950 and reduces cooldown from 80/75/70 to 45 on each level. Fixed  Primal Roar not being blocked properly by  Linken's Sphere.",
  "6.33b": " Beastmaster now loses 50% of his stacks on  Beast Rage when changing attack targets, instead of losing them all.",
  "6.80": " Reduced  Call of the Wild: Hawk duration from 60/70/80/80 to 60. Reduced  Call of the Wild: Boar duration from 70/80/90 to 60. Boars and Hawks from previous casts are no longer killed upon summoning a new one.",
  "6.81": " Increased base attack damage from 33-37 to 37-41 (total attack damage is now 60-64).",
  "6.82": "  Wild Axes Changed Damage type from Composite to Physical. Reduced damage from 90/120/150/180 to 70/100/130/160.  Primal Roar Increased side knockback radius from 250 to 300. Secondary targets now take the same damage as the primary target (100/200/300 to 200/250/300). Increased Push distance from 240 to 300. Increased Push duration from 0.4 to 0.6.",
  "6.83": "  Call of the Wild now always provides a Hawk and a Boar at each level.  Hawk Rescaled health from 50/50/100/100 to 40/60/80/100. Rescaled movement speed from 270/270/400/400 to 250/300/350/400. Increased day sight from 500/500/1600/1600 to 700/1000/1300/1600. Rescaled night sight from 500/500/1200/1200 to 700/800/900/1000. Rescaled gold bounty from 30/30/65/65 to 30/40/50/60. [Undocumented] Increased health regeneration from 0.5/0.5/1.5/1.5 to 1.5. [Undocumented] Increased experience bounty from 20/20/77/77 to 77. [Undocumented] Increased armor from 0/0/5/5 to 5. [Undocumented] The hawks are now always named Hawk, instead of Scout Hawk or Greater Hawk.  Boar Rescaled health from 0/400/400/500 to 200/300/400/500. Increased base attack damage from 0/23-29/23-29/43-49 to 15-15/30-30/45-45/60-60. Rescaled Base Attack Time from 0/1.5/1.5/1 to 1.25. Increased  Poison slow from 0%/20%/20%/35% to 10%/20%/30%/40%. [Undocumented] The boars are now always named Boar, instead of Lesser Boar or Greater Boar.",
  "6.84": " Increased base attack damage from 37-41 to 41-45 (total attack damage is now 64-68). Reduced Wild Axes cast point from 0.5 to 0.4. Reduced  Boar attack point from 0.633 to 0.5.  Primal Roar no longer ignores ancient creeps, Roshan and creep-heroes."
}