{"6.63": " Reduced base armor from 2 to 0 (total armor is now 3.36).", "6.61": "  Blood Bath no longer heals Bloodseeker upon killing illusions.", "6.65": "  Bloodrage Reduced duration from 6/9/12/15 to 6/7/8/9. Rescaled cooldown from 10 to 12/10/8/6. Increased damage per second from 20/15/10/5 to 20 on each level.", "6.00": " Created", "6.01": " Fixed Demon Fury changing Bloodseeker's color.", "6.68": " Increased  agility gain from 2.6 to 3.0.", "6.69": " Added -disablehelp for  Bloodrage.", "6.04": " Removed Bloodseeker.", "6.50": " Rescaled  Bloodrage damage per second from 2/4/6/8 to 20/15/10/5.", "6.13": " Re-added and reworked Bloodseeker. Changed primary attribute from  intelligence to  agility. Increased base  strength from 17 to 19. Increased base  agility and gain from 15 + 1.6 to 24 + 2.6. Reduced base  intelligence from 21 + 2.6 to 18 + 1.7. Removed Bleed Removed Demon Fury  Bloodrage Is now Bloodseeker's first ability, instead of second. Changed legacy hotkey from B to D. Reduced duration from 15 on each level to 6/9/12/15. Added new ability", "6.35": " Increased base armor from 0 to 2 (total armor is now 5.36).  Thirst Is no longer an active ability with a 30 second duration, 100 manacost and 60 seconds cooldown. Is now a passive ability. Reduced radius from global to 1500/3000/4500/6000", "6.39": " Reduced  Thirst visibility health threshold from 50% to 40%.", "6.02": " Bleed Increased cooldown from 0 to 16. Increased manacost from 120 on each level to 110/120/130/140.", "6.72d": " Undid melee hero collision change from 6.72c", "6.55": " Increased  Blood Bath heal from creeps from 5%/10%/15%/20% to 10%/15%/20%/25% of the unit's health.", "6.54": "  Bloodrage Reduced manacost from 80/100/120/140 to 80 on each level. Reduced cooldown from 20 to 10.", "6.79": " Reduced base movement speed from 305 to 300.  Thirst No longer grants shared vision with enemies below the health threshold, but only shows their models through the fog of war instead Bonuses on Bloodseeker no longer linger for 3 seconds when the target dies Now removes the movement speed cap of 522 for Bloodseeker Bonuses on Bloodseeker now stack for each enemy hero below the threshold Increased radius from 6000 to global Increased visibility health threshold from 20%/30%/40%/50% to 50% on each level Increased invisible enemy reveal health threshold from 10%/15%/20%/25% to 25% on each level Reduced movement speed bonus from 15%/25%/35%/45% to 7%/14%/21%/28% No longer provides 3/4/5/6 armor Now provides 7/14/21/28 attack damage  Rupture no longer ignores its cast backswing.", "6.78": "  Bloodrage now dispels the target upon cast  Thirst now increases armor by 3/4/5/6 when active. Changed  Rupture damage type from pure to hp removal.", "6.72c": " Melee hero collision size now reduced from 24 to 12.", "6.75": " Increased  Bloodrage attack damage bonus from 20%/40%/60%/80% to 30%/60%/90%/120%. Increased  Blood Bath enemy hero death detection radius from 225 to 325.  Thirst Increased radius from 1500/3000/4500/6000 to 6000 on each level. Increased movement speed bonus from 11%/22%/33%/44% to 15%/25%/35%/45%. Rescaled enemy hero visibility health threshold from 40% on each level to 20%/30%/40%/50%. Rescaled invisible enemy hero reveal health threshold from 20% to 10%/15%/20%/25%.", "6.71": "  Blood Bath now heals Bloodseeker by 5%/10%/15%/20% of a dying enemy hero's health when he is within 225 range of it. Bloodseeker is still healed by 10%/20%/30%/40% if he is the killer.", "6.73": "  Thirst No longer partially reveals invisible heroes below 40% health. Now fully reveals invisible heroes below 20% health.  Rupture Increased duration from 5/7/9 to 7/8/9. Reduced cooldown from 70 to 70/60/50.", "6.72": " Increased attack range from 100 to 128.", "6.82c": "  Bloodrage now only amplifies for half of the value when the dealer and the receiver are over 2200 range apart.", "6.58": " Increased base  strength from 18 to 23. Reduced  Rupture cooldown from 100 to 70.", "6.80": " Increased  Blood Bath heal from dying enemy heroes within 325 radius from 5%/10%/15%/20% to 10%/20%/30%/40% of their max health.  Thirst Increased movement speed bonus from 7%/14%/21%/28% to 5%/15%/25%/35%. Increased attack damage bonus from 7/14/21/28 to 5/15/25/35.", "6.81": "  Bloodrage Reduced cast point from 0.6 to 0.4. Can no longer be dispelled by anything.", "6.82": " Removed from Captain's Mode. Reduced base movement speed from 300 to 290. Reworked  Bloodrage", "6.83": " Added to Captain's Mode  Bloodrage no longer amplifies outgoing damage if the damage has the no-reflection flag (i.e. no longer amplifies  Blade Mail or  Fatal Bonds damage).", "6.84": "  Thirst Now scales up to 25% health (total speed and damage remain the same). Reduced invisible enemy reveal health threshold from 30% to 25%.  Blood Rite no longer ignores ancient creeps, Roshan and creep-heroes.", "6.03": " Bleed Reduced movement speed slow from 20%/30%/40%/50% to 10%/15%/20%/25%. Reduced attack speed slow from 20/30/40/50 to 10/15/20/25.", "6.14": "  Rupture Now displays a status debuff icon on the target Now uses a projectile (speed unknown) Changed damage type from hp removal to pure Reduced manacost from 200/250/300 to 100/150/200. Reduced cooldown from 120 to 70.", "6.20": "  Rupture Increased initial damage from 100/200/300 to 150/250/350. Reduced duration from 7/10/13 to 5/7/9.", "6.21": "  Rupture No longer uses a projectile. No longer displays a status debuff icon. Increased manacost from 100/150/200 to 150/200/250. Increased cooldown from 70 to 100.", "6.28": " Now displays a status debuff icon on the target"}