{"6.63": "  Insatiable Hunger Increased lifesteal from 40%/55%/70% to 40%/60%/80%. Increased duration from 12 to 14.", "6.60": " Changed Spiderlings' and Spiderites' armor type from medium to normal (damage taken from towers from 50% to 100%).", "6.40": " Increased Spiderling health from 350 to 450.", "6.00": " Increased  strength gain from 2.0 to 2.5.  Incapacitating Bite Reduced enemy miss chance from 10%/20%/35%/45% to 10%/15%/20%/25%. Reduced movement speed slow from 15%/25%/40%/50% to 10%/20%/30%/40%.  Insatiable Hunger Reduced attack damage bonus from 50/75/100 to 40/75/85. Reduced manacost from 125/175/225 to 125/145/175.", "6.68": " Reduced base armor from 2 to 0 (total armor is now 2.52).", "6.69": " Increased Spiderlings experience bounty from 20 to 31.", "6.49": " Reduced attack point from unknown to 0.4. Reduced all spells' cast point from 0.5 to 0.2.", "6.18": " Fixed Spiderlings giving way more experience than intended.", "5.63": "  Spawn Spiderlings can no longer be cast on allied units.  Spawn Spiderling (Spiderling ability) Can no longer be cast on allied units. No longer deals 5 damage per second. Increased cooldown from 8 to 14. Renamed to Spawn Spiderite. Now spawns a Spiderite, instead of another Spiderling. Spiderites deal 7-8 damage, have 0 armor, 175 health, no abilities and last for 30 seconds. Are not affected by Spin Web.  Spin Web no longer affects Spiderlings.  Incapacitating Bite Increased proc chance from 20%/30%/40%/50% to 100% on each level. Reduced enemy miss chance from 50% on each level to 10%/20%/30%/40%.", "5.62": " Created.", "5.65": " Increased  Poison Sting movement speed slow from 10% to 15%. Reworked  Spawn Spiderite", "6.52": " Rescaled  Insatiable Hunger cooldown from 60/45/30 to 45 on each level.", "6.50": "  Spin Web No longer provides True Sight. Increased movement speed bonus from 20% on each level to 20%/23%/26%/29%.  Insatiable Hunger Is now longer dispelable. Increased lifesteal from 40%/50%/60% to 40%/60%/80%. Reduced cooldown from 60 on each level to 60/45/30.", "6.35": " Increased base armor from 0 to 2 (total armor is now 4.52). Changed Spiderlings' and Spiderites' armor type from heavy to medium (damage taken from towers from 125% to 50%).", "6.34": "  Spin Web Now provides vision within its radius. No longer blocks neutral creep camps.", "6.39": " Fixed  Poison Sting slowing attack speed, instead of movement speed. Increased  Spin Web health regeneration bonus from 2 on each level to 2/4/6/8.", "5.64": " Fixed  Spin Web's buffs lasting permanently on Broodmother.", "6.72d": " Undid melee hero collision change from 6.72c", "6.55": "  Spin Web Reduced vision radius from 500 to 200. Reduced manacost from 140 to 50. Reduced cooldown from 90/75/60/45 to 90/70/50/30.  Insatiable Hunger Increased attack damage bonus from 60/75/90 to 60/80/100. Reduced lifesteal from 40%/60%/80% to 40%/55%/70%. Reduced duration from 20 to 12.", "6.54": " Increased transparency of  Spin Webs (to prevent them from blocking vision).", "6.79": " Removed from Captain's Mode.  Spin Web Increased radius from 650 to 900. Increased cast range from 600 to 1000. Increased cast point from 0.2 to 0.4. No longer destroys trees. Now grants Broodmother unobstructed movement (can walk over cliffs, trees, etc). Bonuses no longer linger and are instantly lost upon leaving a spin web.", "6.78": " Increased  Spawn Spiderlings number of Spiderlings from 1/2/3/3 to 1/2/3/4. Increased  Incapacitating Bite enemy miss chance from 10%/20%/30%/40% to 30%/40%/50%/60%.", "6.84c": " Reduced  Poison Sting movement speed slow from 15% to 12%.", "6.72c": " Reduced movement speed from 310 to 295.  Spawn Spiderlings Reduced number of spiderlings from 1/2/3/4 to 1/2/3/3. Rescaled manacost from 80/100/120/140 to 120 on each level. Spiderlings and Spiderites are now affected by Spin Web. Changed Spiderlings' and Spiderites' armor type from normal to heavy (damage taken from towers from 100% to 125%). Changed Spiderlings' attack type from normal to chaos (damage against buildings from 70% to 40%, against heroes from 75% to 100%). Increased Spiderlings' model size to make them easier distinguishable from Spiderites.  Spin Web Increased radius from 500 to 650. Increased movement speed bonus from 20%/23%/26%/29% to 20%/25%/30%/35%. Reduced cooldown from 90/70/50/30 to 30 on each level. Melee hero collision size now reduced from 24 to 12.", "6.75": " Increased Spiderite gold bounty from 11-13 to 16-21.  Incapacitating Bite No longer grants 2/4/6/8 attack damage. Increased enemy miss chance from 10%/15%/20%/25% to 10%/20%/30%/40%.", "6.17": " Increased movement speed from 313 to 315. Increased Spiderling attack damage from 15-16 to 18-19. Increased Spiderite attack damage from 7-8 to 9-10.  Spin Web Reduced manacost from 200 to 140. Increased movement speed bonus from 10% to 20%.  Insatiable Hunger Reduced attack dmage bonus from 60/90/120 to 60/75/90. Increased duration from 20 to 30. Reduced manacost from 125/145/175 to 100 on each level. Reduced cooldown from 100/90/80 to 60 on each level.", "6.10": "  Spin Web now provides True Sight within its radius.", "6.71": " Reduced movement speed from 315 to 310.  Spawn Spiderlings Increased debuff duration from 0.9 to 2. Increased manacost from 75/90/105/120 to 80/100/120/140.", "6.15": "  Insatiable Hunger Increased attack damage bonus from 40/75/85 to 60/90/120. Increased duration from 15 to 20.", "5.72": " Changed  Spin Web invisibility type.  Incapacitating Bite Reduced chance to proc from 100% to 10%/20%/30%/40%. Increased enemy chance to miss from 10%/20%/30%/40% to 90% on each level. Increased movement speed slow from 25%/35%/50%/65% to 80% on each level. Reduced cooldown from 4 to 0.", "5.74": "  Incapacitating Bite Increased proc chance from 10%/20%/30%/40% to 100% Reduced enemy chance to miss from 90% on each level to 10%/20%/35%/45%. Reduced movement speed slow from 80% on each level to 15%/25%/40%/50%. Now passively grants Broodmother 2/4/6/8 attack damage.  Insatiable Hunger Increased attack damage bonus from 25/50/75 to 50/75/100. Increased duration from 10 to 15.", "6.80": "  Spin Web No longer provides 200 vision. No longer allows Broodmother to leave the map boundaries. Unobstructed movement is now lost when enemies have vision over Broodmother.", "6.81": " Increased  Poison Sting damage per second from 4 to 8.  Spin Web Unobstructed movement is no longer lost when enemies have vision over Broodmother. Unobstructed movement is now lost for 3 seconds when Broodmother takes damage. Uses the same damage source rules as  Blink Dagger. Increased  Insatiable Hunger lifesteal from 40%/60%/80% to 60%/80%/100%.", "6.82": "  Spin Web: Now has 1/2/3/4 charges with a 40 second replenish time, instead of a 30 second cooldown Still has a max of 2/4/6/8 Webs total. Unobstructed movement is now lost for 6 seconds upon taking damage, instead of 3. Movement speed bonus is now doubled while having unobstructed movement. Unobstructed movement and movement speed bonuses now affect Spiderlings and Spiderites. Spin Webs are now selectable and have an ability to destroy themselves. Can now be cast from anywhere as long as the new web touches another. Whenever Broodmother or her spiders are lose the unobstructed movement, trees around them are destroyed.", "6.83": " Reduced Spiderlings' and Spiderites' day vision reduced from 1400 to 1100.", "6.84": "  Incapacitating Bite is no longer a Unique Attack Modifier. Increased  Insatiable Hunger attack damage from 60/80/100 to 60/90/120.", "6.24": " Fixed an issue with  Spin Webs in Death Match mode.", "6.20": " Reduced  Insatiable Hunger duration from 30 to 20."}