{"6.44": " Increased movement speed from 290 to 295.", "6.60": " Added  Aghanim's Scepter upgrade for Chen: Reduces  Hand of God cooldown from 120 to 30.", "6.40": " Reduced movement speed from 295 to 290.", "6.67": " Reduced  Test of Faith cooldown from 30 to 30/28/26/24.", "6.00": " Reworked Chen. Changed primary attribute from  intelligence to  strength. Increased base  strength and gain from 20 + 1.5 to 22 + 2.6. Reduced base  agility and gain from 15 + 2 to 13 + 1.4. Reduced base  intelligence and gain from 21 + 2.6 to 17 + 2.2. Rescaled base attack damage from 22-29 to 26-28 (total attack damage is now 48-50). Increased base armor from -1 to 0 (total armor is now 1.82). Reduced attack range from 550 to 500. Purge Renamed to Battle Purge Reduced movement speed slow from 100% to 10%/20%/30%/40% Now also slows attack speed by 10/20/30/40. Increased duration from 6 to 7. No longer deals 1000 damage to summoned units. Replaced Critical Strike with Perdition", "6.01": " Perdition Increased manacost from 60 to 120. Increased cooldown from 0 to 2.5.", "6.02": " Perdition can no longer be cast on buildings.", "6.03": " Increased Divine Intervention cooldown from 300/240/180 to 600/480/360.", "6.04": " Removed Chen.", "6.49": " Increased movement speed from 295 to 100.", "6.31": "  Hand of God Increased manacost from 150/200/250 to 200/300/400. Increasd cooldown from 70 to 120.", "6.19b": " Fixed some bugs with  Penitence damage amplification. Added disablehelp support for  Test of Faith.", "6.16": " Fixed a lag issue with  Penitence. Fixed persuaded creeps dying when an illusion of chen dies.", "6.18": "  Holy Persuasion No longer grants persuaded creeps 50% magic resistance. Changed legacy hotkey from U to R.", "6.79": "  Test of Faith (Teleport) is now dispellable. Increased  Hand of God cooldown from 140/130/120 to 160/140/120.", "6.84c": "  Holy Persuasion now provides a base health minimum of 700/800/900/1000 instead of a raw 75/150/225/300 health bonus.", "6.75": "  Holy Persuasion no longer has the ability to teleport allied units.  Test of Faith now grants a secondary ability to teleport allied units.", "6.71": " Reduced  Test of Faith cooldown rescaled from 30/28/26/24 to 24.", "6.76": " Increased  Penitence damage amplification from 7%/14%/21%/28% to 8%/16%/24%/32%. Increased  Hand of God cooldown from 120 on each level to 140/130/120.", "6.17": " Fixed  Test of Faith and  Hand of God disabling Chen during their cast time and being not interruptable.", "6.70": " Reduced  Holy Persuasion cooldown from 30 to 30/26/22/18.", "6.15": " Re-added and reworked Chen. Changed primary attribute from  strength to  intelligence. Reduced base  strength and gain from 22 + 2.6 to 20 + 1.5. Increased base  agility and gain from 13 + 1.4 to 15 + 2.1. Increased base  intelligence from 17 + 2.2 to 21 + 2.8. Rescaled base attack damage from 26-28 to 22-32 (total attack damage is now 43-53). Reduced base armor from 0 to -1 (total armor is now 1.1). Increased attack range from 500 to 600. Increased movement speed from unknown to 310. Replaced Battle Purge with  Penitence", "6.72": " Moved the teleportation part of  Test of Faith to  Holy Persuasion.", "6.81": " Reduced  Penitence cooldown from 14 to 14/13/12/11.", "6.82": "  Penitence Now directly amplifies damage, instead of attempting to re-deal a percentage of the damage taken as physical damage. Increased cast range from 600 to 800. Increased slow and damage amplification from 8%/16%/24%/32% to 14%/18%/22%/26% Rescaled duration from 7 on each level to 5/6/7/8.  Holy Persuasion now pierces spell immunity (can convert spell immune units).  Aghanim's Scepter now also allows Holy Persuasion to be cast on ancient creeps (maximum 1 ancient creep per level of Hand of God).", "6.83": "  Test of Faith (Teleport) now teleports all of Chen's units towards him cast on self. Uses the same delay as when cast on allied heroes. Increased  Holy Persuasion max units from 1/1/2/3 to 1/2/3/4.", "6.25": " Reduced movement speed from 310 to 300.", "6.20": " Reduced  Penitence damage amplification from 8%/16%/24%/32% to 7%/14%/21%/28%. Increased  Test of Faith max damage from 75/150/225/300 to 100/200/300/400.  Holy Persuasion Persuaded creeps now have 0 collision size. Persuaded creeps no longer die when Chen dies. Reduced max units from 1/2/3/4 to 1/1/2/3", "6.28": " Reduced movement speed from 300 to 295. Increased  Test of Faith manacost from 140 to 175."}