{"6.57": " Increased gold bounty to  Power Cogs from unknown to 15-20. Reduced  intelligence gain from 1.7 to 1.3. Increased  Hookshot manacost from 125 to 150.", "6.60": " Added  Aghanim's Scepter upgrade for Clockwerk: Allows  Hookshot to latch onto allies and reduces cooldown from 80/60/40 to 20.", "6.66": " Reduced  Rocket Flare cooldown from 30/25/20/15 to 20/18/16/14.", "6.67": "  Power Cogs unit trapping code improved a little bit. Heroes within a small radius are now \"sucked in\" upon cast. Fixed some possible bugs with Power Cogs. Reduced  Aghanim's Scepter upgraded  Hookshot cooldown from 20 to 15.", "6.64": " Reduced base Armor from 1 to 0 (total armor is now 1.82).", "6.63": " Rescaled  Rocket Flare vision duration from 5/10/15/20 to 10 on each level. Reduced  Battery Assault damage from 20/40/60/80 to 10/30/50/70.", "6.68": " Increased base Armor from o to 1 (total armor is now 2.82). Increased  Battery Assault damage from 10/30/50/70 to 15/35/55/75. Reduced  Hookshot cooldown from 80/60/40 to 70/55/40.", "6.69": " Increased movement speed from 310 to 315.", "6.53": " Created.", "6.72d": " Undid melee hero collision change from 6.72c", "6.55": " Reduced  Battery Assault duration from 15.75 to 10.5 (22 shrapnels to 15 shrapnels). Increased  Hookshot cooldown from 40/35/30 to 80/60/40.", "6.54": " Reduced base armor from 2 to 1 (total armor is now 2.82). Reduced  strength gain from 2.9 to 2.4.  Power Cogs no longer affects invulnerable units. Reduced  Rocket Flare damage from 100/133/166/200 to 80/120/160/200.  Hookshot now destroys trees within a small radius around Clockwerk after reaching the latched unit.", "6.79": " Units knocked back by  Power Cogs now destroy trees in 100 radius around where they land.", "6.78": "  Power Cogs no longer affect spell immune units.", "6.72c": " Melee hero collision size now reduced from 24 to 12. Fixed  Hookshot having inconsistant behavior on spell immune units.", "6.75": " Increased  Strength gain from 2.4 to 2.7. Reduced  Battery Assault damage interval from 0.75 to 0.7.  Power Cogs Increased damage and mana drain from 60/90/120/150 to 80/120/160/200. Increased duration from 3/4/5/6 to 5/6/7/8. Fixed not triggering and burning mana/health when someone  Force Staffs over it.", "6.74": " Increased  Power Cogs damage and mana drain from 55/70/85/100 to 60/90/120/150.", "6.77": " Increased  agility gain from 1.2 to 2.3.", "6.76": "  Hookshot Now pulls Clockwerk to allies instead of getting blocked by them.  Aghanim's Scepter upgraded cooldown decreased from 15 to 12.", "6.71": "  Power Cogs Fixed a bug that caused them to die prematurely. Are no longer affected by  Shrapnel.", "6.72": " Reduced base Armor from 1 to 0 (total armor is now 1.82). Increased attack range from 125 to 128.", "6.80": " Reduced hits required to kill  Power Cogs from 3 to 2/2/2/3.", "6.82": "  Hookshot now pulls Clockwerk to neutral creeps normally like any unit. It previously triggered on neutral creeps without any effect.", "6.83": " Increased  Battery Assault damage from 15/35/55/75 to 20/40/60/80.", "6.84": " Increased  Rocket Flare projectile speed from 1500 to 1750.  Battery Assault and  Rocket Flare no longer ignores ancient creeps, Roshan and creep-heroes."}