{"6.60": " Replaced Frost Nova with  Crystal Nova", "6.42": "  Arcane Aura Now stacks with  Ring of Basilius' aura. Increased mana regen bonus from 0.33/0.67/1/1.33 to 0.6/1.2/1.8/2.4.", "6.00": " Reduced base attack damage from 17-33 to 2-8 (total attack damage is now 23-29). Reduced attack projectile speed from unkown to 900.", "6.02": " Increased base attack damage from 2-8 to 17-23 (total attack damage is now 38-44).", "6.69": "  Crystal Nova Increased damage from 80/130/180/230 to 100/150/200/250. Reduced slow duration from 5 on each level to 3.5/4/4.5/5.", "6.49": " Increased  Arcane Aura radius from 400 to global.", "6.05": " Fixed a control loss bug when  Frostbite gets reflected.", "6.79c": " Reduced base  intelligence from 21 to 19. Increased base attack damage from 17-23 to 19-25 (total attack damage is still 38-44 due to the intelligence reduction).", "6.35": " Fixed some lag issues with  Freezing Field. Fixed an issue with Crystal Madien's  Aghanim's Scepter upgrade.", "6.19b": " Fixed some bugs on  Freezing Field.", "6.55": " Increased  Arcane Aura mana regen bonus from 0.6/1.2/1.8/2.4 to 0.75/1.5/2.25/3. Fixed some performance issues with  Freezing Field.", "6.54": "  Freezing Field Now slows in an units in a 685 radius around Crystal Maiden, instead of only slowing enemies hit by an explosion. Reduced slow duration from 4 to 0.5. Now has a minimum spawn radius of 195. Explosions only spawn between this and the maximum (535) radius. Changed explosion spawning system from randomly within the radius to spawn in a certain pattern. The radius is now divided into 4 segments. The first explosion occurs within the north-east segment of the circle. The next occurs in the north-west segment, proceeding counterclockwise. ", "6.79": " Increased  Freezing Field attack speed slow from 20 to 30. Increased  Aghanim's Scepter upgraded  Freezing Field movement speed slow from 30% to 50%.", "6.78": " Increased  Arcane Aura mana regen from 0.5/1/1.5/2 to 1/1.5/2/2.5. Increased  Freezing Field explosion damage radius from 215 to 230. Increased  Aghanim's Scepter upgraded  Freezing Field attack speed slow from 20 to 50.", "6.72c": " Changed  Freezing Field legacy hotkey from Z to F.", "6.75": " Increased  Freezing Field duration from 4 to 7.", "6.74": "  Freezing Field Increased explosion max spawn distance from 535 to 635. Increased explosion damage radius from 190 to 215.", "6.76": "  Arcane Aura now has twice the effect on Crystal Maiden (1/2/3/4 regen instead of 0.5/1/1.5/2).", "6.17": "  Freezing Field Fixed Freezing Field dummies sometimes giving gold to enemies. Recoded so that multiple instances of the spell can run at the same time (same hero mode).", "6.72": " Reduced  Freezing Field manacost from 300/400/600 to 200/400/600.", "6.80": " Reduced base  intelligence from 19 to 16.", "6.82": "  Frostbite Reduced damage per second from 70 to 50. Reduced damage interval from 1 to 0.5. Total damage changes from 70/140/140/210 to 150/200/250/300. Increased  Freezing Field explosion damage radius from 230 to 250.", "6.83": " Increased  Crystal Nova attack speed slow from 20 to 30. Reduced  Frostbite from 10 to 10/9/8/7.  Freezing Field Increased max channel time from 7 to 10. Increased explosion max spawn distance from 635 to 785. Increased explosion damage radius from 250 to 300.", "6.84": "  Crystal Nova Rescaled movement speed slow from 30% on each level to 20%/30%/40%/50%. Rescaled attack speed slow from 30 on each level to 20/30/40/50. Rescaled slow duration from 3.5/4/4.5/5 to 4.5. Reduced  Frostbite cooldown from 10/9/8/7 to 9/8/7/6. Reduced  Freezing Field cooldown from 150/120/90 to 90.", "6.20": "  Frostbite Increased damage per second from 60 to 70. Reduced duration from 2/2.5/3/3.5 to 1.5/2/2.5/3. Fixed  Freezing Field starting to spawn ice explosions before reaching the cast point.", "6.10": " Changed Frost Nova legacy hotkey from F to V. Fixed some memory issues on  Freezing Field.", "6.29": " Fixed a bug with  Freezing Field and dummy units."}