{
  "6.44": " Created.",
  "6.45": "  Surge no longer applies a dispel on the target.",
  "6.60": "  Vacuum No longer pierces spell immunity. Now pulls affected units to the center over 0.4 seconds, instead of instantly (units are disabled during this). Increased cast range from 550 to 800.  Ion Shell Fixed some minor potential bugs. Reduced cooldown from 15 to 7.",
  "6.64": " Recasting  Ion Shell on the same unit now refreshes the duration, instead of stacking.  Wall of Replica Increased damage from 125 to 150. Increased illusions dealt damage from 60% to 70%.",
  "6.65": "  Vacuum Reduced cast range from 800 to 550. Reduced damage from 60/120/180/240 to 40/80/120/160. Fixed some  Ion Shell stacking bugs.",
  "6.46": " Fixed a possible  Surge exploit. Fixed  Wall of Replica from working on  Meepo clones.",
  "6.63": " Increased  Ion Shell manacost from 60/80/100/120 to 70/90/110/130.  Wall of Replica No longer creates illusions of allies. Now deals 125 damage to heroes whenever it creates illusions of them. Increased illusions dealt damage from 25% to 60%.",
  "6.72d": " Undid melee hero collision change from 6.72c",
  "6.79": " Increased  Vacuum cooldown from 24 to 28.",
  "6.78": " Increased  Vacuum cooldown from 22 to 24.",
  "6.72c": " Melee hero collision size now reduced from 24 to 12.",
  "6.75": " Reduced movement speed from 305 to 300.  Vacuum No longer affects invulnerable units. Reduced cast range from 550 to 500. Reduced radius from 275/375/475/575 to 250/350/450/550. Increased cooldown from 16 to 19.",
  "6.74": " Increased  Wall of Replica illusions damage taken from 250% to 300%.  Aghanim's Scepter upgraded  Wall of Replica No longer creates illusions of allied heroes. Now increases illusions damage dealt from 70%/80%/90% to 100%/120%/140%.",
  "6.76": " Increased  Vacuum cooldown from 19 to 22. Reduced  Wall of Replica vision from 800 to 200.",
  "6.73": "  Ion Shell Increased damage radius from 225 to 250. Increased duration from 15 to 20. Increased damage per second from 30/45/60/75 to 30/50/70/90. Increased cooldown from 7 to 10.  Wall of Replica illusions are now visually distinguishable for enemies.",
  "6.72": " Increased attack range from 125 to 128. Increased  Wall of Replica illusion damage dealt from 70% on each level to 70%/80%/90%. Added  Aghanim's Scepter upgrade for Dark Seer: Causes  Wall of Replica to create illusions of allied heroes as well, which deal 50% and take 250% damage.",
  "6.59": " Increased  Surge duration from 2/3.5/5/6.5 to 3/4.5/6/7.5.",
  "6.58": "  Wall of Replica now pierces spell immunity.",
  "6.80": " Reduced  Ion Shell cooldown from 10 to 9.",
  "6.82": "  Vacuum cooldown rescaled from 28.0 seconds to 28 seconds.",
  "6.83": " Base armor increased by 1 Increased  Vacuum pull duration from 0.4 to 0.5.",
  "6.84": " Increased  Ion Shell duration from 20 to 25.  Wall of Replica Reduced illusion damage dealt from 70%/80%/90% to 60%/75%/90%. Increased duration from 15/30/45 to 45. Reduced manacost from 200/300/400 to 125/250/375.",
  "6.57": " Reduced all spells' cast time from unknown to 0.4. Increased  Wall of Replica length from 800 to 1000.",
  "6.44b": "  Vacuum Fixed from working on various exploitable areas. The small disable effect (still interrupts channeling)."
}