{"6.44": "  Shallow Grave No longer has a 300 second buff duration and lasts until the next death again. Reduced respawn time reduction from 80% to 60%. Reduced cooldown from 250/200/150 to 200/175/150.", "6.72d": "  Shadow Wave Now always heals Dazzle as first, regardless of who is targeted. This heal does not count towards the bounce limit.", "6.60": "  Poison Touch is now properly blocked by  Linken's Sphere. Reduced  Shallow Grave cooldown from 80/60/40/20 to 54/40/26/12. Added  Aghanim's Scepter upgrade for Dazzle: Increases  Weave duration from 12/18/24 to 18/24/30 and radius from 575 to 775.", "6.47": " Fixed a bug with  Weave and Reincarnation.", "6.66": "  Shallow Grave Fixed not saving from the health loss caused by  Essence Shift. Now prevents the target from shattering to  Ice Blast for its duration.", "6.65": " Increased  Shallow Grave cooldown from 54/40/26/12 to 60/45/30/15.", "6.00": " Created.", "6.01": " Shadow Weave no longer has a chance to reduce enemy magic resistance by 5%. Increased Power Word duration from 15 to 25.", "6.69": "  Shallow Grave now has a duration indicator above the target, visible to allies only.", "6.40": "  Shallow Grave Fixed not working properly for heroes with transformation abilities. Now has a 300 second buff duration, instead of lasting until the next death. Reduced manacost from 200/350/500 to 100/200/300. Rescaled cooldown from 300/200/100 to 250/200/150.", "6.52": " Added a visual effect  Weave, visible to allies only.", "6.39": " Re-added and reworked Shadow Priest. Changed name from Razzle to Dazzle. Increased  strength gain from 1.65 to 1.85. Increased base  agility and gain from 15 + 1.4 to 21 + 1.7. Increased base  intelligence from 22 + 3.15 to 27 + 3.4. Rescaled base attack damage from 17-29 to 14-32 (total attack damage is now 41-59). Reduced attack range from 600 to 500. Replaced Shadow Word with  Poison Touch", "6.57": " Reduced  Shallow Grave cooldown from 90/70/50/30 to 80/60/40/20.", "6.54": " Reduced  Poison Touch cast time from 0.5 to 0.3. Reworked  Weave", "6.79": "  Poison Touch Is now disjointable. Now mini-stuns upon projectile impact, instead of launch. Increased damage per second from 8/16/24/32 to 14/20/26/32. Reworked slow progression: Old: Level 1: 33% slow for 1 second Level 2: 33% slow for 1 second -> 66% slow for 1 second Level 3: 33% slow for 1 second -> 66% slow for 1 second -> stun for 1 second Level 4: 33% slow for 1 second -> 66% slow for 1 second -> stun for 1 second New: Level 1: 33% slow for 3 seconds Level 2: 33% slow for 2 seconds -> 66% slow for 1 second Level 3: 33% slow for 1 second -> 66% slow for 1 second -> 100% slow for 1 second Level 4: 33% slow for 1 second -> 66% slow for 1 second -> stun for 1 second  Weave Rescaled armor per second from 1 on each level to 0.75/1/1.25 ( 1/1.25/1.5). reduced duration from 12/18/24 ( 18/24/30) to 20 on each level.", "6.78": "  Shallow Grave can now be cast on spell immune allies. Increased  Shadow Wave number of bounces from 3/3/4/5 to 3/4/5/6.", "6.72c": "  Poison Touch damage is no longer reduced by Damage Block.", "6.75": " Reduced  Poison Touch cooldown from 15/13/11/9 to 15/13/11/7. Increased  Shadow Wave damage radius from 170 to 185.", "6.77": " Increased  Shallow Grave cast range from 400/600/800/1000 to 550/700/850/1000.", "6.71": " Added a status buff icon for  Shallow Grave.", "6.70": " Increased  Shadow Wave damage radius from 155 to 170.", "6.72": " Increased  Poison Touch damage per second from 7/14/21/28 to 8/16/24/32.", "6.39b": " Increased  Shallow Grave cooldown from 300/150/75 to 300/200/100.", "6.58": " Fixed  Shadow Wave not bouncing the correct number of times.", "6.80": " Increased  Weave duration from 20 to 24.", "6.81": "  Poison Touch no longer mini-stuns upon projectile impact.", "6.82": " Increased  Aghanim's Scepter upgraded  Weave armor per second from 1/1.25/1.5 to 1.25/1.5/1.75.", "6.83": " Increased attack range from 500 to 550.", "6.84": " Increased  Poison Touch damage per second from 14/20/26/32 to 14/20/26/36.  Shadow Wave damage is no longer reduced by Damage Block.", "6.03": " Removed Shadow Priest.", "6.45": " Fixed Dazzle appearing Strength Only and Agility Only game modes.", "6.48b": "  Shallow Grave now has a 360 second buff duration, instead of lasting until the next death."}