{"6.45": " Increased base  agility and gain from 17 + 1.7 to 19 + 2.2.", "6.09": " Increased  strength gain from 1.7 to 2.8. Increased  agility gain from 1.6 to 1.7. Reduced  intelligence gain from 2.9 to 1.7", "6.00": " Replaced  Dragon Blood with Roar. Replaced  Dragon Tail with Stone Form.", "6.03": " Replaced Roar with  Dragon Blood. Removed the armor bonus from  Dragon Blood (1/2/3/4 -> 0). Replaced Stone Form with  Dragon Tail.", "6.04": "  Elder Dragon Form Frost breath no longer freezes buildings (Freeze fully disabled buildings). Reduced Frost breath duration from 10 to 3.", "6.52": " Reduced  Breathe Fire manacost from 100/115/130/150 to 100/110/120/130.  Elder Dragon Form Improved attack animation from 0.94/0.56 to 0.5/0.5. Increased cooldown from 100 to 115.", "6.50": " Fixed  Elder Dragon Form lasting 2 second too short (it lost 2 seconds of it since it no longer uses a transformation time).", "6.30": "  Elder Dragon Form Reduced manacost from 175/225/300 to 100/150/200. Increased Corrosive Breath damage from 8 to 20. Corrosive Breath now damages buildings.", "6.35": " Increased base armor from 1 to 2 (total armor is now 4.38).  Dragon Blood now grants 2/4/6/8 armor again.", "6.19b": "  Breathe Fire no longer causes a small damage over time on units which were affected by  Drunken Haze upon hit (this behaviour was never intended).", "6.72d": " Undid melee hero collision change from 6.72c.", "6.19": " Fixed  Dragon Blood having no hotkey (is now D).", "6.54": " Rescaled  Elder Dragon Form movement speed Bonus from 10/35/60 to 25 on each level.", "6.78": " Corrosive Breath passive from Level 1  Elder Dragon Form now carries over to Level 2.", "6.51": "  Elder Dragon Form Reduced manacost from 100/150/200 to 50 on each level. Reduced cooldown from 135 to 100.", "6.72c": " Melee hero collision size now reduced from 24 to 12.", "6.75": " Reduced armor from 2 to 1 (total armor is now 3.66). Increased  Dragon Blood armor bonus from 2/4/6/8 to 3/6/9/12.  Elder Dragon Form No longer grants 0/5/14 attack damage bonus. Rescaled splash damage radius:100% splash radius from 75 to 100.75% splash radius from 150 to 200.50% splash radius remains the same (250).", "6.71": " Increased  Dragon Blood health regeneration from 1/2/3/4 to 2/3/4/5.", "6.11": "  Dragon Tail Reduced stun duration from 2.5/2.75/3.1/3.35 to 2.5/2.75/3/3.25. Rescaled damage from 0/50/100/150 to 25/50/75/100.", "6.17": " Reduced base  strength from 21 to 19. Reduced movement speed from 300 to 290.", "6.73": " While in  Elder Dragon Form,  Dragon Tail cast range is increased from 150 to 400.", "6.72": " Increased attack range from 125 to 128. Increased  Breathe Fire damage from 75/150/225/300 to 90/170/240/300.", "6.80": "  Dragon Tail cooldown rescaled from 9 to 12/11/10/9.", "6.83": " Corrosive Breath passive from Level 1 and 2  Elder Dragon Form now carries over to Level 3.", "6.84": "  Breathe Fire now reduces hit enemies' attack damage by 20%/25%/30%/35% for 8 seconds.  Elder Dragon Form Corrosive Breath's damage is now lethal. Increased splash radius from 100/200/250 (for 100%/75%/50% damage) to 150/225/300.", "6.25": " Dragon Knight can now level up his spells while in  Elder Dragon Form.", "6.20": " Reduced  Breathe Fire damage from 85/170/255/320 to 75/150/225/300.  Elder Dragon Form Dragon Knight can no longer be  Tossed while under the effeect of Elder Dragon Form. No longer grants a health bonus (100/200/0 -> 0). No longer uses 1 second transformation time."}