{"6.63": "  Echo Slam now deals half echo damage from corpses instead of full.", "6.46": " Fixed a bug with Earthshaker picking up a double damage rune while having  Enchant Totem buff active (both buffs would instantly dispel).", "6.66": " Increased  Enchant Totem attack damage bonus from 50%/100%/150%/200% to 75%/150%/225%/300%. Increased  Aftershock radius from 280 to 300.  Echo Slam No longer counts corpses for damage echo damage. Increased echo damage from 35/45/65 to 40/55/70. Increased unit search radius from 475 to 550. (this is not the damage radius, just the initial unit search radius). Added  Aghanim's Scepter upgrade for Earthshaker: Causes  Echo Slam to release 2 echoes for each hero within the search radius.", "6.42": " Fixed  Echo Slam dealing less damage than intended (7 less).", "6.81b": " Improved turn rate from 0.6 to 0.9.  Echo Slam. Increased initial damage radius from 525 to 575. Increased echo search radius from 550 to 575. Increased echo damage radius from 500 to 575.", "6.03": " Changed  Aftershock hotkey from E to A to prevent conflicts with  Enchant Totem.", "6.04": " Reduced  Echo Slam echo damage from 35/45/65 to 27/37/57.", "6.49": " Recoded  Fissure to avoid root and Impale based spell conflicts. No longer causes hit enemy units to instantly face towards Earthshaker. No longer affects ancient creeps and Roshan. No longer conflicts with  Earth Spike,  Burrowstrike,  Ravage,  Impale,  Frostbite and  Overgrowth.", "6.06": "  Fissure Tweaked to reduce lag. Increased speed at which the fissure extends from 600 to 2400 (time needed to reach full length from 2 to 0.5 seconds).", "6.00": " Created.", "6.50": " Increased movement speed from 290 to 300.", "6.13": "  Enchant Totem Reduced manacost from 60/65/70/75 to 50 on each level. Reduced cooldown from 20 to 15.", "6.35": " Increased base armor from 0 to 1 (total armor is now 2.68).", "6.34": " Fixed a game crashing bug on  Fissure.", "6.39": " Increased  Aftershock radius from 250 to 280.", "6.49b": " Fixed the recoded  Fissure to properly trigger  Aftershock.", "6.11": " Fixed a game crashing bug on  Fissure.", "6.72d": " Undid melee hero collision change from 6.72c", "6.79": " Increased  Enchant Totem attack damage bonus from 75%/150%/225%/300% to 100%/200%/300%/400%. Increased  Fissure range from 1300 to 1400.", "6.78": " Improved turn rate from 0.4 to 0.6. Increased  Fissure range from 1200 to 1300.  Echo Slam now considers illusions as heroes.", "6.72c": " Melee hero collision size now reduced from 24 to 12.", "6.75": " Decreased  Enchant Totem cooldown from 7 to 6.", "6.17": " Fixed the recoded  Fissure to properly trigger  Aftershock. Fixed  Enchant Totem causing Earthshaker to have 200% bonus damage for 45 seconds sometimes.", "6.77": " Reduced  Enchant Totem cooldown from 6 to 5.  Aftershock Increased stun duration from 0.3/0.7/1.2/1.5 to 0.6/0.9/1.2/1.5. Increased damage from 25/45/75/115 to 50/75/100/125.", "6.10": " Fixed memory leaks on  Echo Slam.", "6.71": "  Enchant Totem no longer dispels if the attack gets canceled.", "6.72": " Reduced  Echo Slam initial damage from 165/230/285 to 160/210/270.", "6.80": " Increased  Strength gain from 2.5 to 2.9. Increased Base movement speed from 300 to 310.", "6.81": " Creeps no longer try to path around  Fissure; they will wait for it to disappear.  Echo Slam no longer ignores units that are invisible or in Fog of War.", "6.82": "  Fissure: No longer has unit targeting. Is no longer blocked by  Linken's Sphere. Changed  Echo Slam initial damage type from Universal to Magical damage, so it no longer pierces spell immunity.", "6.83": " Reduced  Enchant Totem manacost from 50 to 20/30/40/50.", "6.20": "  Fissure Rescaled damage from 75/145/210/320 to 125/175/225/275. Reduced stun duration from 1/1.5/2/2 to 1/1.25/1.5/1.75.  Enchant Totem Reduced buff duration from 15 to 14 (still lasts for 1 attack only). Reduced cooldown from 15 to 7.", "6.16b": " Recoded  Fissure Now creates the whole crevasse instantly infront of Earthshaker, instead of over 0.5 seconds. The crevasse is now always a straight line and no longer curves because of buildings or props. No longer creates ground rippling effects along the crevasse. No longer randomly fails to damage and stun hit enemies. No longer destroys trees."}