{"6.72d": " Undid melee hero collision change from 6.72c.", "6.81": "  Echo Stomp Reduced manacost from 100/115/130/145 to 100 on each level. Increased physical and magical damage from 80 on each level to 80/85/90/95.", "6.82": "  Natural Order Increased Armor reduction from 25%/50%/75%/100% to 40%/60%/80%/100% Increased Magic resistance reduction from 8%/16%/25%/33% to 12%/19%/26%/33% Added  Aghanim's Scepter upgrade: Causes  Earth Splitter to disarm affected units for 4/5/6 seconds and increases slow duration from 3/4/5 to 4/5/6.", "6.83": " Reduced  Astral Spirit damage from 60/100/140/180 to 60/90/120/150.", "6.84": "  Echo Stomp and  Astral Spirit no longer ignore ancient creeps, Roshan and creep-heroes.  Echo Stomp Physical damage part is no longer reduced by Damage Block. Reduced channel time from 1.4 to 1.2. Reduced cooldown from 15 on each level to 14/13/12/11.", "6.78": " Changed  Astral Spirit vision type from Flying to Ground. Increased  Natural Order armor reduction from 20%/40%/60%/80% to 25%/50%/75%/100%.", "6.79c": "  Astral Spirit Reduced Vision radius from 600 to 450. Reduced damage from 80/120/160/200 to 60/100/140/180.", "6.72c": " Melee hero collision size now reduced from 24 to 12.", "6.81b": " Increased  Echo Stomp physical and magical damage from 80/85/90/95 to 80/90/100/110.", "6.68": " Increased  Natural Order radius from 250 to 275.", "6.71": " Increased Movement speed 310 to 315.", "6.60": " Created.", "6.72": "  Astral Spirit Now has a secondary ability that returns the spirit. Reduced cooldown from 19 to 16. Increased cast range from 1000 to 1200.", "6.75": "  Astral Spirit Can now be controlled, until it starts to returning. Movement speed is now equal to Elder Titan's rather than fixed at 455.  Return Astral Spirit ability no longer interrupts Elder Titan upon cast. Now has the  Echo Stomp and  Return Astral Spirit abilities it can cast directly.", "6.61": " Reduced base attack damage from 33-43 to 23-33 (total attack damage is now 47-57). Reduced  strength gain from 2.7 to 2.3. Reduced  Natural Order armor reduction from 25%/50%/75%/100% to 20%/40%/60%/80%.", "6.63": " Reduced  Astral Spirit cast range from 1500 to 1000.  Earth Splitter Reduced width from 350 to 300. Increased cooldown from 90/75/60 to 100 on each level.", "6.79": " Reduced  Astral Spirit damage from 120/160/200/240 to 80/120/160/200."}