{"6.44": " Fixed  Midnight Pulse and  Black Hole affecting wards.", "6.60": " Changed Enigma's alliance from Sentinel to Scourge (Radiant to Dire).  Malefice is now properly blocked by  Linken's Sphere.  Black Hole now has an area targeting cursor.", "6.66": " Fixed  Malefice stop working when the target gets out of vision.", "6.67": " Fixed affected units sometimes being able to use items during  Black Hole depending on the affected heroes' entry vector.", "6.81b": " Increased  Midnight Pulse duration from 8 to 11.", "6.01": " Fixed  Malefice's damage and stun timings. Fixed  Black Hole's dummy unit being attackable.  Midnight Pulse no longer affects ancient creeps and Roshan.", "6.02": "  Midnight Pulse no longer affects allied units.  Black Hole no longer damages allied units.", "6.69": " Reduced Eidolons health from 200/225/225/275 to 180/200/220/240.", "6.46": " Fixed some buff stacking issues with  Malefice.", "6.06": " Changed Enigma's alliance from Scourge to Sentinel (Dire to Radiant).  Malefice Reduced duration from 6 on each level to 2/4/4/6 (total ticks from 3 to 1/2/2/3 ticks). Rescaled damage from 35/45/55/75 to 30/40/65/80. Reduced manacost from 115/140/165/190 to 110/130/150/160.", "6.07": " Fixed some memory leak issues on  Malefice,  Midnight Pulse and  Black Hole. Reduced  Midnight Pulse max health as damage per second from 4%/5%/6%/7% to 3%/4%/5%/6%.", "6.17": " Reduced attack range from 525 to 500.", "6.05": " Increased  Midnight Pulse duration from 5 to 8.", "6.09b": " Reduced attack range from 600 to 525.  Demonic Conversion can no longer be cast on creep-heroes.", "6.00": " Created.", "6.35": "  Black Hole Fixed some lag issues. Reduced manacost from 200/450/650 to 200/300/400.", "6.34": "  Black Hole now properly affects the Spirit Bear.", "6.19b": " Fixed some rare bugs with  Black Hole.", "6.57": " Changed Eidolons attack damage type from normal/normal/piercing/piercing to normal on each level.", "6.55": "  Black Hole now properly affects Warlock's Golems.", "6.03": " Increased base  strength and gain from 14 + 1.8 to 17 + 2.1.", "6.79": "  Malefice no longer ignores its cast backswing. Increased  Midnight Pulse max health as damage per second from 3%/4%/5%/6% to 4%/5%/6%/7%. Added  Aghanim's Scepter upgrade for Enigma: Adds damage to  Black Hole equal to  Midnight Pulse's damage based on its level. Stacks with a regular cast Midnight Pulse.", "6.78": "  Malefice Increased duration from 2/4/4/6 to 6 on each level (total ticks from 1/2/2/3 to 3). Reduced stun duration per tick from 1 on each level to 0.25/0.5/0.75/1. Rescaled damage per tick from 40/40/65/65 to 25/40/55/70 (total damage from 40/80/130/195 to 75/120/165/210).", "6.50": " Increased movement speed from 290 to 300. Increased Eidolons armor from 0/1/2/2 to 2/3/4/5. Fixed enemies being able to cast some instant cast spells while affected by  Black Hole.", "6.75": " Reduced  Malefice damage per tick from 30/40/65/80 to 40/40/65/65 (total damage 30/80/130/240 to 40/80/130/195). Increased  Midnight Pulse cast range from 500 to 700.  Black Hole Now affects  Primal Split spirits. Increased manacost from 200/300/400 to 250/350/450.", "6.74": "  Black Hole now prevents heroes being Forced out with  Force Staff.", "6.10": " Fixed some memory leak issues on  Malefice. Fixed  Demonic Conversion still being castable on Spirit Bear.  Midnight Pulse Reduced radius from 500 to 400. Increased cooldown from 15 to 25.", "6.71": " Fixed  Black Hole now properly affects Aghanim's Scepter upgraded Warlock's Golems and Familiars.", "6.59": "  Demonic Conversion Can now be cast on any non-hero, non-ancient unit, instead of only allied once (cannot target units above level 5). Eidolons now multiply when having attacked 6 times (each can only multiply once, Eidolons created from multiplying cannot). Increased Eidolons' magic resistance from 33% to 50%. Fixed acquisition range and collision size of Eidolons. Changed model and model scale. Increased duration from 30 to 35. Increased cooldown from 15 to 35. Increased manacost from 125 to 170.  Black Hole Fixed not properly silencing spell immune enemies. Now provides 800 range ground vision for 4 seconds at its center.", "6.58": " Reduced Eidolons gold bounty from unknown to 22-36. Reduced  Midnight Pulse manacost from 135/150/165/180 to 95/110/125/140.", "6.80": "  Black Hole Increased pull/disable radius from 375 to 400. Increased cast range from 250 to 275.", "6.81": " Increased  Midnight Pulse radius from 400 to 600.", "6.82": "  Midnight Pulse Changed damage type from Universal to Pure. Reduced max health as damage per second from 4%/5%/6%/7% to 3%/3.75%/4.5%/5.25%. Increased cooldown from 25 to 35.  Black Hole Increased max damage radius from 150 to 200. Rescaled max damage per second from 60/100/140 to 50/100/150. Reduced min damage radius from 500 to 400. Rescaled min damage per second from 30/50/70 to 25/50/75. Rescaled manacost from 250/350/450 to 275/350/425.", "6.84": " Reduced  Midnight Pulse cast point from 0.3 to 0.2.  Black Hole No longer deals 100/150/200 damage within a 200 radius and 25/50/75 damage within a 400 radius. Now deals 55/110/165 damage within its entire (400) radius. Reduced manacost from 275/350/425 to 275/325/375.", "6.20": " Reduced base  strength from 17 to 16.  Demonic Conversion No longer works on couriers. Now instantly spawns the Eidolons, instead of after ~0.3 seconds. Eidolons created by casting Demonic Conversion on an Eidolon from the previous cast now lasts their full 30 seconds, instead of equal to the remaining duration of the eidolons from the previous cast.  Black Hole Reduced far damage from 40/75/100 to 30/50/70. Reduced close damage from 80/120/160 to 60/100/140.", "6.48b": " Increased base armor from -1 to 2 (total armor is now 3.96)."}