{"6.81": "  Homing Missile Now can hit invisible units. Increased attacks required to destroy from 3 on each level to 3/3/4/5.", "6.82": " Increased  Homing Missile maximum damage from 110/220/330/440 to 125/250/375/500.", "6.83": "  Call Down Increased radius from 450 to 600. Reduced first rocket's movement speed slow from 50% to 30%. Increased second rocket's movement speed slow from 20% to 60%.  Homing Missile rocket can now be targeted by  Force Staff.", "6.84": " Reduced  Rocket Barrage cast point from 0.3 to 0.  Call Down No longer ignores ancient creeps, Roshan and creep-heroes. Increased 2nd rocket slow duration from 3 to 4.", "6.78c": " Reduced attack range from 375 to 365.", "6.84c": " Reduced  Rocket Barrage damage per rocket from 11/15/19/23 to 8/13/18/23.", "6.84b": " Reduced base  intelligence from 23 to 19.", "6.75": " Increased movement speed from 305 to 315. Increased  Flak Cannon radius from 800 to 1000. Increased  Call Down radius from 400 to 450.", "6.74": " Increased  Homing Missile maximum damage from 100/200/300/400 to 110/220/330/440. Increased  Rocket Barrage damage per rocket from 10/13/16/19 to 11/14/17/20.", "6.68": " Created.", "6.76": " Increased  Rocket Barrage damage per rocket from 11/14/17/20 to 11/15/19/23.  Homing Missile Reduced distance required to reach maximum damage from 2000 to 1500. Rescaled stun duration from 2.5 on each level to 2.2/2.4/2.6/2.8.", "6.70": " Added to Captain's Mode.", "6.73": " Increased base armor from -1 to 1 (total armor is now 4.36).", "6.72": " Increased  agility gain from 2.4 to 2.8. Rescaled  Rocket Barrage cooldown from 6.5 to 7/6.5/6/5.5. Added  Aghanim's Scepter upgrade for Gyrocopter: Increases  Call Down cast range from 1000 to global and increases the second rocket's damage from 100/150/200 to 175/225/275.", "6.69": " Increased  Rocket Barrage damage per rocket from 10/12/14/16 to 10/13/16/19.  Homing Missile Added a visual indicator over the target's head (visible to allies only). Increased cast range from 900 to 1050. Reduced cooldown frm 20/18/16/14 to 20/17/14/11.", "6.78": " Increased  Flak Cannon cooldown from 20 to 30."}