{"6.44": " Created.", "6.63": " Removed the cap on  Berserker's Blood (the cap was 7 stacks). Fixed lags upon picking Huskar.", "6.60": " Removed the cap on  Burning Spear (the cap was 5 stacks). Added  Aghanim's Scepter upgrade for Huskar: Increases  Life Break damage from 50% to 65% and reduces cooldown from 45/30/15 to 24/16/8.  Life Break is now properly blocked by  Linken's Sphere.", "6.67": " Reduced  Inner Vitality heal interval from 1 to 0.1 seconds (same overall heal).", "6.64": " Rescaled  Burning Spear damage from 6/8/10/12 to 4/8/12/16.", "6.69": " Increased  Berserker's Blood attack speed bonus from 2/4/6/8 to 3/6/9/12.", "6.52": " Increased attack range from 350 to 400. Improved  Huskar's attack animation from unknown to 0.4/0.5. Added a visual effect to  Berserker's Blood when reaching high stacks.", "6.79c": " Added to Captain's Mode.", "6.57": "  Life Break Increased damage to target from 40% to 50% of its current health. Reduced cooldown from 45 on each level to 45/30/15.", "6.54": " Decreased  Inner Vitality cooldown from 30 to 25.", "6.79": " Reduced base  Agility and gain from 20 + 2.4 to 15 + 1.4.  Berserker's Blood is now disabled by  Doom.", "6.78": " Removed from Captain's Mode. Increased base  strength from 18 to 21. Increased  Burning Spear damage per second from 4/8/12/16 to 5/10/15/20. Increased  Life Break damage to self from 35%/30%/25% to 40%/35%/30%.  Berserker's Blood Reworked:", "6.72c": " Reduced  Life Break cast range from 600 to 550.", "6.75": "  Inner Vitality can now be cast on spell immune units. Increased  Burning Spear duration from 6 to 7. Reduced  Aghanim's Scepter upgraded  Life Break cooldown from 24/16/8 to 4.", "6.71": " Reduced  Life Break damage to self from 40%/33%/25% to 35%/30%/25%.", "6.72": " Removed minimum health requirement of 100 for  Burning Spear. Reworked  Life Break a bit:", "6.58": "  Life Break now slows spell immune units (debuff is still dispelled by spell immunity).", "6.80": " Increased  Burning Spear duration from 7 to 8.  Inner Vitality Increased regen bonus when hurt from 15%/30%/45%/60% to 30%/45%/60%/75%. Increased cast range from 450 to 550.", "6.81": "  Burning Spear is no longer a Unique Attack Modifier.", "6.82": " Reduced  Inner Vitality cooldown from 25 to 25/22/19/16. Increased  Berserker's Blood attack speed bonus from 8/12/16/20 to 14/16/18/20.  Life Break Reduced cooldown from 45/30/15 to 12. Reduced damage to target from 50% to 35%. Rescaled damage to self from 40%/35%/30% to 35%. Rescaled Slow duration from 5 to 4/5/6. Rescaled Slow from 50% to 40%/50%/60%.", "6.83": "  Inner Vitality Increased base health regen bonus from 2/4/6/8 to 10. Rescaled regen bonus when hurt from 30%/45%/60%/75% to 20%/40%/60%/80%.", "6.84": "  Inner Vitality Increased cast range from 550 to 800. Reduced cooldown from 25/22/19/16 to 22/18/14/10.", "6.44b": " Increased  Inner Vitality manacost from 50/90/130/170 to 170 on each level."}