{"6.63": " Reduced  Healing Ward cooldown from 75 to 60.", "6.60": " Added  Aghanim's Scepter upgrade for Juggernaut: Increases  Omnislash number of jumps from 3/5/8 to 5/7/10 and cooldown from 130/120/110 to 110/100/90. Changed  Omnislash legacy hotkey from N to E.", "6.66": " Reduced  Blade Fury cooldown from 30 to 30/28/26/24.", "6.81b": " Reduced base attack time from 1.5 to 1.4. Rescaled  Omnislash damage per jump from 175-250 to 200-225.", "6.68": "  Healing Ward Increased max health as heal per second from 1%/2%/3%/4% to 1%/2%/4%/5%. Reduced manacost from 140 on each level to 80/100/120/140.", "6.69": "  Omnislash no longer wastes a strike by considering units in ethereal form in its search (fully ignorers ethereal units).", "6.04": "  Omnislash Reduced number of jumps from 4/6/9 to 3/5/8. Increased jump interval from 0.3 to 0.4.", "6.49": " Increased base  strength from 17 to 19. Increased movement speed from 290 to 295. Reduced base armor from 2 to 1 (total armor is now 3.8).", "6.07": " Tweaked the pause effect on  Omnislash. (?)", "6.83b": " Reduced base armor from 1 to 0 (total armor is now 3.64). Reduced  Omnislash cast range from 450 to 350.", "6.83c": " Reduced  agility gain from 2.85 to 2.4. Rescaled  Blade Fury manacost from 110 on each level to 120/110/100/90. Increased  Healing Ward manacost from 80/100/120/140 to 120/125/130/135.", "6.17": " Reduced base  strength and gain from from 19 + 2.2 to 17 + 1.9. Reduced base  agility from 22 to 20.  Omnislash Fixed Roshan stopping to attack when hit by Omnislash. Now ends once no valid target is found within range, instead of continuing to search for targets for the full duration.", "6.50": " Increased movement speed from 295 to 305.", "6.00": "  Blade Fury Reduced manacost from 120 to 110. Reduced cooldown from 20 to 18. Increased base  strength from 17 to 19. Increased  Omnislash number of jumps from 3/5/8 to 4/6/9.", "6.35": " Increased base armor from -1 to 0 (total armor is now 2.8).", "6.02": " Fixed  Omnislash not going on cooldown sometimes when used.", "6.72d": " Undid melee hero collision change from 6.72c", "6.79": " Increased  Healing Ward movement speed from 300 to 450.  Omnislash Reduced  Aghanim's Scepter upgraded cooldown from 110/100/90 to 70 on each level. Now jumps on units in ethereal form again (no longer ignores them, so it does not stop if only ethereal targets are within range).", "6.78": "  Omnislash no longer jumps on  Tombstone Zombies.", "6.51": " Fixed  Impale,  Earth Spike,  Ravage and  Burrowstrike affecting Juggernaut during  Blade Fury.", "6.72c": " Melee hero collision size now reduced from 24 to 12.", "6.75": " Reduced base attack time from 1.7 to 1.6.  Omnislash now kills creeps and neutrals in one hit (This does not include player controlled units, ancient neutral creeps or Roshan).", "6.74": "  Omnislash now gives Juggernaut 200 flying vision during its duration.", "6.10": "  Blade Fury Changed legacy hotkey from B to F. Increased cooldown from 18 to 30.", "6.71": " Increased  Healing Ward max health as heal per second from 1%/2%/4%/5% to 2%/3%/4%/5%.", "6.70": "  Blade Fury now properly damages units in ethereal form. Increased  Healing Ward movement speed from 150 to 300.", "6.73": "  Omnislash Increased damage per jump from 150-250 to 175-250. Increased number of jumps from 3/5/8 to 3/6/9. Increased  Aghanim's Scepter upgraded number of jumps from 5/7/10 to 6/9/12.", "6.72": " Increased base health regeneration from 0.25 to 0.75. Increased attack range from 100 to 128. Increased  Blade Dance critical strike chance from 10%/20%/25%/35% to 15%/20%/25%/35%.", "6.80": " Reduced  Blade Fury cooldown from 30/28/26/24 to 30/27/24/21.", "6.81": " Reduced base attack time from 1.6 to 1.5.", "6.82": "  Blade Fury No longer gets canceled by the following abilities:  Chronosphere,  Toss,  Black Hole,  Global Silence,  Doom. Reduced cooldown from 30/27/24/21 to 30/26/22/18.", "6.83": " Increased base  agility from 20 to 26. Increased  Blade Dance critical strike chance from 15%/20%/25%/35% to 20%/25%/30%/35%.", "6.84": "  Blade Fury No longer ignores ancient creeps, Roshan and creep-heroes. Now follows the same dispel rules as other sources of spell immunity (no longer dispels most positive buffs). Increased cooldown from 30/25/22/18 to 42/34/26/18. Reduced  Healing Ward movement speed from 450 to 420.  Omnislash No longer ignores ancient creeps, Roshan and creep-heroes (still can't be directly cast on them). no longer mini-stuns the target upon cast. Using items/abilities during Omnislash no longer requires facing direction.", "6.20": "  Healing Ward Increased manacost from 125 to 140. Increased cooldown from 50 to 75.", "6.21": "  Blade Fury is now disabled during  Omnislash.", "6.48b": " Increased base armor from 0 to 2 (total armor is now 4.8)."}