{"6.44": " Fixed Aghanim's Scepter upgraded Liberate Soul not being on autocast by default.", "6.63": "  Illuminate Now always travels the maximum distance, instead of increasing gradually based on channeled duration. Increased maximum distance from 500/600/700/800 to 1200 on each level. Increased cast range from 400 to 600.", "6.60": "  Mana Leak No longer stuns the target for 1.25/1.5/1.75/2 seconds when it runs out of mana. Now slows the target by 60% for 2 seconds when it runs out of mana. Is now properly blocked by  Linken's Sphere.  Blinding Light knockback no longer disables affected units.", "6.04": "  Chakra Magic Moved from 1st into 3rd ability slot. Can now be cast on self again. Fixed being able to target enemies. Now increases attack damage by 7%/14%/21%/28%. Increased duration from 20 to 30. Rescaled manacost from 100 to 50/75/100/125. Restored the previous  Mana Leak. Moved  Illuminate from 3rd into 1st ability slot. Restored the previous Ignis Fatuus. Increased Ignis Fatuus manacost from 200/300/425 to 200/300/450. Increased Will O' manacost from 30 to 75.", "6.42": " Reduced Ignis Fatuus and Liberated Souls attack projectile speeds from instant to 900.", "6.00": "  Chakra Magic Can no longer be cast on self. No longer increases attack damage by 7%/14%/21%/28%. Now increases health regeneration by 0.15/0.3/0.45/0.6. Increased duration from 10 to 20. Reduced cast range from 600 to 500. Increased level requirement from 0/2/4/6 to 1/3/5/7. Increased manacost from 50/75/100/125 to 100 on each level. Reduced cooldown from 16 to 12. Reworked  Mana Leak", "6.69": " Changed  Recall targeting type from unit to ground or unit.", "6.77c": "  Illuminate Reduced radius from 400 to 350. Increased manacost from 150 on each level to 150/160/170/180.", "6.05": " Recoded  Illuminate", "6.06": " Increased  Mana Leak cast range from 600 to 800. Ignis Fatuus can now attack: 15-26/25-36/35-46 attack damage, 500 range and 1.5 attack time.", "6.18": "  Illuminate Fixed its damage being off. Reduced cooldown from 11 to 10. Reduced  Chakra Magic manacost from 70/80/90/100 to 75 on each level.", "6.17": " Fixed  Illuminate not working for multiple Keepers.  Chakra Magic Rescaled manacost from 50/75/100/125 to 70/80/90/100. Reduced cooldown from 12 to 10. Increased Heal heal amount from 3 to 10.", "6.79": "  Blinding Light now destroys trees in a 150 radius around where the target is pushed.", "6.52": " Reduced Liberate Soul and Phase Shift cast point from 0.5 to 0. Reduced Will O' manacost from 75 to 25.", "6.31": " Will O' can no longer target the enemy base area.", "6.13": " Increased attack range from 600 to 650.  Mana Leak Reduced manacost from 75 to 50. Reduced cooldown from 25 to 15.", "6.35": " Fixed some targeting bugs with  Illuminate.", "6.19b": " Fixed  Mana Leak not leaking mana when the target moved quickly after casting a spell. Increased Heal heal amount from 10 to 15.", "6.36": " Reduced  Chakra Magic cooldown from 25 to 19.", "6.39": "  Aghanim's Scepter Now also reduces Ignis Fatuus duration from 90 to 60. Now also increases the stats of Ignis Fatuus and Liberated Souls. Ignis Fatuus: Increases attack damage from 15-26/25-36/35-46 to 25-36/35-46/45-56. Increases health from 300/450/600 to 450/600/750. Liberated Soul: Increases attack damage from 21-25/28-32/35-39 to 28-32/35-39/42-46. Increases armor from 3/3/3 to 3/3/4. Increases health from 400/500/700 to 500/700/850. Increases mana from 5/5/5 to 5/5/10.", "6.57": " Added disablehelp support for  Recall.", "6.55": "  Illuminate Now provides increasing vision in a line infront of Ezalor during the channeling, which lasts for 10 seconds (the projectile itself still provides vision as well). Added a sub-ability which allows the player to cancel the channeling by pressing its hotkey. Fixed cases where Illuminate would fail to release the damaging wave. Reduced max distance from 555/675/795/915 to 500/600/700/800. Increased cast range from 250 to 400. Reworked  Mana Leak", "6.54": "  Illuminate now provides 400 radius flying vision along its path. Fixed  Mana Leak triggering on  Bottle usage.", "6.53": "  Mana Leak no longer triggers on  Quas,  Wex and  Exort.", "6.78": " Reduced base  strength from 19 to 17.", "6.50": " Reduced attack point from unknown to 0.3. Increased movement speed from 305 to 315.", "6.75": "  Illuminate Increased cast range from 600 to 1800. Increased wave travel distance from 1200 to 1550. Reduced  Mana Leak cooldown from 18 to 16. Reduced  Chakra Magic manacost from 40/55/70/85 to 25/45/65/85.", "6.74": " Increased  Mana Leak stun duration from 1.25/1.5/1.75/2 to 1.3/1.6/1.9/2.2.", "6.71": "  Mana Leak No longer slows the target by 60% for 2 seconds when it runs out of mana. Now stuns the target for 1.25/1.5/1.75/2 seconds when it runs out of mana. Reduced duration from 5/6/7/8 to 4/5/6/7. Reduced cooldown from 20 to 18.", "6.70": " Increased  Blinding Light cast range from 600 to 900.", "6.73": " Reduced  Recall cooldown from 40 to 15. Reduced  Blinding Light cooldown from 20 on each level to 20/16/12.", "6.58": " Reduced  Mana Leak cast range from 1200 on each level to 550/700/850/1000.", "5.78": " Increased  Illuminate cooldown from 10 to 11. Ignis Fatuus Increased duration from 60 to 90. Reduced cooldown from 80 to 60.", "5.79": " Increased Liberated Soul attack damage from 16-20/23-27/30-34 to 21-25/28-32/35-39. Added  Aghanim's Scepter upgrade for Keeper of the Light: Increases Ignis Fatuus number of summons from 1 to 2.", "5.76": " Created.", "5.77": "  Chakra Magic No longer increases health regeneration by 1.5. Now increases attack damage by 7%/14%/21%/28%. Reduced cooldown from 20 to 16. Reduced  Illuminate cooldown from 13 to 10. Increased Liberated Soul attack damage from 11-15/18-22/25-29 to 16-20/23-27/30-34.", "6.80": " Increased  Mana Leak stun duration from 1.3/1.6/1.9/2.2 to 1.5/2/2.5/3.", "6.81": " Added  Aghanim's Scepter upgrade for Keeper of the Lgiht: Provides permanent  Spirit Form, grants Keeper of the Light unobstructed vision during day times and cause  Illuminate to heal allies for 75% of the damage values during day time.", "6.82": "  Mana Leak: Increased mana loss per 100 distance from 3.5%/4%/4.5%/5% to 5% on each level. Increased duration from 4/5/6/7 to 5/6/7/8.  Recall can now target invulnerable allies. Increased  Blinding Light knockback distance from 250 to 400.", "6.83": " Reduced  Chakra Magic manacost from 25/45/65/85 to 25/35/45/55. Increased  Blinding Light blind duration from 3/4/5 to 4/5/6.", "6.84": " Increased  Aghanim's Scepter upgraded  Illuminate heal percentage from 75% to 100% of damage values. Reduced  Mana Leak cooldown from 16 on each level to 16/14/12/10.  Chakra Magic now places a buff that reduces the cooldown of the next spell its target casts by 1/2/3/4 seconds. Buff lasts 12 seconds or until an ability goes on cooldown.", "6.22": " Reduced attack range from 650 to 600.", "5.80": "  Mana Leak Increased duration from 15 to 22. Reduced manacost from 75/95/115/135 to 75 on each level. Increased cooldown from 18 to 25.", "6.20": "  Chakra Magic Reduced mana restored from 100/200/300/400 to 90/180/270/360. Reduced manacost from 75 to 50.", "6.28": "  Chakra Magic Now gives Ezalor the same amount of mana as it gives to other targets, instead of giving 40% less. Reduced mana restored from 90/180/270/360 to 75/150/225/300. Rescaled manacost from 75 on each level to 40/80/100/120. Increased cooldown from 10 to 25.", "6.04b": " Liberate Soul Fixed always summoning level 2 liberated souls on any level. Fixed autocast not being on by default."}