{"6.45": " Reduced  Lightning Storm number of jumps from 8 on each level to 4/6/7/8.", "6.47": "  Pulse Nova Fixed sometimes not stopping to drain mana after toggled off. Reduced activation manacost from 143/165/187 to 110 on each level.", "6.40": " Increased base  strength from 14 to 16.", "6.67": " Increased  Split Earth cast range from 650 to 750.  Diabolic Edict No longer wastes explosions on invulnerable enemies. Now randomly creates explosions on the ground when no enemies are within range (visual only) Reduced cooldown from 30/28/26/24 to 22 on each level.", "6.42": "  Pulse Nova no longer triggers  Essence Aura.", "6.65": " Increased movement speed from 300 to 310.", "6.81b": " Increased  Pulse Nova damage from 66/100/144 ( 100/150/200) to 80/120/160 ( 100/160/220).", "6.68": " Increased  Split Earth stun duration from 1.25/1.5/1.75/2 to 2 on each level.", "6.69": " Increased  Pulse Nova radius from 300/350/400 to 400 on each level.", "6.31": " Increased  Split Earth cast range from 525 to 650. Fixed Leshrac getting slowed when  Diabolic Edict damages an enemy which has a frost armor on (from  Lich or the Ogre Frostmage).", "6.00": "  Split Earth. Added a 0.35 second delay. Increased cast time from 0.5 to 0.7.  Diabolic Edict No longer pierces spell immunity. Increased cast time from 0.5 to 0.7. Increased manacost from 75/100/115/135 to 95/120/135/155. Increased cooldown from 15 to 30. Increased  Lightning Storm cast time from 0.5 to 0.7.  Pulse Nova Added a 0.5 second cooldown. Reduced manacost per second from 75/125/175 to 45/95/135.", "6.35": " Increased base armor from -1 to 0 (total armor is now 1.82).", "6.36": " Increased base  agility from 13 to 23.", "6.39": "  Lightning Storm Increased number of jumps from 2/3/4/5 to 8 on each level. Reduced cooldown from 6 to 5.  Pulse Nova no longer has a 2 second toggle cooldown.", "6.09": "  Pulse Nova Reduced pulse interval from 2.25 to 1. Reduced damage per pulse from 150/225/325 ( 200/300/400) to 66/100/144 ( 88/133/177). Overall damage is the same, just in smaller intervals. Reduced activation manacost from 185/235/285 to 143/165/187 Reduced manacost per second from 45/95/135 to 20/40/60. Increased toggle cooldown from 0.5 to 2.", "6.03": "  Diabolic Edict now pierces spell immunity again.", "6.79": " Reduced night vision from 900 to 800. Reduced  Diabolic Edict cast time from 0.7 to 0.5. Increased  Aghanim's Scepter upgraded  Pulse Nova damage from 88/133/177 to 100/150/200.", "6.51": " Fixed  Pulse Nova triggering  Last Word.", "6.50": " Increased  Lightning Storm cooldown from 5 to 7.", "6.75": "  Diabolic Edict now has a 0.7 second cast time again.", "6.10": " Increased  Split Earth radius from 150/150/200/210 to 150/175/200/225. Reduced  Diabolic Edict cooldown from 30 on each level to 30/28/26/24.", "6.71": "  Diabolic Edict damage is no longer reduced by Damage Block.  Pulse Nova no longer turns itself off when Leshrac gets disabled by certain spells. Added a 1 second toggle cooldown.", "6.70": " Increased  Split Earth damage from 70/140/210/290 to 120/180/240/300.  Diabolic Edict no longer has a 0.7 second cast time. Reduced  Lightning Storm cooldown from 6 to 5.5.", "6.73": " Increased movement speed from 310 to 315. Increased  Pulse Nova radius from 400 to 450.", "6.59": " Reduced  Lightning Storm cooldown from 7 to 6.", "6.80": "  Lightning Storm Reduced number of jumps from 4/6/7/8 to 4/5/6/7. Reduced damage from 80/145/205/265 to 80/140/200/260. Reduced manacost from 100/115/130/145 to 90/100/110/120. Reduced cooldown from 5.5 to 4.", "6.81": "  Lightning Storm now slows its targets by 75% for 0.5 seconds.", "6.82": "  Diabolic Edict Changed damage type from Composite to Physical. Now deals 40% more damage to buildings. Reduced damage from 12.5/25/37.5/50 to 9/18/27/36.  Pulse Nova Increased damage from 80/120/160 ( 100/160/220) to 100/130/160 ( 160/190/220). Reduced activation manacost from 110 on each level to 70/90/110.", "6.83": " Increased  Diabolic Edict duration from 8 to 10 (explosions from 33 to 40).  Lightning Storm Increased cast range from 700 to 800. Increased slow duration from 0.5 to 0.75.", "6.84": " Increased movement speed from 315 to 320.  Lightning Storm Reduced cast time from 0.7 to 0.6. Increased slow duration from 0.75 on each level to 0.7/0.8/0.9/1.  Pulse Nova no longer ignores ancient creeps, Roshan and creep-heroes.", "6.24": " Reduced  Diabolic Edict explosions interval from 0.4 to 0.25 (explosions from 20 to 33, duration still 8).", "6.29": " Reduced  Lightning Storm manacost from 100/115/130/178 to 100/115/130/145."}