{"6.63": " Increased movement speed from 295 to 305.", "6.60": "  Aghanim's Scepter no longer increases  Chain Frost number of bounces from 7 to 8.", "6.67": " Reduced  Frost Blast cooldown from 9.25 on each level to 9.25/9.25/9.25/8. Fixed a damage interaction between  Ice Armor and  Return.", "6.45": "  Ice Armor Increased armor bonus from 2/4/6/8 to 3/6/9/12. Increased duration from 25 to 40. Reduced manacost from 50 to 25.  Aghanim's Scepter now also increases  Chain Frost number of bounces from 6 to 7.", "6.68": " Increased movement speed from 305 to 315. Rescaled base attack damage from 19-38 to 24-33 (total attack damage is now 42-51).", "6.04": " Reduced attack range from 600 to 570. Increased  Frost Blast manacost from 100/125/155/180 to 125/150/170/190.", "6.49": " Increased attack range from 500 to 550. Increased base attack damage from 19-31 to 19-38 (total attack damage is now 37-56).", "6.06": " Increased  Sacrifice cooldown from 35 to 45.", "5.26": " Increased attack range from 580 to 600.", "6.05": " Increased attack range from 570 to 580.", "6.09b": " Fixed a rare  Chain Frost bug.", "6.31": " Fixed  Ice Armor slowing  Leshrac/ Beastmaster when damaging the armored unit with  Diabolic Edict/ Wild Axes.", "6.13": " Fixed some issues with  Sacrifice.", "6.33": " Reduced attack range from 600 to 500.", "6.32": " Fixed  Chain Frost bouncing off of  Death Wards.", "6.34": " Reduced  Chain Frost cast range from 800 to 750.  Aghanim's Scepter now also increases  Chain Frost cast range from 750 to 850.", "6.36": " Increased  Sacrifice cooldown from 45 on each level to 60/55/50/45.", "6.39": " Reduced  Sacrifice cooldown from 60/55/50/45 to 55/50/45/40.", "6.72d": "  Chain Frost Now follows its target and jumps upon reaching it, instead of flying to its target's position upon projectile launch. Increased projectile speed from 522 to 675.", "6.19": " Reduced base  intelligence from 20 to 18. Fixed a rare  Chain Frost bug which created a global ranged Nova casting dummy.", "6.18": " Reduced  strength from 1.75 to 1.55", "6.79": "  Ice Armor Now has half effect against ranged units, instead of no effect. Slow now stacks with the slow from  Frost Blast.  Sacrifice: Increased cooldown from 35/30/25/20 to 44/36/28/20. Increased current health as mana from 15%/30%/45%/60% to 25%/40%/55%/70%. No longer denies experience for the enemy. Now converts the creep for experience (shared with all heroes within the normal experience radius).", "6.78": " Increased  Chain Frost number of bounces from 7 to 10.", "6.50": " Increased  Chain Frost number of bounces from 6 ( 7) to 7 ( 8).", "6.75": " Reduced  Frost Blast cooldown from 9.25/9.25/9.25/8 to 8 on each level.", "6.70": " Increased  Frost Blast primary target damage from 50/100/125/175 to 50/100/150/200.  Ice Armor Reduced armor bonus from 3/6/9/12 to 3/5/7/9. Increased manacost from 25 to 50. Reduced  Sacrifice cooldown from 55/50/45/40 to 30/27/24/21.", "6.73": "  Chain Frost now bounces in 0.2 second intervals, instead of instantly.", "6.72": " Increased  Sacrifice cooldown from 30/27/24/21 to 35/30/25/20.", "6.81": "  Ice Armor can now be cast on buildings.  Aghanim's Scepter now removes  Chain Frost's bounce limit.", "6.82": "  Ice Armor Now has full effect against ranged units, instead of half. Can now be cast on spell immune allies.", "6.83": " Reduced  Chain Frost cooldown from 145/115/60 to 120/90/60.", "6.84": " Increased  Ice Armor cast range from 800 to 1000. Increased  Chain Frost projectile speed from 675 to 750.", "6.20": " Increased movement speed from 280 to 295.  Sacrifice can no longer kill couriers. Reduced  Chain Frost number of bounces from 7 to 6."}