{"6.63": " Increased base  intelligence from 19 to 24. Reduced base attack damage from 18-36 to 13-31 (total attack damage is still 37-55 due to the increased intelligence).", "6.60": " Replaced  Ultimate with  Fiery Soul", "6.67": " Reduced  Light Strike Array cooldown from 10 to 8. Increased  Fiery Soul attack speed bonus per stack from 20/30/40/50 to 30/40/50/60.", "6.65": " Increased  Fiery Soul stack duration from 5 to 7.", "6.81b": " Increased  Light Strike Array stun duration from 1.6 on each level to 1.6/1.7/1.8/1.9.", "6.68": " Reduced  Light Strike Array cooldown from 8 to 7. Reduced  Laguna Blade cooldown from 150/90/55 to 120/90/55.", "6.69": " Increased  Aghanim's Scepter upgraded  Laguna Blade damage from 600/875/1150 to 600/925/1250.", "6.32": " Increased movement speed from 290 to 300.", "6.72d": " Increased  Fiery Soul movement speed bonus per stack from 2%/3%/4%/5% to 3%/4%/5%/6%.", "6.79": " Increased attack range from 635 to 650.", "6.78": " Increased attack range from 625 to 635.", "6.50": " Reduced movement speed from 300 to 295.", "6.75": " Increased  Fiery Soul attack speed bonus per stack from 40/50/60/70 to 40/55/70/85. Reduced  Laguna Blade cooldown from 120/90/55 to 90/70/50.", "6.74": "  Fiery Soul Increased attack speed bonus per stack from 30/40/50/60 to 40/50/60/70. Increased movement speed bonus per stack from 3%/4%/5%/6% to 4%/5%/6%/7%.", "6.76": " Reduced  Laguna Blade cooldown from 90/70/50 to 70/60/50.", "6.71": " Increased attack range from 600 to 625.  Laguna Blade can no longer be cast on spell immune units (it does not deal damage to them anyway).", "6.73": " Increased base  intelligence from 24 to 27.  Dragon Slave Increased travel distance from 700 to 800. Increased end radius from 125 to 150. Increased cast range from 600 to 800.", "6.72": "  Aghanim's Scepter now also increases  Laguna Blade cast range from 600 to 900.", "6.80": " Increased  Dragon Slave end radius from 150 to 200.  Fiery Soul Increased movement speed bonus per stack from 4%/5%/6%/7% to 5%/6%/7%/8%. Increased stack duration from 7 to 9.", "6.81": " Increased attack range from 650 to 670.  Aghanim's Scepter now also changes  Laguna Blade's damage type from magical to universal and allows targeting spell immune units.", "6.82": "  Light Strike Array Increased cast range from 600 to 625. Increased stun duration from 1.6/1.7/1.8/1.9 to 1.6/1.8/2/2.2.  Aghanim's Scepter upgraded  Laguna Blade Changed damage type from universal to pure. No longer increases damage from 450/675/950 to 600/925/1250.", "6.83": " Increased attack projectile speed from 900 to 1000.  Dragon Slave Increased damage from 100/170/230/280 to 110/180/250/320. Increased manacost from 90/105/125/140 to 100/115/130/145.  Light Strike Array Rescaled damage from 90/150/210/280 to 120/160/200/240. Increased manacost from 90/100/110/125 to 100/110/120/130. Increased stun duration from 1.6/1.8/2/2.2 to 1.6/1.9/2.2/2.5 Increased  Fiery Soul stack duration from 9 to 10.", "6.84": "  Aghanim's Scepter no longer increases  Laguna Blade cast range from 600 to 900.", "6.28": " Increased movement speed from 280 to 290. Increased  Dragon Slave starting radius from 120 to 275."}