{"6.60": "  Earth Spike is now blocked by  Linken's Sphere. Reduced  Hex duration from 1/2/3/4 to 1.25/2/2.75/3.5.", "6.41": "  Mana Drain Increased cast range from 600 on each level to 600/650/700/750. Increased mana drain per second from 15/30/50/70 to 15/30/50/80. Reduced cooldown from 25 on each level to 25/20/15/10.", "6.48": " Increased movement speed from 280 to 290.", "6.49": "  Mana Drain Increased mana drain per second from 15/30/50/80 to 20/40/60/100. Reduced duration from 5 to 4.", "6.83c": " Increased  Hex unit movement speed from 100 to 140.", "6.17": " Fixed  Finger of Death being castable on wards.", "6.10": " Reduced  Hex duration from 2/3/4/5 to 1/2/3/4.", "6.79": "  Hex Increased duration from 1.75/2.5/3.25/4 to 2.5/3/3.5/4. Increased cooldown from 15 to 30/25/20/15. Increased  Mana Drain duration from 4 to 5.", "6.78": "  Mana Drain Increased cast range from 750 to 850. Increased link break distance from 1100 to 1200.  Aghanim's Scepter now also reduces  Finger of Death cooldown from 160/100/40 to 100/60/20.", "6.51": " Fixed  Earth Spike affecting Juggernaut during  Blade Fury. Fixed a bug between  Voodoo Restoration and Earth Spike.", "6.50": " Recoded  Earth Spike: No longer turns hit enemies invulnerable during the air time. No longer causes hit enemy units to instantly face towards Lion. No longer requires channeling in order for the spikes to reach max distance. No longer conflicts with  Burrowstrike,  Impale,  Ravage and Earth Spike from other Lions. No longer fails to stun and damage enemies when the targeted point was a cliff.", "6.75": "  Mana Drain Increased cast range from 600/650/700/750 to 750 on each level. Increased link break distance from 800 to 850. Reduced cooldown from 25/20/15/10 to 20/15/10/5.  Finger of Death Increased damage from 500/650/850 ( 600/800/1025) to 600/725/850 ( 725/875/1025). Rescaled cooldown from 150/90/55 ( 150/90/50) to 170/105/40.", "6.74": "  Hex Increased duration from 1.25/2/2.75/3.5 to 1.75/2.5/3.25/4. Increased manacost from 110/140/170/200 to 125/150/175/200. Increased cooldown from 13 to 15.", "6.76": " Increased  Mana Drain link break distance from 850 to 1100.  Finger of Death Increased cast range from 700 to 900. Reduced cooldown from 170/105/40 to 160/100/40.", "6.71": "  Finger of Death can no longer be cast on spell immune units (it does not deal damage to them anyway). ", "6.73": "  Mana Drain Increased mana drain per second from 20/40/60/100 to 20/40/60/120. Reduced drain interval from 1 to 0.25 (same amount of mana drained overall, but in smoother intervals).", "6.59": " Increased model size of  Hexed units a bit.", "6.80": "  Aghanim's Scepter now also causes  Finger of Death to hit units within a 200 radius around the the primary target. ", "6.81": " Reduced  Hex cooldown from 30/25/20/15 to 30/24/18/12.", "6.82": " Increased  Earth Spike damage from 60/130/200/260 to 80/140/200/260.", "6.83": " Increased base attack damage from 20-26 to 27-33 (total attack damage is now 49-55). Reduced  Mana Drain drain interval from 0.25 to 0.1 (same amount of mana drained overall, but in smoother intervals).", "6.84": "  Earth Spike no longer ignores ancient creeps, Roshan and creep-heroes.  Hex no longer applies Break on the target.", "6.20": " Increased  Hexed unit model slightly."}