{"6.44": " Increased  Entangling Claws proc chance from 0%/0%/0%/16% to 0%/0%/16%/16%.", "6.63": "  Entangling Claws No longer disarms the target. Increased damage per second from 40 to 60.", "6.60": "  Spirit Bear Now has an inventory on every level, instead of only level 4. No longer has  Demolish on level 3. Spells now last the same duration on the bear as they do on heroes (changed unit type from regular to Creep-Hero). Reworked  Rabid", "6.40": " Reduced  Entangling Claws proc chance from 4%/8%/12%/16% to 0%/0%/0%/16%.", "6.64": " Increased base movement speed from 305 to 315.  Spirit Bear Reduced leash range from 1500 to 925. Attempting to attack an enemy outside the leash range now causes the bear to stop attacking, instead of returning it back to Lone Druid.  True Form Now reduces movement speed by 45 on each level. Increased transformation time from 1.45 to 1.933. Increased armor bonus from 2/4/6 to 4/6/8.", "6.69": "  Summon Spirit Bear Can now be cast while the Spirit Bear is still alive, restoring its health and returning it to Lone Druid, instead of canceling the cast and giving an error message. Increased leash range from 925 to 1100. Fixed the  Spirit Bear sometimes missing its attacks when its target was moving away. Reduced  True Form movement speed reduction from 45 to 35.", "6.04": " Fixed  Rabid being unable to be cast on self.  True Form now grants 250/400/600 health while active.", "5.69-5.71": "  Spirit Bear Can now attack flying units. Now has 33% magic resistance on level 4. Rescaled health from 1600/1900/2200/2500 to 1400/1800/2300/2700. Increased  Entangling Claws proc chance from 3%/6%/9%/12% to 4%/8%/12%/16%.", "5.62": " Created.", "6.52": " Reduced  Summon Spirit Bear cooldown from 180 on each level to 180/160/140/120.", "6.42": "  Summon Spirit Bear now cancels the cast and gives an error message when attempting to cast while the Spirit Bear is alive, instead of wasting mana and cooldown.  Entangling Claws no longer works against ancient creeps and Roshan.", "6.09b": "  Spirit Bear Fixed an issue with  Manta Style/Illusion Rune. Can no longer be targeted by  Demonic Conversion.", "6.50": " Increased  Demolish attack damage bonus against buildings from 33% to 60%.", "6.30": "  Summon Spirit Bear no longer causes the  Spirit Bear to automatically return to Lone Druid upon leveling the spell while the bear is alive.  Return now has a 5 second cooldown.", "6.39": " Increased the  Spirit Bear's Base Attack Time from 1.75/1.6/1.45/1.3 to 1.75/1.65/1.55/1.45.", "6.72d": "  Return can no longer be cast if the Spirit Bear has taken damage from a player unit in the last 3 seconds. Undid melee hero collision change from 6.72c", "6.54": " Increased base armor from -1 to 0 (total armor is now 3.36).", "6.79": " Increased base movement speed from 315 to 325. Increased  Spirit Bear experience bounty from 196 to 300. Increased  True Form movement speed reduction from 35 to 45 (to keep his movement speed at 280 during True Form).", "6.78": "  Spirit Bear Is now affected by  Armlet of Mordiggian's health drain when active. Increased gold bounty from 100 to 300.", "6.51": "  True Form now increases armor by 2/4/6.", "6.72c": " Melee hero collision size now reduced from 24 to 12.", "6.75": "  Summon Spirit Bear can no longer be cast if the Spirit Bear has taken damage from a player unit in the last 3 seconds.", "6.17": " Increased attack range from 500 to 550.", "6.72": " Reduced  Demolish attack damage bonus against buildings from 60% to 40%.", "6.29b": "  True Form Fixed base attack damage during True Form still being 22-29, instead of 22-26. No longer increases armor by 1.", "5.72": " Reduced base attack damage from 22-29 to 22-26 (total attack admage is now 46-50).  Spirit Bear now only gets moved back to the Lone Druid upon starting an attack on a unit, instead of always when leaving leash range.", "6.58": "  Entangling Claws Increased proc chance from 16% to 20%. Reduced cooldown from 6 to 5.", "6.80": "  Entangling Claws is no longer a Unique Attack Modifier.", "6.81": " Increased the  Spirit Bear's health regeneration from 2 on each level to 2/3/4/5.", "6.82": "  Spirit Bear Now has 300 mana.  Hand of Midas now grants the experience to Lone Druid when used by the bear.", "6.83": " Reduced  Return cast point from 0.3 to 0.  Battle Cry Increased cooldown from 30 to 60. Reduced duration from 8 to 6. Increased attack damage bonus from 20/40/60 to 50/75/100. Increased armor bonus from 2/4/6 to 5/10/15.", "6.84": "  True Form is no longer deactived upon death.  Battle Cry Increasd armor bonus from 5/10/15 to 6/12/18. Increased attack damage bonus from 50/75/100 to 60/90/120.  Entangling Claws damage is no longer reduced by Damage Block. Added  Aghanim's Scepter upgrade for Lone Druid: Allows Spirit Bear to attack at any range from Lone Druid and prevents Spirit Bear from dying if Lone Druid dies.", "6.27": " Reduced  Summon Spirit Bear manacost from 125 to 75.  Spirit Bear Fixed the bear's items being lost when dying in Death Match mode. Reduced collision size from 48 to 24.", "6.20": " Fixed the  Spirit Bear not disappearing upon repicking Lone Druid."}