{"6.44": "  Eclipse now always uses level 4  Lucent Beams, instead of the current level Lucent Beam is at.", "6.63": " Increased  Lucent Beam stun duration from 0.01/0.1/0.3/0.6 to 0.6 on each level.", "6.60": " Increased  Lunar Blessing radius from 300 to 900.  Aghanim's Scepter no longer reduces  Eclipse cooldown from 160/150/140 to 90.", "6.67": " Reworked  Lunar Blessing", "6.09": "  Eclipse Increased cooldown from 130/110/65 to 140/120/100. Increased  Aghanim's Scepter upgraded cooldown from 125/90/45 to 130/110/90.", "6.68": "  Lunar Blessing Increased attack damage bonus from 6/12/18/24 to 8/16/24/32. Increased night vision bonus from 250/500/750/1000 to 1000 on each level.  Eclipse now turns day into night for 10 seconds.", "6.69": " Increased  strength gain from 1.75 to 1.9. Increased movement speed from 320 to 330. Increased  Aghanim's Scepter upgraded  Eclipse max beam per unit from 5 to 6.", "6.07": " Increased  Eclipse cooldown from 130/95/50 to 130/110/65.", "6.41": " Reduced  Moon Glaive damage reduction per bounce from 40% to 35%.", "6.32": " Increased  Eclipse beam interval from 0.1 to 0.5.", "6.36": " Increased attack range from 300 to 330.", "6.39": " Fixed the first beam of  Eclipse happening 0.5 seconds after cast instead of immediatly.", "6.57": "  Eclipse Increased beam interval from 0.5 to 0.6. No longer continues after Luna's death. Increased cooldown from 140 on each level to 160/150/140.", "6.79": "  Moon Glaive Can now bounce back on the same units if it already hit all other units nearby. Increased damage reduction per bounce from 30% to 35%.  Aghanim's Scepter upgraded  Eclipse no longer has a max beam per unit limit (was 6).", "6.50": "  Lucent Beam Increased cast range from 600 to 800. Increased stun duration from 0.01 on each level to 0.01/0.1/0.3/0.6. Reduced manacost from 95/110/125/140 to 90/100/110/120.  Eclipse Damage is now based on Lucent Beam's level once again. No longer mini-stuns enemies. Reduced manacost from 250/350/450 to 150/200/250. Increased cooldown from 140/120/100 to 140 on each level.  Aghanim's Scepter Reduced manacost from 225/325/425 to 150/200/250. Reduced cooldown from 130/110/90 to 90 on each level.", "6.75": " Increased  Moon Glaive number of bounces from 1/2/3/4 to 1/2/3/5.", "6.74": " Reduced  Moon Glaive damage reduction per bounce from 35% to 30%.", "6.76": " Increased  Lunar Blessing attack damage bonus from 14/20/26/32 to 14/22/30/38.", "6.73": " Increased base attack damage from 21-27 to 26-32 (total attack damage is now 47-54).", "6.72": " Increased  Lunar Blessing attack damage bonus from 8/16/24/32 to 14/20/26/32.", "6.81": " Reduced base  agility from 22 to 18.", "6.83": " Increased  Moon Glaive number of bounces from 1/2/3/5 to 1/2/3/6. Increased  Eclipse number of beams from 4/7/10 to 5/8/11. Increased  Aghanim's Scepter upgraded  Eclipse number of beams from 4/8/12 to 6/10/14.", "6.84": " Increased base armor from 0 to 1 (total armor is now 3.52).  Eclipse no longer ignores ancient creeps, Roshan and creep-heroes.  Aghanim's Scepter now allows Eclipse to be cast on an area within 2500 range, granting obstructed vision of that area. Can also target any allied unit to center Eclipse on their location, even while moving. Still provides its old upgrade bonuses as well.", "6.44b": " Increased base attack damage from 11-17 to 21-27 (total attack damage is now 43-49).", "6.24": " Increased  intelligence gain from 1.65 to 1.85.", "6.20": " Increased attack range from 225 to 325.  Eclipse Reduced max beams per unit from 5 to 4. Reduced  Aghanim's Scepter upgraded may beams per unit from 6 to 5.", "6.21": " Reduced attack range from 325 to 300."}