{"6.09": " Reduced Purge manacost from 125/140/155 to 60 on each level.", "6.60": "  Split Shot Now has a 0.1 second cast time. Now interrupts channeling spells upon cast. Replaced Chain Lightning with  Mystic Snake", "6.61": "  Mystic Snake Increased base damage from 60/100/140/180 to 80/120/160/200. Increased cast range from 700 to 800 Increased projectile speed from unknown to 633 (833 when moving back to Medusa). Reduced cooldown from 12 to 11. Reduced  Stone Gaze cooldown 70 to 35. Minor improvements to  Mystic Snake speed , cast range and cooldown. Improved  Mystic Snake's damage from 60/100/140/180 to 80/120/160/200.", "6.67": " Reduced  intelligence gain from 2.25 to 1.85.", "6.65": " Increased  Stone Gaze cooldown from 35 to 100.", "6.00": " Increased base attack damage from 19-25 to 24-30 (total attack damage is now 44-50). Removed Purge. Reworked  Split Shot", "6.68": " Reduced movement speed from 300 to 290. Reduced  strength gain from 1.85 to 1.65.", "6.03": " Fixed  Mana Shield requiring level 1/2/3/4, instead of 1/3/5/7.", "6.04": " Medusa can no longer purchase  Aghanim's Scepter (like every other hero with no upgrade). Increased  Split Shot damage per arrow from 20%/30%/40%/50% to 35%/45%/55%/65%. Replaced Gaze with Purge", "6.46": " Increased  intelligence gain from 1.85 to 2.25.", "6.52": " Reduced attack point from unknown to 0.5. Increased Purge damage to summons from 600 on each level to 600/800/1000.", "6.05": " Increased  Split Shot damage per arrow from 35%/45%/55%/65% to 40%/50%/60%/70%.", "6.37": " Reduced Purge damage to summons from 99999 to 600.", "6.02": " Fixed Gaze not going on cooldown when used.", "6.36b": " Increased Purge damage to summons from 1000 to 99999.", "6.55": " Increased  Split Shot number of arrows from 3 to 4. Reduced Purge cooldown from 12/11/10 to 12/10/8.", "6.79": " Added to Captain's Mode.  Mystic Snake now deals pure damage to units petrified by Stone Gaze.", "6.78": " Removed from Captain's Mode. Reworked  Stone Gaze", "6.51": " Fixed  Mana Shield triggering  Essence Aura.", "6.50": " Reduced  Mana Shield toggle on manacost from 50 to 0. Reduced Purge cooldown from 12 on each level to 12/11/10.", "6.75": " Increased  Split Shot damage per arrow from 45%/55%/65%/75% to 50%/60%/70%/80%. Increased  Mystic Snake damage and mana steal increase per jump from 20% to 25%. Increased  Mana Shield damage absorbed per mana point from 0.75/1.25/1.5/2 to 0.75/1.25/1.75/2.25.", "6.74": " Increased  Split Shot number of arrows from 4 to 5.", "6.77": " Reduced  Stone Gaze cooldown from 140/110/80 to 140/100/60.", "6.73": " Reduced  Mana Shield toggle on cooldown from 10 to 0.  Stone Gaze Rescaled the speed recovery factor from 5/3/2 to 3 on each level. Increased Stone Gaze duration from 0.6 to 5 (if enemies face her within the 5 seconds, they get affected). Can only affect units onc per cast. Rescaled damage to summons and Illusions from 600/800/1000 to 500/1000/1500. Increased manacost from 100/50/0 to 200/100/0. Rescaled cooldown from 100 to 140/110/80.", "6.72": " Fixed  Stone Gaze slow deceasing faster on higher levels, instead of slower.", "6.80": " Increased  Mana Shield damage absorbed per mana point from 0.75/1.25/1.75/2.25 to 1/1.5/2/2.5.", "6.81": "  Split Shot Reduced number of arrows from 5 on each level to 2/3/4/5. Increased damage per arrow from 50%/60%/70%/80% to 80% on each level.  Mystic Snake no longer requires Fog of War vision to bounce. Increased  Mana Shield damage absorbed per mana point from 1/1.5/2/2.5 to 1.6/1.9/2.2/2.5.", "6.82": "  Mystic Snake Increased outgoing speed from 633 to 800. Reduced return speed from 833 to 800. Increased base mana steal from 20/30/40/50 to 20/35/50/65. Increased  Mana Shield absorbed damage from 50% to 60%.", "6.84": "  Split Shot and  Mana Shield are no longer deactived upon death.  Stone Gaze no longer ignores ancient creeps, Roshan and creep-heroes.", "6.20": " Increased  Split Shot damage per arrow from 40%/50%/60%/70% to 45%/55%/65%/75%. Reduced Purge slow duration from 6 to 5."}