{"6.81": " Reduced  Sacred Arrow vision radius from 800 to 650.", "6.82": "  Leap: Reduced speed from 2000 to 1600. Rescaled distance from 630/720/780/870 to 600/700/800/900.", "6.69": " Reduced  Leap cooldown from 40/35/30/20 to 30/26/22/18.", "6.84": "  Starstorm Second meteor now hits the closest enemy within the radius, instead of a random enemy. Increased secondary radius from 175 to 325.", "6.78": "  Starstorm will now choose a new target for the second star if the first died before impact.  Sacred Arrow now deals up to 100 extra damage based on distance the arrow traveled. Reduced  Moonlight Shadow cooldown from 160/140/120 to 140/120/100.", "6.42": " Reduced  Sacred Arrow collision radius from 130 to 115.", "6.65": " Increased  Starstorm radius from 600 to 625.", "6.81b": "  Sacred Arrow Reduced minimum stun duration from 0.5 to 0.01 (maximum duration is still 5 seconds growing linearly). Reduced base damage from 90/180/270/360 to 50/140/230/320. Increased maximum bonus damage from 100 to 140. Overall, at maximum distance, the damage is still 190/280/370/460 like before.", "6.74": " Reduced  Moonlight Shadow cooldown from 180/160/140 to 160/140/120.", "6.77": " Increased  Moonlight Shadow duration from 11 to 15.", "6.76": " Reduced  Sacred Arrow cooldown from 20 to 17. Reduced  Moonlight Shadow manacost from 175 to 75.", "6.49": "  Leap no longer turns Mirana invulnerable for the leap duration.", "6.73": " Fixed  Sacred Arrow damaging but not stunning invisible units.", "6.75": " Increased  Starstorm Secondary target damage from 50% of the original to 75% of the original (37.5/75/112.5/150 -> 56.25/112.5/168.75/225). Reduced  Sacred Arrow cooldown from 25 to 20.", "6.66": " Reduced  Moonlight Shadow manacost from 200/250/300 to 175 on each level.", "6.38": " Created.", "6.63": "  Starstorm no longer has a 60% chance to hit enemies within 600-900 range.", "6.79": " Reduced night vision from 1200 to 800.  Leap Now applies the movement and attack speed boost at the cast location upon cast, instead of landing location upon landing. Increased attack speed bonus from 4/8/12/16 to 8/16/24/32.", "6.50": "  Leap Increased cooldown from 20 on each level to 40/35/30/20. Reduced manacost from 60/55/50/45 to 40/35/30/20.", "6.68": "  Moonlight Shadow Increased duration from 7/9/11 to 11 on each level. Rescaled cooldown from 160 on each level to 180/160/140."}