{"6.63": "  Morph no longer passively grants 2/4/6/8 agility and strength when leveling.", "6.60": " Reworked  Adaptive Strike", "6.64": " Increased  Morph Replicate manacost from 0 to 150.", "6.00": " Reduced  strength gain from 2.2 to 2.0. Reduced  agility gain from 3.2 to 3.0. Morphling can no longer build a  Refresher Orb. Spell Steal can no longer steal  Healing Salve as an ability.", "6.01": " Blink Reduced blink distance from 1000 to 600. Reduced manacost from 60 to 50. Reduced cooldown from 12/9/7/5 to 11/8/6/4.", "6.69": " Changed  Adaptive Strike damage type from physical to magical.  Replicate can no longer be cast on illusions under Morphling's control.", "6.04": " Blink Increased blink distance from 600 on each level to 700/800/900/1000. Increased level requirement from 1/3/5/7 to 3/6/9/12. Rescaled cooldown from 11/8/6/4 to 9/8/7/6. Increased manacost from 50 to 60. Increased  Morph level requirement from 1/3/5/7 to 6/10/14/18. Removed Spellsteal  Attribute Bonus Increased max levels from 10 to 14. Reduced intelligence per level from 2 to 0.", "6.46": " Reduced  Replicate manacost from 200 to 125.", "6.06": " Fixed Morphling being unable to buy  Refresher Orb in agility form. Increased base  intelligence from 15 to 17. Increased  Attribute Bonus intelligence per level from 1 to 2. Increased Morph Attack damage from 30 + 120%/130%/140%/150% of agility to 30 + 140%/180%/220%/260% of agility. Unstable Power Can no longer be cast on enemy units. No longer deals 15/20/25/30 damage per second. Increased duration from 7 to 12. Increased cooldown from 14 to 15.", "6.07": " Changed Morph Attack damage type from magical to physical. Crushing Wave No longer knocks Roshan back. Fixed some memory leak issues. Adapt Fixed some bugs with Adapt in Death Match mode. Fixed some memory leak issues. Increased manacost from 300/250/200 to 300 on each level.", "6.17": " Morphling now randomly changes its color every few seconds again.", "6.52": "  Morph Now also morph stats when manually clicking or using their hotkeys, instead of doing nothing at all. Cooldown for manual cast is 1/1/0.75/0.5 Added legacy hotkeys (D for agility morph, F for strength morph).", "6.05": " Reworked Morphling. Can now buy  Refresher Orb again. No longer randomly changes color every few seconds.  Attribute Bonus Reduced max levels from 14 to 10. Increased intelligence per level from 0 to 1. Replaced Tidal Wave with  Waveform", "6.31": " Reworked Morphling Reworked  Waveform", "6.13": " Increased  Morph manacost from 0 to 10.", "6.33": " Fixed illusions of Morphling instantly dying when spawning while having very low strength.", "6.32": " Increased movement speed from 275 to 285.  Waveform Increased cast range and max distance from 800 to 1000. Increased speed from 1000 to 1250. Fixed an endless Waveform bug.  Adaptive Strike Increased base damage from 30 on each level to 30/60/90/120. Reduced manacost from 120 to 100. Reduced cooldown from 25 to 20. Can no longer knock Roshan back.  Replicate illusions no longer shift color in the same way as Morphling does, but use the target's colors.", "6.34": " Increased  Waveform manacost from 120 to 140/155/160/165.", "6.11": " Fixed an  Aegis of the Immortal bug related to  Waveform.", "6.19b": " Adapt Increased manacost from 300 on each level to 300/350/400. Increased cooldown from 0.5 to 5.", "6.19": " Fixed  Morph continuing to shift attributes while dead.", "6.18": " Fixed Adapt causing Morphling to stop changing colors randomly.", "6.79": " Reduced  Morph shift rate from 1/0.5/0.33/0.25 to 1/0.5/0.33/0.2.", "6.78": " Reduced base attack time from 1.7 to 1.6.", "6.51": " Reduced base attack damage from 30-39 to 19-28 (total attack damage is now 38-47).", "6.50": " Increased base attack damage from 15-24 to 30-39 (total attack damage is now 49-58).  Replicate Reduced manacost from 125 to 25. Reduced cooldown from 120 to 80.", "6.75": " Increased cast point from from 0.3 to 0.45. Reduced base attack damage from 19-28 to 13-22 (total attack damage is now 37-46).  Waveform Reduced damage radius from 255 to 200. Morphling can no longer attack or use spells or items during Waveform. Increased  Morph manacost per second from 20 to 30.", "6.74": "  Waveform now properly disjoints projectiles.  Morph now passively grants 3/4/5/6 agility and strength when leveling it up.", "6.77": " Reduced cast point time from 0.4 to 0.25.", "6.76": " Reduced cast point time from 0.45 to 0.4.", "6.71": "  Adaptive Strike Now deals 20/40/60/80 base damage. Reduced maximum damage agility multiplier from 0.75/1.5/2.25/3 to 0.5/1/1.5/2.", "6.16": " Fixed  Morph sometimes not using mana.", "6.73": " Increased base  agility from 19 to 24. Reduced  Adaptive Strike cooldown from 20 to 10.", "6.72": " Increased base armor from 0 to -2 (total armor is now 0.66)  Replicate now has a visual timer (player only) that counts down its duration.", "6.58": "  Waveform No longer hides Morphling for the duration. Now turns Morphling invulnerable for the duration. This changes prevent messing up with unit selections. It also allows Morphling to cast spells and attack during Waveform.  Morph now passively grants 2/4/6/8 agility and strength when leveling it up.", "6.80": " Morphling can now attack and use spells and items during  Waveform.", "6.83": " Increased  Adaptive Strike max stun duration from 0.75/1.5/2.25/3 to 1.25/2.25/3.25/4.25.", "6.84": "  Adaptive Strike now uses a projectile which travels at a speed of 1150 and is disjointable. Added  Aghanim's Scepter upgrade for Morphing: Grants Morphling the  Hybrid ability.", "6.27": " Crushing Wave Now destroys trees around the target within a 200 radius. Reduced manacost from 90 to 75. Reduced cooldown from 10 to 9.", "6.24": " Crushing Wave Reduced manacost from 95/100/105/110 to 90 on each level. Reduced cooldown from 12 to 10.", "6.20": " Fixed  Manta Style causing Morphling to stop changing colors randomly. Reduced  Attribute Bonus intelligence bonus from 2 to 0.  Waveform Reduced cast and blink range from 700/750/800/850 to 700 on each level. Increased manacost from 110/120/130/140 to 175 on each level. Increased Morph Attack cooldown from 10 to 20. Increased Crushing Wave damage from 50/100/150/200 to 100/150/200/250. Increased  Morph manacost from 10 to 20.", "6.10": " Increased  Waveform cast range and blink distance from 700 on each level to 700/750/800/850.  Morph Fixed Morph being single target, instead of no target (could only target enemies with no effect). Fixed Morph preventing Morphling to use attack modifier while active. Removed legacy hotkeys (R and O), since manual cast does nothing. Reduced manacost from 2/4/6/8 to 0.", "6.29": "  Attribute Bonus No longer adds the attributes directly to Morphlings base attributes This means the bonus attributes can no longer be used with Morph. Increased intelligence per level from 0 to 2."}