{"6.72d": " Increased  Song of the Siren duration from 6 to 7. Reduced  Rip Tide cooldown from 12 to 10. Undid melee hero collision change from 6.72c", "6.81": " Reduced  Mirror Image illusion damage dealt from 30%/35%/40%/45% to 20%/25%/30%/35%.  Rip Tide Reduced radius from 350 to 320. Armor reduction debuff no longer goes through spell immunity.", "6.60": " Reduced collision size from 24 to 8.  Mirror Image Reduced split time from 0.5 to 0.3. Reduced cooldown from 50 to 40. Reduced manacost from 85/105/130/150 to 70/80/90/100.", "6.20": "  Song of the Siren Reduced sleep duration from 6/8/10 to 6/7/8 Increased invulnerability duration from 4/5.5/7 to 6/7/8.", "6.84": "  Ensnare Is no longer dispelled by ethereal state. Is now dispelable. Reduced cooldown from 14 to 12.  Rip Tide no longer ignores ancient creeps, Roshan and creep-heroes. Added  Aghanim's Scepter upgrade for Naga Siren: Causes  Song of the Siren to regenerate Naga Siren and nearby allies by 6% of maximum health per second for the duration.", "6.78": " Reduced  Rip Tide cooldown from 19/16/13/10 to 10.", "6.42": "  Song of the Siren now also affects invisible enemies and enemies in the Fog of War.", "6.72c": " Increased  intelligence gain from 1.65 to 1.95. Melee hero collision size now reduced from 24 to 12.", "6.75": " Reduced base attack damage from 35-37 to 23-25 (total attack damage is now 44-46). Increased  Mirror Image,  Ensnare,  Song of the Siren cast point from 0.5 to 0.65.", "6.74": " Reworked  Rip Tide", "6.76": " Increased  Rip Tide cooldown from 10 to 19/16/13/10.", "6.17": " Increased  agility gain from 2.65 to 2.75. Increased base attack damage from 25-27 to 30-32 (total attack damage is now 51-53).", "6.70": " Increased base attack damage from 30-32 to 35-37 (total attack damage is now 56-58).", "6.73": " Increased  Ensnare cast range from 620/630/640/650 to 650. Increased  Song of the Siren radius from 750 to 1250.  Song of the Siren End is now only available 0.5 seconds after the cast of Song of the Siren.", "6.72": " Increased base health regeneration from 0.25 to 0.75. Increased attack range from 100 to 128. All of Naga Siren's illusions within 900 radius around her now cast a fake Ensnare whenever Naga Siren casts it. Replaced Critical Strike with  Rip Tide", "6.82c": " Increased  Song of the Siren cast point increased from 0.65 to 0.8.", "6.35": " Increased base armor from 0 to 3 (total armor is now 5.94) Increased base  strength and gain from 19 + 1.9 to 21 + 2.3. Increased base  intelligence from 15 to 18.", "6.04": " Increased base  strength from 17 to 19.", "6.63": "  Mirror Image Increased number of illusions from 1/2/3/3 to 3 on each level. Increased illusion damage dealt from 15%/30%/30%/45% to 30%/35%/40%/45%. Increased illusion damage taken from 400% to 600%/500%/400%/300%.", "6.79": " Reduced  Rip Tide radius from 450 to 350. Increased  Ensnare manacost from 75/85/95/105 to 90/100/110/120.", "6.50": " Reduced  Mirror Image cooldown from 60 to 50. Reduced  Song of the Siren manacost from 200/275/360 to 200 on each level."}