{"6.44": " Fixed  Sprout trees respawning when their trunks are still there at 5 minute marks.", "6.63": " Reduced  Teleportation cooldown from 60/50/40/30 to 50/40/30/20. Increased  Wrath of Nature cast range from 650 to global (bounce distance is already global).", "6.60": "  Sprout is now blocked by  Linken's Sphere.  Teleportation can now be targeted inside the enemy's base area (restriction no longer needed due to new backdoor protection).", "6.61": "  Sprout Reduced manacost from 115/140/165/205 too 100/120/140/160. Reduced cooldown from 11 on each level to 11/10/9/8.", "6.67": "  Sprout Changed targeting type from unit to ground or unit. Fixed not being cut down by  Wild Axes.", "6.65": " Treants now have 33% magic resistance.", "6.00": " Increased base armor from -1 to 1 (total armor is now 3.1). Recoded  Sprout so it can be used by multiple Prophets and fixed an abusable bug.", "6.68": " Increased base  agility and gain from 15 + 1.5 to 18 + 1.9.  Teleportation now has a minimap indicator for allies.", "6.69": "  Sprout Improved trapping coding to prevent heroes from popping out of it sometimes. Changed targeting type from ground or unit to unit only. Treants can now attack flying units. Changed  Wrath of Nature targeting type from unit to ground or unit. This allows the player to cast the ability by clicking on the minimap.  Aghanim's Scepter now also increases number of bounces from 12/14/16 to 14/16/18.", "6.04": " Tweaked  Sprout's tree positioning.", "6.05": " Increased  Nature's Call cooldown from 30 to 37.", "6.63b": " Fixed  Wrath of Nature targeting couriers.", "6.31": "  Teleportation can no longer target the enemy base area.", "6.33": "  Teleportation now creates a visual effect at the targeted location during the cast time.", "6.19b": " Fixed some issues on  Sprout. Increased Treants attack damage from 19-21 to 21-23.", "6.37": " Reduced  Teleportation manacost from 75/65/55/50 to 50/45/40/35.", "6.39": " Added disablehelp support for  Sprout.", "6.57": " Fixed  Shackleshot and  Nature's Guise not working with  Sprout trees.", "6.79": " Treants Increased gold bounty from 12-16 to 14-20. Increased experience bounty from 20 to 30.", "6.72c": " Increased base  strength from 17 to 19.", "6.75": " Reduced movement speed from 300 to 295. Reduced Treants magic resistance from 33% to 20%.", "6.74": " Increased  Teleportation manacost from 50/45/40/35 to 50 on each level. Increased  Wrath of Nature manacost from 150/175/200 to 150/200/250.", "6.71": " Changed  Sprout targeting type from unit to ground or unit.", "6.70": " Increased base attack damage from 18-32 to 24-38 (total attack damage is now 45-59).", "6.73": " Increased  Wrath of Nature cooldown from 90/60/60 to 90/75/60.", "6.72": " Increased  Wrath of Nature number of bounces from 12/14/16 ( 14/16/18) to 16 (18).", "6.59": " Reduced  Wrath of Nature manacost from 200/380/610 to 150/175/200.", "6.52b": " Fixed a rare bug involving  Sprout and Lone Druid's Spirit Bear.", "6.58": "  Sprout can now be cast on self.", "6.80": " Increased  Wrath of Nature manacost from 150/200/250 to 175/225/275.", "6.82": " Reduced Treants magic resistance from 20% to 0%.", "6.84": "  Sprout Increased cast range from 600 on each level to 625/700/775/850. Increased duration from 3/3.75/4.5/5.25 to 3/4/5/6. Increased Treants attack damage from 21-23 to 26-30.  Aghanim's Scepter now also spawns a Treant for every non-hero and a Greater Treant for every hero killed with  Wrath of Nature.", "6.25": " Increased movement speed from 295 to 300.", "6.20": " Increased movement speed from 280 to 295. Reduced  Sprout duration from 3/4/5/6 to 3/3.75/4.5/5.25.", "6.29": " Fixed some issues with  Sprout sometimes pushing the targeted hero out."}