{"6.63": " Reworked  Mana Burn", "6.60": "  Impale is now blocked by  Linken's Spheres", "6.67": " Removed from Captain's Mode. Reduced  Impale damage from 80/160/230/300 to 80/140/200/260. Replaced  Spiked Carapace with Urna Swarm Urna Swarm:", "6.64": "  Mana Burn can no longer target non-hero units, since it no longer affects them.", "6.77c": "  Spiked Carapace Reduced duration from 2.75 to 2.25. Increased cooldown from 14 to 23/20/17/14.", "6.42": " Increased  Mana Burn cast range from 500 on each level to 500/575/650/725.", "6.50": " Recoded  Impale: No longer turns hit enemies invulnerable during the air time. No longer requires channeling in order for the spikes to reach max distance. No longer causes hit enemy units to instantly face towards Nyx Assassin. No longer conflicts with  Earth Spike,  Burrowstrike,  Ravage and Impales from other Nyx Assassins. No longer fails to stun and damage enemies when the targeted point was a cliff.", "6.35": " Increased base armor from 0 to 1 (total armor is now 3.66).", "6.19b": " Reduced  Impale cast range from 600 to 500.", "6.38": "  Vendetta Increased movement speed bonus from 10% on each level to 10%/15%/20%. Increased duration from 20 on each level to 20/35/50 Reduced cooldown from 90 on each level to 90/75/60", "6.72d": " Undid melee hero collision change from 6.72c", "6.79": "  Impale can no longer directly target units, but only target ground now.  Spiked Carapace no longer stuns and damages the player's hero when the player's summoned units proc it (the summoned units get affected instead).", "6.78": "  Mana Burn Reduced mana burned from 500% to 350%/400%/450%/500% of the target's intelligence. Reduced manacost from 130/120/110/100 to 100 on each level.", "6.51": " Fixed  Impale affecting Juggernaut during  Blade Fury. Fixed a bug between  Voodoo Restoration and Impale.", "6.72c": " Melee hero collision size now reduced from 24 to 12.", "6.75": " Increased base health regeneration from 0.25 to 2.5.  Mana Burn Increased mana burned from 400% to 500% of target's intelligence. Rescaled manacost from 90/110/130/150 to 130/120/110/100.  Spiked Carapace Can now reflect one damage instance from each player during its duration, instead of only from the first player to damage him. Reduced carapace duration from 4.5 to 2.75. Reduced manacost from 50 to 40. Increased cooldown from 10 to 14. Increased  Vendetta movement speed bonus from 10%/15%/20% to 16%/18%/20%.", "6.74": " Replaced Urna Swarm replaced with  Spiked Carapace", "6.76": " Increased  Vendetta damage from 225/375/525 to 250/400/550.", "6.71": " Urna Swarm Reduced maximum allowed Scarabs from 2/4/6/8 to 2/3/4/5. Increased manacost from 10 on each level to 40/30/20/10. Increased cooldown from 14/11/8/5 to 26/19/12/5. Infestation Increased damage per second from 20 to 40. Increased radius from 275 to 300.", "6.73": " Reduced  Mana Burn cooldown from 35/25/15/5 to 28/20/12/4. Reduced  Vendetta cooldown from 90/75/60 to 70/60/50.", "6.72": " Added to Captain's Mode.", "6.80": " Increased  Impale cast range from 500 to 700 (matches its travel distance now).", "6.81": "  Impale Increased cooldown from 11 to 13. Is no longer blocked by  Linken's Sphere.", "6.84": "  Impale no longer ignores ancient creeps, Roshan and creep-heroes. Casting  Spiked Carapace no longer cancels  Vendetta.  Vendetta damage is no longer reduced by Damage Block. Added  Aghanim's Scepter upgrade for Nyx Assassin: Grants Nyx Assassin the  Burrow ability."}