{"6.44": "  Sanity's Eclipse now shows how much damage it dealt as a floating number above hit enemies.", "6.60": "  Astral Imprisonment Is now properly blocked by  Linken's Sphere. No longer causes allies to lose vision when targeted. Reduced cooldown from 20 on each level to 18/16/14/12.", "6.47": " Reduced  Astral Imprisonment cast time from 0.5 to 0.25.  Sanity's Eclipse Reduced cast time from 0.5 to 0.25. Increased cast range from 600 on each level to 600/650/700. Reduced intelligence difference damage multiplier from 10/12/14 to 8/9/10. Rescaled manacost from 200/250/300 to 175/250/325.", "6.66": "  Essence Aura now has the same 10%/20%/30%/40% trigger chance for  Arcane Orb, instead of 5%/10%/15%/20%.", "6.64": " Increased  agility and gain from 15 + 1.4 to 24 + 2.", "6.43": " Fixed  Essence Aura triggering on  Ring of Basilius toggling.", "6.68": "  Astral Imprisonment no longer causes enemy targets to lose vision. Added  Aghanim's Scepter upgrade for Outworld Devourer: Increases  Sanity's Eclipse intelligence difference damage multiplier from 8/9/10 to 9/10/11 and cast range from 600/650/700 to 700/750/800.", "6.46": " Fixed  Arcane Orb dealing summons bonus damage to  Warlock's Golem.", "6.40": " Increased base armor from -1 to 2 (total armor is now 4.1). Reduced  Sanity's Eclipse cooldown from 200 to 160.", "6.33b": " Fixed  Arcane Orb doing extra damage when combined with illusions or in Same Hero mode. ", "6.42": " Reduced  Astral Imprisonment and  Sanity's Eclipse cast times from 0.83 to 0.5.  Essence Aura no longer triggers on  Pulse Nova.", "6.31": " Changed  Arcane Orb damage type from unknown to Pure.  Astral Imprisonment. Fixed a bug with Repick allowing to have 2 heroes. Fixed not restoring intelligence when the hero is dead as its intelligence would be restored. Fixed  Sanity's Eclipse's damage radius being 325 on each level, instead of 400/500/600 as stated.", "6.30": " Created", "6.32": "  Astral Imprisonment Fixed lasting more than 4 seconds on level 4. Reduced cast range from 700 to 550. Fixed  Essence Aura triggering on  Techies' Detonate.", "6.35": "  Sanity's Eclipse Increased intelligence difference damage multiplier from 10 on each level to 10/12/14. Increased intelligence difference threshold from 10/25/40 to 10/30/50.", "6.34": " Reduced  Sanity's Eclipse manacost from 300/500/700 to 200/250/300.", "6.36": " Fixed  Essence Aura triggering on  Reality and on  Perseverance disassemble ability.", "6.38": " Added Disablehelp support for  Astral Imprisonment.", "6.79": " Reduced base attack damage from 23-38 to 20-35 (total attack damage is now 46-61).  Essence Aura no longer triggers on active item abilities. The following items used to have a chance to trigger it:  Abyssal Blade,  Animal Courier,  Black King Bar,  Blink Dagger,  Buckler,  Force Staff,  Manta Style,  Necronomicon,  Observer Ward,  Orchid Malevolence,  Rod of Atos,  Scythe of Vyse,  Sentry Ward,  Shadow Amulet,  Shadow Blade,  Shiva's Guard,  Tranquil Boots", "6.78": " Increased movement speed from 310 to 315.", "6.51": " Fixed  Essence Aura triggering on  Mana Shield toggling.", "6.50": " Fixed  Essence Aura triggering on  Berserker's Rage toggling.", "6.75": " Increased  Astral Imprisonment intelligence steal from 2/4/6/8 to 4/6/8/10.", "6.76": " Increased movement speed from 300 to 310.", "6.71": "  Arcane Orb no longer has a 6/4/2/0 seconds cooldown.", "6.73": "  Sanity's Eclipse now hits units imprisoned by  Astral Imprisonment.", "6.72": " Increased  intelligence gain from 2.8 to 3.3.", "6.80": " Reduced  Astral Imprisonment cast range from 550 to 500.", "6.82": "  Essence Aura Increased proc chance from 10%/20%/30%/40% to 40% on each level. Increased max mana restored from 25% on each level to 10%/15%/20%/25%.  Aghanim's Scepter upgraded  Sanity's Eclipse now always triggers the mana drain.", "6.83": "  Astral Imprisonment Increased intelligence steal from 4/6/8/10 to 4/7/10/13. Reduced steal duration from 60 to 50.", "6.84": "  Aghanim's Scepter upgraded  Sanity's Eclipse No longer causes it to always trigger the mana burn. No longer increases the intelligence multiplier from 8/9/10 to 9/10/11. Now affects everyone in the targeted area with  Astral Imprisonment based on its current level after it deals its damage.", "6.66b": " Fixed  Essence Aura triggering on  Heal and  Radiance toggling.", "6.44b": " Fixed  Essence Aura triggering on Electric Rave."}