{"6.63": " Increased  Juxtapose illusion duration from 15 to 20.", "6.67": " Increased  Juxtapose illusions damage taken from 400% to 450%.", "6.00": " Created.", "6.02": "  Doppelwalk Reduced cooldown from 30/25/20/15 to 30 on each level. Increased illusion damage dealt from 20% to 25%. Increased  Juxtapose illusions damage dealt from 20% to 25%. Reduced  Phantom Edge evasion chance from 10%/20%/30% to 5%/10%/15%.", "6.69": " Reduced  strength gain from 2.0 to 1.7.", "6.04": "  Spirit Lance No longer turns the target ethereal. Now slows movement speed by 10%/20%/30%/40% and attack speed by 10/20/30/40 for 3 seconds. Reduced  Doppelwalk invisibility duration from 20 to 12.", "6.06": " Increased  Spirit Lance damage from 80/135/200/295 to 100/150/215/310.", "6.83c": " Enabled in Captain's Mode.", "6.52": "  Doppelwalk illusions will now automatically walk forwards for a short distance upon spawning, to make it less obvious to the enemies that the spell was cast.", "6.50": " Increased  strength gain from 1.5 to 2.0.", "6.13": " Increased  agility gain from 2.7 to 2.8.", "6.35": " Increased base armor from -1 to 0 (total armor is now 3.22).", "6.36": " Increased base  and gain from 16 + 1.7 to 21 + 2.0. Reduced  Doppelwalk cooldown from 30 on each level to 30/25/20/15.", "6.72d": " Undid melee hero collision change from 6.72c", "6.55": " Increased  Spirit Lance cast range from 600 to 750.", "6.54": "  Spirit Lance No longer mini-stuns the target upon projectile impact. The slow is now applied upon projectile impact, instead of launch. Now creates an illusion of Phantom Lancer upon projectile impact. The illusion deals 20% damage, takes 400% damage and lasts 2/4/6/8 seconds. All of Phantom Lancer's illusions within 675 radius around him now cast a fake Spirit Lance whenever Phantom Lancer casts it. Can no longer be disjointed. Reduced damage from 100/150/215/310 to 100/150/200/250. Reduced manacost from 140 on each level to 125/130/135/140. Reduced cooldown from 9 to 7.  Doppelwalk Reduced invisibility duration from 12 to 8. Increased illusion damage taken from 300% to 400%.  Juxtapose Reduced max illusions cap from 6 to 5. Increased illusions damage taken from 300% to 400%.", "6.79": "  Spirit Lance is now disjointable.", "6.78": " Reduced  Spirit Lance illusion damage dealt from 25% to 20%. Reduced  Doppelwalk illusion damage dealt from 25% to 20%. Reduced  Juxtapose illusions damage dealt from 25% to 20%.", "6.51": "  Phantom Edge No longer grants 5%/10%/15% chance for evasion. Now grants 10%/15%/20% magic resistance.", "6.72c": " Increased base health regeneration from 0.25 to 0.75.  Juxtapose Increased proc chance from 3%/6%/9%/12% to 12% on each level. Reduced max illusions cap from 5 on each level to 2/3/4/5. Melee hero collision size now reduced from 24 to 12.", "6.75": " Increased  agility gain from 2.8 to 4.2. Increased  Spirit Lance slow duration from 3 to 3.25.", "6.76": " Reduced collision size from 24 to 8.", "6.73": " Increased  Doppelwalk movement speed bonus from 10% to 15%. Increased  Juxtapose max illusions cap from 2/3/4/5 to 2/4/6/8.", "6.72": " Increased attack range from 100 to 128.", "6.82c": " Reduced  Juxtapose max illusions cap from 6/8/10 to 5/7/9.", "6.82": " Removed from Captain's Mode. Rescaled base  agility and gain from 23 + 4.2 to 29 + 3.0. Increased base  strength from 18 to 21. Replaced  Doppelwalk with  Doppelganger", "6.03": " Reduced  Juxtapose max illusions cap from 8 to 6.", "6.20": " Reduced base  strength and gain from 19 + 2.0 to 18 + 1.5.", "6.10": " Fixed some memory leak issues on  Spirit Lance."}