{"6.63": " Reduced  Stifling Dagger cooldown from 10 to 8.", "6.60": " Replaced  Blink Strike with  Phantom Strike", "6.43": " Increased  Blink Strike cast range from 700 on each level to 700/800/900/1000.", "6.81b": " Increased  Phantom Strike attack speed bonus from 100 to 130.", "6.69": " Rescaled Base  strength and gain from 17 + 2.05 to 20 + 1.85. Reduced  Phantom Strike cooldown from 30/20/10/5 to 20/15/10/5.", "6.04": "  Blink Strike Now blinks closer to the target. Removed the 0.3 second delay on the damage.  Coup de Grace Increased proc chance from 5%/10%/15% to 15% on each level. Reduced critical damage from 400% on each level to 200%/300%/400%.", "6.06": " Fixed  Blink Strike dealing no damage.", "6.07": " Fixed some memory leak issues with  Blink Strike.", "6.53": "  Stifling Dagger Increased cast range from 800 to 1200. Increased movement speed slow from 20%/25%/30%/35% to 50% on each level. Reduced slow duration from 2/2.75/3.5/4.25 to 1/2/3/4. Reduced manacost from 35/30/30/25 to 30/25/20/15.", "6.00": " Reduced base armor from 0 to -1 (total armor is now 2.22).  Blink Strike Now makes the caster face the target after blinking. Fixed not going into cooldown when used. Added a 0.3 second delay to the damage, so it doesn't happen instantly upon blinking.", "6.35": " Increased base armor from -1 to 1 (total armor is now 4.22).", "6.72d": " Undid melee hero collision change from 6.72c", "6.55": " Increased  Blur dodge chance from 7%/14%/21%/28% to 15%/20%/25%/30%.", "6.54": "  Blur visual effect (the transparency) is now applied only to enemies.", "6.79": "  Stifling Dagger No longer ignores its cast backswing. Is now disjointable. Rescaled creep damage from 50/100/150/200 to 60/100/140/180. Rescaled hero damage from 25/50/75/100 to 30/50/70/90.  Coup de Grace now also grants Stifling Dagger the same critical proc chance with the same damage multipliers.", "6.78": " Increased  Blur dodge chance from 20%/25%/30%/35% to 20%/25%/30%/40%.", "6.51": " Replaced Shadow Strike with  Stifling Dagger", "6.72c": " Melee hero collision size now reduced from 24 to 12.", "6.75": " Increased  Coup de Grace critical damage from 250%/325%/400% to 250%/350%/450%.", "6.74": "  Phantom Strike Icreased cast range from 700/800/900/1000 to 1000. Reduced cooldown from 20/15/10/5 to 14/11/8/5.", "6.10": "  Blink Strike Can now be cast on allied units. Slightly improved timing.", "6.71": "  Blur Now causes Phantom Assassin to only get transparent when an enemy hero is within 1600 range of her. This effect has a 1.5 second delay. Now also causes Phantom Assassin to disappear on the minimap when an enemy hero iswithin 1600 range of her. This effect has also a 1.5 second delay. The 20%/25%/30%/35% evasion is still permanent. Increased  Coup de Grace critical damage from 200%/300%/400% to 250%/325%/400%.", "6.70": " Increased  Blur dodge chance from 15%/20%/25%/30% to 20%/25%/30%/35%.", "6.73": "  Stifling Dagger Increased creep damage from 40/80/120/160 to 50/100/150/200. Increased hero damage from 20/40/60/80 to 25/50/75/100.", "6.72": " Increased attack range from 100 to 128.", "6.80": "  Blur Now also reacts on invisible heroes. Reduced enemy detection delay from 1.5 to 0.75.", "6.81": " Reduced  Stifling Dagger cooldown from 8 to 6. Increased  Blur dodge chance from 20%/25%/30%/40% to 20%/30%/40%/50%.", "6.82": "  Blur minimap hide now has the opposite effect, and is active when no enemies are within a 1600.", "6.83": " Reduced  Coup de Grace critical damage from 250%/350%/450% to 230%/340%/450%"}