{"6.80": "  Icarus Dive is now interrupted if Phoenix is stunned during it.  Fire Spirits Can now be cast during  Icarus Dive. Reduced attack Speed slow from 150 to 80/100/120/140. Reduced damage over time from 20/40/60/80 to 15/35/55/75.", "6.81": " Increased  Icarus Dive cast time from 0.01 to 0.2.  Fire Spirits Reduced damage from 15/35/55/75 to 10/30/50/70. Increased health cost from 15% to 20%.", "6.82": " Added  Aghanim's Scepter: Allows Phoenix to cast  Supernova on an allied hero, bringing both into the Sun to be reborn together. This does not refresh either hero's ultimate. 500 cast range. If the Sun is destroyed, both heroes will die.", "6.83": " Increased  Supernova required attacks to destroy from 5/7/10 to 5/8/11.", "6.84": "  Fire Spirits and  Supernova no longer ignore ancient creeps, Roshan and creep-heroes.  Fire Spirits now does an obstructed reveal of the area it hits for 1 second.", "6.78": " Increased  Sun Ray health cost per second from 3% to 4%.", "6.79c": " Added Phoenix in Captain's Mode.", "6.75": " Reduced base attack damage from 32-42 to 26-36 (total attack damage is now 43-53). Reduced base  strength from 19 to 17. Reduced base movement speed from 290 to 285.  Supernova now refreshes Phoenix's other skills (not items) if the sun survives.", "6.77": "  Sun Ray Reduced max range from 1600 to 1300. Reduced base damage from 16/24/32/40 to 15/20/25/30. Now ends if you are stunned or silenced.", "6.76": "  Fire Spirits Increased duration from 12.5 to 16. Can now be cast during  Sun Ray towards any direction, without requiring to face the targeted point.  Supernova Fixed not working with  Radiance aura (other auras work already). Increased required attacks to destroy from 5/7/9 to 5/7/10.", "6.71": " Reduced base  strength from 22 to 19.  Sun Ray Increased activation manacost from 10 to 35. Reduced slow from 14%/20%/26%/32% to 10%/16%/22%/28%. Reduced slow duration from 2 to 1. Fixed a bug that caused to it to always affect the first target regardless of spell immunity.", "6.70": " Created.", "6.73": "  Fire Spirits Reduced heal amount to 50% of damage. Now targets a location rather than a unit. Reduced cooldown from 35 to 30. Increased projectile speed increased (unknown values). Reduced  Icarus Dive cooldown from 30 to 25.  Sun Ray Reduced health activation cost from 25% to 20%. Rescaled manacost rescaled from 35 to 10/20/30/40.", "6.72": "  Icarus Dive Reduced cooldown from 40 to 30. No longer makes Phoenix spell immune. If Phoenix is disabled during it, it stops.  Sun Ray No longer slows. Rescaled damage from 10/20/30/40 + 5% to 15/30/45/60 + 4%. Improved turn rate slightly (values unknown).  Fire Spirits now trigger in the area around Phoenix and the target when using Target Fire Spirits.", "6.75b": " Rescaled  Icarus Dive heal from 0.5%/1.5%/2.5%/3.5% over 6 seconds to 0.75%/2.25%/3.75%/5.25% over 4 seconds. Overall, it heals for the same amount, but 2 seconds faster.", "6.79": " Increased  Sun Ray health cost from 4% of current health to 6%.", "6.72d": " Increased  Sun Ray damage from 4% to 6%.  Target Fire Spirit now launches all the spirits at once, rather than one at a time. Rebalanced  Fire Spirits min/max numbers."}