{"6.57": " Fixed a bug between  Phase Shift and  Phase Boots.", "6.63": " Increased  Illusory Orb manacost from 125 to 150.  Ethereal Jaunt Reduced manacost from 25 to 0. Increased cooldown from 0 to 5.", "6.82": "  Dream Coil No longer ignores invisible and fogged units or illusions.  Aghanim's Scepter now causes the link break stun to pierce spell immunity.  Aghanim's Scepter now increases link break stun duration from 1.5/2.25/3 to 1.5/3/4.5", "6.69": " Fixed  Waning Rift damage radius being slightly smaller than the silence radius.", "6.79": " Reduced night vision from 1200 to 800.", "6.67": " Added  Aghanim's Scepter upgrade  for Puck: Increases  Dream Coil duration from 5 to 7, link break damage 100/150/200 to 200/250/300 and manacost from 100/150/200 to 150/200/250.", "6.75": " Increased  Illusory Orb damage radius form 200 to 225. Increased  Waning Rift damage from 60/120/180/240 to 70/140/210/280. Increased  Dream Coil duration from 5 to 6. Increased  Aghanim's Scepter upgraded  Dream Coil duration from 7 to 8.", "6.74": "  Ethereal Jaunt now disjoints projectiles upon cast.  Phase Shift Can no longer be set on auto-cast. Reduced manacost from 50/40/30/20 to 0 on each level. Increased duration from 0.75/1.5/2.25/3 to 0.75/1.5/2.25/3.25.  Aghanim's Scepter no longer increases  Dream Coil manacost from 100/150/200 to 150/200/250.", "6.77": " Reduced  Illusory Orb cooldown from 13 to 12.", "6.76": " Increased base attack damage from 17-28 to 22-33 (total attack damage is now 47-58).", "6.71": "  Illusory Orb now starts flashing 1 second before it expires.", "6.70": " Reduced  Waning Rift cooldown from 20 to 16.", "6.72": " Increased base attack damage from 13-24 to 17-28 (total attack damage is now 42-53). Increased  Waning Rift silence duration from 0.1/1/2/3 to 0.75/1.5/2.25/3.", "6.63b": " Fixed an exploit possible with Puck.", "6.47": " Created.", "6.84": " Increased  Waning Rift damage from 70/140/210/280 to 100/160/220/280.", "6.48b": " Reduced movement speed from 300 to 295. Reduced  intelligence gain from 3.5 to 3.1. Increased  Waning Rift cooldown from 12 to 20. Fixed  Dream Coil link break damage and stun not affecting fogged or invisible enemies.", "6.49": " Reduced base  intelligence and gain from 27 + 3.1 to 25 + 2.4.", "6.68": " Reduced  Illusory Orb cooldown from 15 to 13.", "6.48": " Reduced base  strength from 17 to 15. Increased  Waning Rift cooldown from 10 to 12.", "6.52": " Reduced attack range from 600 to 550."}