{"6.60": " Added  Aghanim's Scepter upgrade for Pudge: Causes  Dismember to additionally deal 75% of Pudge's strength as damage and heals Pudge for the amount of damage dealt.", "6.67": " Increased  Flesh Heap enemy death radius from 400 to 525.", "6.64": "  Flesh Heap reworked:", "6.65": "  Meat Hook Increased max distance and cast range from 400/600/800/1000 to 550/700/850/1000. Reduced cooldown from 14 to 14/13/12/11. Reduced manacost from 140 to 110/120/130/140.", "6.00": "  Meat Hook Fixed bug that caused it to get erractic at long range. No longer bends based on environmental props. Can no longer hook wards. Reduced the cast phase during which Pudge is disabled from 0.5 to 0.4.  Rot now slows affected enemies by 20%.  Flesh Heap No longer turns Pudge immune to piercing damage. Increased  strength per killed hero from 0.03/0.06/0.09/0.12 to 0.3/0.6/0.9/1.2 (creep kills still grant 0.03/0.06/0.09/0.12).", "6.68": " Reduced armor from 0 to -1 (total armor is now 0.96).  Flesh Heap is now retroactive.", "6.04": " Pudge can no longer get first blood for  Rotting at start.", "6.52": "  Flesh Heap now works with denies. Fixed  Rot,  Sand Storm and Storm Seeker from not being able to affect the same area at the same time.", "6.42": "  Meat Hook now properly interrupts channeling.", "6.35": " Increased armor from -1 to 0 (total armor is now 1.96).", "6.72d": " Undid melee hero collision change from 6.72c.", "6.79": " Can now buy  Blink Dagger. If a unit gets hooked onto an unpathable ledge, the unit gains free pathing for 5 seconds. Reduced  Flesh Heap magic resistance from 4%/8%/12%/16% to 6%/8%/10%/12%. Increased  Aghanim's Scepter upgraded  Dismember  strength multiplier from 0.75 to 1.0.", "6.78": " Increased  Flesh Heap  strength bonus per enemy hero death from 0.9/1.2/1.5/1.8 to 1/1.5/2/2.5.", "6.72c": " Melee hero collision size now reduced from 24 to 12.", "6.72": " Increased  Rot damage from 25/50/75/100 to 35/60/85/110.", "5.79": " Reduced base  strength from 26 to 25. Increased base  intelligence from 13 to 14.", "6.58": " Increased  Flesh Heap  strength per hero kill from 0.3/0.6/0.9/1.2 to 0.9/1.2/1.5/1.8.", "5.76": " Re-added and reworked Pudge (to see the previous Pudge, see here).", "6.82": " Increased turn rate from 0.5 to 0.7. [Undocumented]  Meat Hook damage now pierces spell immunity.", "6.83": " Increased  Meat Hook max distance and cast range from 700/900/1100/1300 to 1000/1100/1200/1300.", "6.84": " Increased  Rot movement speed slow from 20% to 20%/22%/24%/26%.", "5.80": "  Meat Hook No longer turns Pudge invulnerable during the 0.5 second cast phase. No longer bends based on Pudge's facing direction.", "5.83": " Can no longer buy  Blink Dagger.", "5.82": " Increased  Dismember cooldown from 25 to 30."}