{"6.63": "  Nether Ward's Mana Flare no longer has a 0.75 second cooldown.", "6.60": "  Life Drain Increased link break distance from 800 to 850. Increased cast range from 550 to 850.  Aghanim's Scepter upgraded  Life Drain No longer increases manacost from 125/175/225 to 175/225/275. Increased link break distance from 850 to 900. Increased cast range from 600 to 900. Reduced health drain per second from 170/200/300 to 150/200/250. Reduced cooldown from 10 to 0.", "6.66": " Increased  Decrepify cast range from 550 on each level to 550/600/650/700.", "6.67": " Reduced  Decrepify magic resistance reduction from 44% to 40%.", "6.65": " Reduced cast time of all abilities from unknown to 0.2.  Decrepify can now be cast on  Nether Ward.", "6.00": " Pugna can now attack ethereal units.  Nether Ward Reduced armor from 12 to 0. Reduced health from 175/250/325/400 to 175 on each level.", "5.62": " Created.", "5.65": "  Nether Blast Reduced damage from 125/200/275/350 to 100/175/250/325. Reduced radius from 350 to 300. Increased Morbid mana loss per second from 1.5/3/4.5/6 to 2/4/6/8.  Life Drain Reduced health drained per second from 100/150/200 to 95/140/185. Increased cooldown from 16 to 30. Added  Aghanim's Scepter for Pugna: Increases  Life Drain health drained per second from 95/140/185 to 140/185/230 and manacost from 125/175/225 to 175/225/275.", "6.09b": " Reduced  Nether Blast cast time from unknown to unknown (reduced by 0.5).", "6.13": " Increased attack range from 575 to 600. Increased  intelligence gain from 3.75 to 4. Reduced  Decrepify cooldown from 15/13/11/9 to 13/11/9/7.", "6.34": "  Nether Ward now has a 20/40/60/80 gold bounty.", "6.36": " Reduced  Nether Ward health from 100/200/300/400 to 75/150/225/300.", "6.19b": " Increased  Life Drain max channel time from 7 to 9.", "6.19": " Increased base  strength from 14 to 17. Reduced  Nether Blast effect delay from unknown to 0.9.  Nether Ward No longer deals the damage to all units with a mana pool within a 250/500/750/1000 radius around the shocked unit. Increased mana loss per second from 1/2/3/4 to 1.5/3/4.5/6. Rescaled health from 160/200/240/280 to 100/200/300/400.", "6.10": " Increased movement speed from 295 to 315.  Nether Ward Increased health from 175 on each level to 160/200/240/280. Increased mana loss per second from 1 on each level to 1/2/3/4. Increased damage per spent mana from 1 on each level to 0.75/1/1.25/1.5. Increased  Life Drain cast range from 500 to 550.  Aghanim's Scepter now also incrases Life Drain's cast range from 550 to 600 and link break distance from 800 to 850.", "6.79": "  Decrepify Reduced allies magic resistance reduction from 40% to 25%. Increased enemy magic resistance reduction from 40% to 50%.  Nether Ward now requires 3 (hero)/12 (non-hero) attacks to be destroyed, instead of having 75/150/225/300 health.  Life Drain now restores Pugna's mana if it tries to heal him while he is at full health when targeting heroes.", "6.78": " Increased  Nether Blast damage against buildings from 33% to 50%.  Decrepify can now be cast on  Tombstone.", "6.75": " Increased movement speed from 315 to 320. Increased  Nether Ward damage per spent mana from 0.75/1/1.25/1.5 to 1/1.25/1.5/1.75. Increased  Life Drain link break distance and cast range from 850 ( 900) to 900 ( 950).", "6.74": " Increased  Decrepify cast range from 550/600/650/700 to 700 on each level. Increased  Life Drain health drain per second from 100/150/200 ( 175/225/275) to 120/160/200 ( 180/240/300).", "6.77": " Reduced  Decrepify cooldown from 13/11/9/7 to 12/10/8/6.", "6.76": " Increased  Nether Ward radius from 700/1000/1300/1600 to 1600 on each level. Increased  Life Drain link break distance and cast range from 900 ( 950) to 1100 ( 1150).", "6.71": " Reduced  strength gain from 1.45 to 1.2.", "6.73": "  Life Drain Increased health drain per second from 95/140/185 ( 150/200/250) to 100/150/200 ( 175/225/275). Increased max channel time from 9 to 10.", "6.58": "  Aghanim's Scepter now also reduces  Life Drain cooldown from 22 to 10.", "5.78": " Increased  strength gain from 1.2 to 1.45. Reduced  agility gain from 1.2 to 1. Reduced  Life Drain cooldown from 30 to 22.", "5.79": " Replaced Morbid with  Nether Ward", "5.72": " Increased Morbid mana loss per second from 2/4/6/8 to 3/6/9/12.", "6.81": " Reduced  Decrepify manacost from 100 to 60. Increased  Nether Ward duration from 25 to 30.", "6.82": "  Life Drain can now be cast on allies, allowing Pugna to drain his own life into them.", "6.83": " Reduced  Decrepify allies movement speed slow from 50% to 25%.  Nether Ward Increased required attacks to destroy from 3 (hero)/12 (non-hero) to 4 (hero)/16 (non-hero). Changed source of its damage from Pugna to the ward itself (this causes  Blade Mail to no longer reflect Mana Flare damage back to Pugna).", "6.84": "  Decrepify Rescaled enemy movement speed slow from 50% on each level to 30%/40%/50%/60%. Rescaled enemy magic resistance reduction from 50% on each level to 30%/40%/50%/60%. Increased duration from 2/2.5/3/3.5 to 3.5 on each level. Increased cooldown from 12/10/8/6 to 15/12/9/6.  Life Drain Rescaled link break distance and cast range from 1100 ( 1150) to 900/1050/1200. Increased health drain per second from 120/160/200 to 150/185/220.", "6.26": " Increased base  agility from 13 to 16.", "6.24": " Increased  Nether Blast radius from 300 to 400.", "5.80": " Increased  Nether Ward health from 5 on each level to 175/250/325/400.", "6.28": " Increased  Aghanim's Scepter upgraded  Life Drain health drain per second from 140/185/250 to 170/200/300."}