{"6.63": " Increased base  strength from 17 to 21.", "6.60": " Reworked Razor. Increased base  and gain from 14 + 1.8 to 19 + 2.2. Reduced attack range from 550 to 475. Replaced Frenzy with  Plasma Field.", "6.61": " Reduced  intelligence gain from 2.2 to 1.8.", "6.40": " Increased base attack damage from 15-17 to 23-25 (total attack damage is now 45-47).", "6.41": "  Storm Seeker Fixed damage not upgrading upon leveling until next death or becoming hexed. Now stuns Razor for 0.01 seconds upon learning/leveling.", "6.65": " Reduced  agility gain from 2.5 to 2.0. Reduced  strength gain from 1.9 to 1.7. Increased  Eye of the Storm manacost from 100 to 100/150/200.", "6.68": " Reduced  Static Link cooldown from 45/40/35/30 to 35/30/25/20. Added  Aghanim's Scepter upgrade for Razor: Reduces  Eye of the Storm strike interval from 0.85/0.75/0.60 to 0.7/0.6/0.5 and makes it able to target structures. Does not reduce structure's armor.", "6.69": " Reduced  Plasma Field cooldown from 16 to 14.  Static Link Reduced link duration from 10 to 8. Increased attack damage drained per second from 5/10/15/20 to 7/14/21/28.", "6.52": " Storm Seeker Fixed not being able to affect the same area as  Sand Storm and  Rot at the same time. No longer ministuns Razor for 0.01 seconds upon learning/leveling.", "6.39": "  Storm Seeker no longer affects Roshan and ancient creeps.", "6.36b": " Increased  Chain Lightning damage from 75/150/225/290 to 75/150/225/300.", "6.78": " Increased  Unstable Current movement speed bonus from 3%/6%/9%/12% to 4%/8%/12%/16%.  Eye of the Storm Increased duration from 20/25/30 to 30 on each level. Reduced strike interval from 0.75/0.65/0.55 to 0.7/0.6/0.5. Reduced  Aghanim's Scepter upgraded  eye of the Storm from 0.65/0.55/0.45 to 0.55/0.45/0.35.", "6.75": "  Plasma Field Reduced minimum damage from 80/120/160/200 to 60/100/140/180. Increased maximum damage from 140/210/280/350 to 160/230/300/370.  Static Link No longer breaks if Razor loses vision of the target. Can no be targeted on the ground (doing so lauched the link in a line, which attaches itself to an enemy hero if it finds one within range). Can now be cast on spell immune enemies (ground targeted seeking already could target spell immune enemies). Increased  Unstable Current slow duration from 0.3/0.6/0.9/1.2 to 0.4/0.8/1.2/1.6.", "6.74": " Increased  Unstable Current damage from 40/60/80/100 to 40/70/100/130.", "6.76": " Reduced  Eye of the Storm strike interval from 0.85/0.75/0.6 to 0.75/0.65/0.55 Reduced  Aghanim's Scepter upgraded  Eye of the Storm strike interval from 0.7/0.6/0.5 to 0.65/0.55/0.45.", "6.70": "  Eye of the Storm Can now target ancient creeps (still can't target roshan). No longer ignores spell immune enemies.", "6.73": "  Static Link Increased damage duration after finishing draining from 13 to 18. Rescaled cooldown from 35/30/25/20 to 25.", "6.72": "  Plasma Field now hits invisible units.", "6.82c": " Increased  Static Link cooldown from 25 to 32/30/28/26. Increased  Aghanim's Scepter upgraded  Eye of the Storm strike interval from 0.55/0.45/0.35 to 0.6/0.5/0.4.", "6.81": " Increased  strength gain from 1.7 to 2.3. Increased  Unstable Current slow duration from 0.4/0.8/1.2/1.6 to 0.5/1/1.5/2.", "6.82": " Reduced  Plasma Field minimum damage from 60/100/140/180 to 30/50/70/90.  Static Link: No longer ignores  Linken's Sphere Increased manacost from 20/30/40/50 to 50.  Eye of the Storm no longer lingers through  Aegis of the Immortal reincarnation.", "6.84": "  Eye of the Storm damage is no longer reduced by Damage Block."}