{"6.08": " Increased  Backstab damage from 20%/40%/60%/80% to 25%/50%/75%/100% of agility.", "6.45": "  Smoke Screen no longer mini-stuns units within the area upon cast.", "6.81b": " Reduced  Smoke Screen cooldown from 13 to 11.", "6.68": " Increased base  agility from 24 to 34. Reduced base attack damage from 24-28 to 14-18 (total attack damage is still 48-52 because of the increased agility).", "6.03": " Rescaled  Smoke Screen movement speed slow from 10%/20%/30%/40% to 15%/20%/25%/30%.", "6.04": "  Smoke Screen Rescaled movement speed slow from 15%/20%/25%/30% to 20% on each level. No longer disarms enemies within. Now causes enemis within to miss 50%/60%/70%/80% of their attacks.  Blink Strike Now blinks closer to the target. Removed the 0.3 second delay on the damage.", "6.19": " Reduced  Permanent Invisibility fade time from 3.5/2.5/1.5 to 3/2/1.", "6.06": " Fixed  Blink Strike dealing no damage.", "6.07": " Fixed some memory leak issues with  Blink Strike.", "6.52": " Reduced cast point from unknown to 0.4", "6.05": " Removed the Backstab! floating text whenever  Backstab triggers.", "6.31": " Reduced  Smoke Screen duration from 7 to 6.", "6.00": " Removed Death Ward.  Permanent Invisibility Is now an ultimate ability (from first ability slot into the 4th). Increased level requirement from 5/10/15 to 6/12/16 like regular ultimates. Increased fade time from 3/2.3/1.6 to 3.5/2.5/1.5. Added a new ability,  Smoke Screen (takes first ability slot)", "6.35": " Increased base armor from 2 to 3 (total armor is now 3.36).", "6.02": "  Smoke Screen Increased manacost from 40/45/50/55 to 75/80/85/90. Increased cooldown from 11 to 17. Fixed interaction with  Nature's Attendants.", "6.72d": " Undid melee hero collision change from 6.72c", "6.55": "  Blink Strike now moves Riki behind the target, instead of infront.", "6.79": " Increased  Smoke Screen cast range from 425 to 550. Riki is no longer revealed out of  Permanent Invisibility when he casts spells or uses items. When he starts his attack from  Blink Strike, he will be revealed.", "6.78": " Reduced  Permanent Invisibility fade time from 3/2.25/1.5 to 3/2/1.", "6.51": "  Smoke Screen now mini-stuns units within the area upon cast again.", "6.72c": " Melee hero collision size now reduced from 24 to 12.", "6.10": "  Blink Strike Can now be cast on allied units. Slightly improved timing.", "6.17": "  Smoke Screen Reduced miss chance from 50%/60%/70%/80% to 40%/50%/60%/70%. Increased movement speed slow from 20% to 25%. Reduced radius from 300/350/400/450 to 300/325/350/400. Reduced cooldown from 17 to 15.", "6.73": " Increased  Backstab damage from 25%/50%/75%/100% to 50%/75%/100%/125% of agility.", "6.72": " Increased base health regeneration from 0.25 to 0.75. Increased attack range from 100 to 128.  Smoke Screen Increased cast range from 350 to 425. Reduced cooldown from 15 to 13. Reduced  Blink Strike cooldown from 30/20/10/5 to 20/15/10/5.", "6.58": "  Smoke Screen No longer mini-stuns units within the area upon cast. No longer destroys trees within the area upon cast. Changed  Backstab damage type from magical to physical.", "6.80": " Increased base health regeneration from 0.75 to 1.5.", "6.81": "  Backstab now works when attacking allied units.", "6.82": " Reduced base movement speed from 300 to 290. Reduced base attack damage from 14-18 to 4-8 (total attack damage is now 38-42). Reduced base health regeneration from 1.5 to 0.25. Reworked  Permanent Invisibility", "6.83": "  Blink Strike Increased max charges from 3/4/5 to 4/5/6. Increased charge restore time from 30 to 35. Rescaled damage from 50/70/90 to 40/70/100.", "6.84": "  Smoke Screen No longer ignores ancient creeps, Roshan and creep-heroes. No longer slows attack speed by 25. Now slows turn rate by 30%.", "6.27": " Increased base armor from 0 to 2 (total armor is now 5.36).", "6.24": " Reduced  Smoke Screen radius from 300/325/350/400 to 250/275/300/325.", "6.25": " Increased base  agility from 22 to 24.", "6.20": " Increased  Permanent Invisibility fade time from 3/2/1 to 3/2.25/1.5."}