{"6.66": " Fixed some  Dark Pact bugs.  Pounce The leash now gets removed if the target blinks or teleports away. Fixed Slark sometimes not attacking the leashed unit.  Essence Shift Fixed being able to kill units under the effect of  Shallow Grave. Fixed Essence Shift sometimes not registering attacks at high attack speed.  Shadow Dance passive movement speed and regen are now disabled by  Doom.", "6.67": " Fixed some more bugs on  Dark Pact.", "6.65": " Created.", "6.69": " Reduced base  agility from 21 to 15. Increased base attack damage from 27-35 to 33-41 (total attack damage is still 48-56 due to the agility reduction). Reduced  Dark Pact cooldown from 10 on each level to 10/9/8/7. Rescaled  Pounce damage from 50/75/100/125 to 40/80/120/160. Added to Captain's Mode.", "6.83b": " Reduced  Pounce damage from 55/110/165/220 to 50/100/150/200.", "6.79c": " Added to Captain's Mode.", "6.72d": " Undid melee hero collision change from 6.72c", "6.79": " Removed from Captain's Mode.  Shadow Dance Reduced duration from 5.5 to 4. Increased cooldown from 25 to 65. Can no longer be revealed by True Sight.", "6.78": "  Dark Pact can no longer dispel  Viper Strike.", "6.72b": "  Essence Shift no longer permanently steals attributes.", "6.72c": " Melee hero collision size now reduced from 24 to 12.", "6.75": " Reduced  Dark Pact cooldown from 10/9/8/7 to 9/8/7/6. Increased  Shadow Dance health regeneration bonus from 3%/4%/5% to 3%/5%/7%.", "6.77": " Increased base  agility from 15 to 21.", "6.71": " Fixed  Dark Pact not removing some debuffs properly. Reduced  Pounce cooldown from 16 to 12.", "6.70": "  Dark Pact Now deals the self damage in the same intervals as the damage after the effect delay, instant of all immediatly upon cast. Reduced effect delay from 2 to 1.5. Increased debuff phase from 0.5 to 1 second. Still deals damage and debuffs Slark in 0.1 second intervals, but now over 1 second, instead of 0.5. Adjusted damage per interval to stay the same overall.", "6.73": "  Pounce Increased damage from 40/80/120/160 to 70/140/210/280. Rescaled cooldown from 12 on each level to 20/16/12/8. Increased max distance from 400/500/600/700 to 700 on each level.  Shadow Dance Increased health regeneration bonus from 2%/3%/4% to 3%/4%/5% of max health. Reduced passive bonuses activation delay from 0.7 to 0.5.", "6.72": " Increased  strength from 1.0 to 1.8. Reduced  agility gain from 2.0 to 1.5. Increased  intelligence from 1.6 to 1.9. Fixed  Dark Pact not removing  Laser debuff.  Pounce No longer hits non-hero units. Increased latch radius from 85 to 95. Now leaps at a constant speed of 933.33, instead of needing 0.5 seconds for the whole distance on each level.  Essence Shift Now reduces each stat by 1 on attacks, instead of primary attribute by 2 and others by 1. Reduced agility gained per attack from 4 to 3. Increased duration from 15/30/45/60 to 15/30/60/120. Now reduces 1 of each attribute on enemies permanently and Slark gains 3 agility if he kills a hero.", "6.80": " Reduced  Pounce damage from 70/140/210/280 to 60/120/180/240. Reduced  Shadow Dance cooldown reduced from 65 to 60.", "6.82": " Slark is no longer revealed by  Chronosphere during  Shadow Dance.", "6.83": " Reduced  Pounce damage from 60/120/180/240 to 55/110/165/220.", "6.84": "  Dark Pact no longer ignores ancient creeps, Roshan and creep-heroes.", "6.66b": " Fixed  Dark Pact not removing some debuffs. Fixed  Essence Shift interaction with enemy transformation spells.", "6.70b": " Fixed  Essence Shift not working properly against  Tusk and  Phoenix."}