{"6.44": " Increased base  intelligence from 12 to 15.", "6.45": " Increased  agility gain from 2.4 to 2.9.", "6.60": " Replaced  Scattershot with  Shrapnel:", "6.61": " Increased  Take Aim attack range bonus from 55/110/165/220 to 65/130/195/260.", "6.41": "  Headshot can now proc on allied units again.", "6.64": " Increased  Shrapnel cast range from 900 to 1200.", "6.65": "  Shrapnel Reduced duration from 10 to 8. Reduced radius from 450 to 325.", "6.00": " Reduced movement speed from 300 to 290. Reduced  agility gain from 2.7 to 1.9. Increased  intelligence gain from 1.7 to 2.6. Increased attack projectile speed from 900 to instant. Reduced attack point from 0.7 to 0.17. Reworked  Scattershot", "6.01": " Reverted the  Scattershot rework from the last patch (temporarily).", "6.68": " Increased night vision from 800 to 1000.  Assassinate kills now grant Sniper experience, even when outside the experience radius.", "6.03": " Reduced attack projectile speed from instant to 3000 (instant was causing visual glitches). Restored the reworked  Scattershot Reduced damage per pellet from 15-60 to 14-40.", "6.17": " Increased base  agility from 21 to 26. Reduced base  intelligence from 16 to 12.", "6.52": "  Scattershot now provides flying vision within its area for a second.", "6.09b": " Fixed last hits made with  Scattershot not being registered by things like  Battle Hunger.", "6.31": "  Headshot can no longer proc on allied units. Increased  Assassinate cooldown from 30/15/5 to 30/20/10.", "6.56": " Reduced  Assassinate cooldown from 30/20/10 to 20/15/10.", "6.79": " Increased  Take Aim attack range bonus from 75/150/225/300 to 80/160/240/320.", "6.78": " Increased  Shrapnel radius from 360 to 400.", "6.50": " Reduced  Scattershot damage per pellet from 10-35 to 20-35.", "6.75": "  Shrapnel Increased radius from 350 to 360. Increased duration from 8 to 9. Increased  Headshot damage from 30/40/50/60 to 30/45/60/75. Increased  Take Aim attack range bonus from 65/130/195/260 to 75/150/225/300.", "6.74": " Increased  Headshot damage from 30/30/40/50 to 30/40/50/60.", "6.76": "  Shrapnel Now provides flying vision in the targeted area for its duration. Increased castrange from 1200 to 1800.  Headshot Attacks which proc can no longer miss to evasion or blind effects. Increased proc chance from 25%/30%/35%/40% to 40% on each level. Rescaled damage from 30/45/60/75 to 15/40/65/90. Increased stun duration from 0.01/0.1/0.2/0.2 to 0.25 on each level. Increased  Assassinate cast range from 1500/2000/2500 to 2000/2500/3000.", "6.71": " Increased  Shrapnel damage from 10/20/30/40 to 12/24/36/48.", "6.73": " Increased  Shrapnel radius from 325 to 350.", "6.80": " Increased  Take Aim attack range bonus from 80/160/240/320 to 100/200/300/400.", "6.81": " Fixed Sniper's acquisition range not matching his maximum attack range (Increased from 800 to 950). This affects his ability to auto attack units at his maximum range.", "6.82": "  Headshot now slows movement speed by 100% and attack speed by 100 for 0.5 seconds, instead of stunning for 0.25 seconds. Increased  Shrapnel radius from 400 to 450.", "6.83": "  Shrapnel No longer deals damage to buildings. Now has 3 charges with a 40 second replenish time, instead of a 15 second cooldown. Slow and damage of multiple casts no longer stack. Reduced manacost from 120 to 50. Increased duration from 9 to 10.", "6.84": " Reduced  agility gain from 2.9 to 2.5.  Shrapnel No longer ignores ancient creeps, Roshan and creep-heroes. Increased charge respawn time from 40 to 55. Increased effect delay from 0.8 to 1.4. Now starts giving vision after the effect delay, instead of instantly upon cast.  Headshot can now miss.  Reduced  Assassinate damage from 355/505/655 to 320/485/650.", "6.24": " Increased  Scattershot manacost from 75/90/105/120 to 120 on each level.", "6.20": " Increased base  agility and gain from 26 + 1.9 to 28 + 2.4. Reduced  damage per pellet from 14-40 to 10-35.", "6.28": " Reduced base  agility from 28 to 21. Reduced  Headshot stun duration from 0.01/0.1/0.2/0.25 to 0.01/0.1/0.2/0.2."}