{"6.44": " Created.", "6.45": " Rescaled  Electric Rave activation manacost from 10 on each level to 6/9/10/15. Increased Barrier cooldown from 15 to 20.  Overload no longer applies a dispel to hit enemy units. Increased  Lightning Grapple cast range from 600/900/1200 to 700/1050/1400.", "6.46": "  Lightning Grapple no longer pulls non-hero units.", "6.47": "  Electric Rave Fixed sometimes not stopping to drain mana after toggled off. Reduced activation manacost from 6/9/12/15 to 3/6/9/12.", "6.67": " Reduced attack range from 500 to 480.", "6.64": " Increased base  intelligence from 23 to 26.", "6.69": " Increased base  intelligence and gain from 26 + 2.6 to 23 + 2.2. Increased  Electric Vortex manacost from 100 on each level to 100/110/120/130.", "6.60": "  Electric Vortex is now blocked by  Linken's Sphere.", "6.72d": " Increased base  strength from 17 to 19. Fixed  Static Remnant triggering on some dummy units of spells.", "6.78": " Reduced  Electric Vortex cooldown from 20 to 21/20/19/18.", "6.58b": " Fixed a bug with  Overload.", "6.50": " Increased base armor from -1 to 3 (total armor is now 4.38). Fixed  Electric Rave toggling itself off when affected by  Last Word.  Overload no longer uses its charge up when attacking allied units.", "6.75": " Reduced  Static Remnant cooldown from 4 to 3.5.", "6.70": " Increased  intelligence gain from 2.2 to 2.6.", "6.73": " Increased  Overload damage from 30/45/60/75 to 30/50/70/90.", "6.58": " Reworked Storm Spirit. Reduced base  strength and gain from 22 + 2.5 to 17 + 1.5. Increased base  agility and gain from 17 + 1.5 to 22 + 1.8. Reduced attack range from 600 to 500. Reduced movement speed from 310 to 295. Replaced  Electric Rave with  Static Remnant", "6.59": "  Ball Lightning now gives an error message when cast without enough mana.", "6.80": " Reduced movement speed from 295 to 290.", "6.82": " Rescaled  Ball Lightning manacost per 100 traveled units from 10 + 1% to 12 + 0.7% of max mana.", "6.83": " Improved turn rate from 0.6 to 0.8.", "6.84": " Reduced movement speed from 290 to 285.  Static Remnant damage no longer ignores ancient creeps, Roshan and creep-heroes. Reduced  Ball Lightning vision range from 1000 to 400.", "6.44b": " Fixed  Overload attack counter counting wrong at high attack speeds. Fixed  Electric Rave from triggering  Essence Aura and  Curse of the Silent.", "6.46b": " Fixed a bug between  Lightning Grapple and  Aegis of the Immortal."}