{"6.46": " Fixed  Land Mines dealing less damage than intended. Fixed  Suicide Squad, Attack! damaging wards.", "6.41": "  Remote Mines no longer prevent neutral creeps from spawning. Increased  Detonate cooldown from 0 to 1.", "6.64": "  Remote Mines now automatically adds new placed mines to the player's curret selection group.", "6.00": " Reduced  Land Mines,  Suicide Squad, Attack! and  Detonate cast point from 0.3 to 0. Reduced  Stasis Trap cast point from 1.3 to 1.  Remote Mines Reduced cast point from 2.3 to 2. No longer destroys trees within its explosion radius. Fixed leaving a dummy unit for few seconds after exploding.", "6.68": "  Remote Mines now also detonate when killed.", "6.69": " Increased base attack damage from 2-4 to 7-9 (total attack damage is now 29-31).  Remote Mines New placed mines are no longer automatically added to the selection group. Reduced cast time from 2 to 1.5. Added a new sub ability,  Focused Detonate, that allows Techies to detonate remote mines within a 700 radius selected area. Has a global cast range and can be cast through the minimap. Fixed some cast mechanism issues with  Suicide Squad, Attack!.", "6.60": " Added  Aghanim's Scepter for Techies. Increases  Remote Mines damage from 300/450/600 too 450/600/750 and cast range from 500 to 900.", "6.05": " Reduced attack backswing from unknown to 0.5. Fixed  Remote Mines damage type being physical instead of magical.", "6.09b": " Increased attack range from 600 to 650.", "6.32": " Fixed Detonate triggering  Essence Aura.", "6.37": "  Land Mines now provide 64 radius vision around them (this makes them visible on the minimap for Techies and their team).", "6.73b": " Fixed  Land Mines not triggering on  Skywrath Mage.", "6.19": "  Remote Mines and  Stasis Trap no longer have collision size (can't block units anymore).", "6.03": " Fixed Techies not gaining the  Detonate ability. Fixed  Remote Mines' detonate not working. Reduced  Detonate manacost from 50 to 0.", "6.72b": "  Remote Mines now provide 500 radius flying vision for 3 seconds after detonating.", "6.50": " Fixed  Land Mines to properly detect floating units (e.g.  Lich,  Lina etc).", "6.75": " Increased base armor from -1 to 5(total armor is now 6.96). Reduced  Land Mines cooldown from 25/20/15/12 to 25/20/15/10.", "6.74": " Increased attack range from 650 to 700.", "6.17": " Reduced  Stasis Trap duration on non-heroes from 5/7/10/13 to 3/4/5/6 (matches hero duration now).", "6.68b": " Fixed a major bug with  Remote Mines.", "6.72": " Increased  Land Mines max limit from 15 to 20.  Suicide Squad, Attack! Now gives Techies experience for kills he gets with it. Now reduces Techies' respawn time by 50% when dying to suicide. Increased cooldown 75 on each level to 180/170/160/150. Removed Detonate all sub-ability. Reduced  Aghanim's Scepter upgraded  Remote Mines cast range from 900 to 700.", "6.82": "  Land Mines Can no longer trigger on and damage flying units ( Batrider in  Firefly,  Visage's Familiars,  Beastmaster's Hawk, and Flying Couriers). Changed damage type from composite to physical. Reduced damage from 300/400/500/600 to 225/300/375/450. Reduced cooldown from 25/20/15/10 to 19/16/13/10.  Stasis Trap Increased trigger radius from 200 to 450 (matches stun radius now). Increased trap duration 270/300/330/360 to 360 on each level (from 4.5/5/5.5/6 to 6 minutes). Reduced stun duration from 3/4/5/6 to 2.5/3/3.5/4.  Suicide Squad, Attack! Changed damage type from composite to physical. Reduced damage from 650/850/1150/1550 (350/400/450/500 partial) to 500/650/850/1150 (260/300/340/380 partial).  Remote Mines Reduced vision radius from 900 to 700. Increased damage radius from 400/410/425 to 425. Increased mine duration from 480 to 600 (from 8 to 10 minutes).", "6.83": " Added to Captain's Mode. Increased  Land Mines damage from 225/300/375/450 to 300/375/450/525.", "6.84": " Reduced  Land Mines activation delay from 1.75 to 0.5.  Stasis Trap Reduced activation delay from 2 to 1.5. Reduced detonation delay from 2 to 1.5.  Suicide Squad, Attack! No longer ignores ancient creeps, Roshan and creep-heroes. Damage is no longer reduced by Damage Block. Reduced cooldown from 180/170/160/150 to 160/140/120/100.  Minefield Sign Increased cooldown from 120 to 360. Reduced cast range from 500 to 10. Now has a 175 radius area of effect. Now has a limited duration of 180 seconds.  Aghanim's Scepter now causes  Minefield Sign to turn all Land Mines, Stasis Traps and Remotes Mines within the radius of the Minefield Sign immune to True Sight.", "6.26": " Reduced base movement speed from 280 to 270.", "6.27b": " Increased  Suicide Squad, Attack! cooldown from 60 to 75.", "6.70b": " Fixed  Land Mines not triggering on  Phoenix."}