{"6.44": " Created.", "6.81": " Reduced  Trap cast time from 0.3 to 0 and it no longer interrupts Templar Assassin's channeling spells.", "6.82": " Reduced  Psionic Trap cooldown from 11/9/7 to 11/8/5.  Psi Blades spill damage now hits spell immune units.", "6.44b": " Fixed some issues with  Meld. Fixed various spells from affected  Psionic Traps.", "6.84": "  Meld Damage is no longer reduced by Damage Block. Reduced cooldown from 7 to 6.", "6.64": "  Psionic Trap now automatically adds placed traps to the player's current selection group.", "6.63": " Increased  strength gain from 1.7 to 2.1.", "6.75": "  Psi Blades no longer spill damage when attacking illusions.", "6.74": " Increased  Psi Blades attack range bonus from 40/100/160/220 to 60/120/180/240.", "6.77": " Increased  Refraction manacost from 75 to 100.", "6.76": "  Psionic Trap now requires a buildup time to reach its maximum slow. Starts at 30% and increases by 5% each second until it reaches 50%.", "6.70": " Increased base attack damage from 22-32 to 31-36. (total attack damage is now 53-59).", "6.73": " Increased  Refraction number of instances from 2/3/4/5 to 3/4/5/6.", "6.72": " Increased  Psi Blades spill width from 70 to 80.", "6.45": " Increased attack range from 130 to 140. Increased base  intelligence from 18 to 20.  Refraction Reduced number of instances from 3/4/5/6 to 2/3/4/5. Increased attack damage bonus from 15/30/45/60 to 20/40/60/80. Increased cooldown from 20 to 23.  Meld Reduced manacost from 100 to 50. Reduced cooldown from 12 to 7. Reduced  Psionic Trap cooldown from 10 to 7.", "6.55": " Reduced  Psionic Trap cooldown from 14 on each level to 11/9/7.", "6.60": "  Refraction Reduced duration from 20 to 17. Reduced cooldown from 23 to 17. Reduced cast time from 0.3 to 0.  Psi Blades Rescaled attack range bonus from 50/100/150/200 to 40/100/160/220. Increased spill range from 80/160/240/320 to 320 on each level.", "6.50": "  Psi Blades Increased attack range bonus from 40/80/120/160 to 50/100/150/200. Increased spill range from 60/120/180/240 to 80/160/240/320. Increased spill width from unknown to 70. Increased  Psionic Trap cooldown from 7 to 14.", "6.58": " Increased turn rate from unknown to 0.7.", "6.68": " Increased  Psi Blades spill range from 320 on each level to 320/340/360/380."}