{"6.45": " Increased  Laser manacost from 95/110/120/145 to 95/120/145/170.", "6.60": "  Rearm can no longer refresh  Black King Bar.", "6.43": "  Rearm can no longer refresh Arcane Ring.", "6.00": "  Heat-Seeking Missile Increased number of targets from 1 on each level to 1/1/2/2. Reduced damage from 110/220/330/440 to 100/175/250/325. Reduced manacost from 130/160/190/220 to 120/140/160/180. Reduced cooldown from 35 to 25. Reduced  Rearm rearm time from 5/3/1 to 3/2/1.", "6.68": " Increased base armor from 1 to 2 (total armor is now 3.82).", "6.69": "  Laser Now only blinds the target, instead of blinding within a 200 radius. Increased blind miss chance from 10%/15%/20%/25% to 100% Reduced blind duration from 9 (18 on non-heroes) to 2.", "6.04": " Tinker can now buy  Manta Style again (since recasting it destroys previous illusions). Tinker can no longer buy  Necronomicon. Increased  March of the Machines manacost from 135/150/165/180 to 145/150/165/190.", "6.35": " Increased movement speed from 285 to 305. Increased base  intelligence from 21 to 27.", "6.19b": " Increased  Rearm manacost from 150/200/250 to 150/225/300.", "6.03b": "  March of the Machines Reduced cast time from 3.53 to 0.53. Reduced cast range from 400 to 300.", "6.03": " Tinker can no longer buy  Manta Style and  Hand of Midas.  March of the Machines Increased cast time from 0.53 to 3.53. Increased cast range from 300 to 400. Now sends the robots on its own for 5 seconds, instead of requiring channeling. Increased robots speed from 300 to 400.", "6.74": " Increased  March of the Machines duration from 5 to 6.", "6.17": "  Rearm No longer disables Tinker for the rearm time. Can now be interrupted. Increased manacost from 125/150/175 to 150/200/250.", "6.73": " Increased  Laser blind duration from 2 to 3.", "6.72": " Increased  Heat Seeking Missile number of rockets from 1/1/2/2 to 2 on each level.", "5.78": " Reduced  Laser cooldown from 9 to 5.", "5.79": " Reduced  Laser cooldown from 5 to 1.", "6.15": " Increased attack range from 500 to 550.", "5.76": " Created.", "5.77": "  Heat-Seeking Missile Increased manacost from 125/135/150/175 to 130/160/190/220. Increased cooldown from 25 to 35.", "6.80": " Added  Aghanim's Scepter for Tinker: Increases  Laser cast range from 550 to 1100 and  Heat-Seeking Missile rocket count from 2 to 4.", "6.81": "  Laser no longer uses a projectile for the blind and applies it instantly upon cast.  Heat Seeking Missile damage is no longer blocked by ethereal.", "6.82": " Changed  March of the Machines damage type from universal to magical As a result, it no longer affects spell immune ancient creeps.", "6.83": " Increased  Heat Seeking Missile damage from 100/175/250/325 to 125/200/275/350.", "6.84": " Increased  Laser hero blind duration from 3 on each level to 3/3.5/4/4.5. Reduced  Rearm manacost from 150/250/350 to 125/225/325.  Aghanim's Scepter upgraded  Laser No longer increases cast range from 550 to 1100. Now causes it to bounce to enemy heroes with a 550 radius around the target.", "6.26": "  Rearm can no longer refresh  Refresher Orb.", "6.25": " Reduced  intelligence gain from 3 to 2.2. Tinker can now buy  Hand of Midas and  Necronomicon.  Rearm can no longer refresh Hand of Midas, Necronomicon and  Helm of the Dominator.", "6.22": " Reduced base  strength from 19 to 17. Reduced attack range from 550 to 500. Reduced movement speed from 290 to 285.  Rearm Reduced channel time from 4/3/2 to 3/2/1. Increased manacost from 150/225/300 to 150/250/350.", "5.80": "  Laser Increased damage from 60/120/180/240 to 80/160/240/320. Increased manacost from 95/105/120/135 to 95/110/120/145. Increased cooldown from 1 to 14.", "6.20": " Increased  Rearm channel time from 3/2/1 to 4/3/2.", "5.84b": " Increased movement speed from unknown to 290.", "6.04b": " Increased  March of the Machines damage from 8/16/24/40 to 12/24/32/40."}