{"6.63": " Increased attack range from 100 to 128. Fixed Eyes in the Forest vision not scaling.", "6.60": " Reworked Eyes in the Forest:", "6.61": " Treant Protector now can cast spells and use items without breaking the invisibility of  Nature's Guise. Increased Eyes in the Forest cast range from 100 to 125. Fixed  Living Armor not regenerating buildings' health.", "6.67": " Removed from Captain's Mode. Replaced Eyes in the Forest with Forest Sentinel", "6.45": " Increased Eyes in the Forest cast range from 100 to 2000 (still requires vision over trees to be able to cast it on them).  Living Armor Reduced manacost from 40/45/50/55 to 30/35/40/40. Increased armor bonus from 2/4/7/10 to 3/6/9/12. Increased health regeneration bonus from 0.75/1.5/2.25/3 to 1/2/3/4.  Overgrowth Now affects unit insde the Fog of War. Reduced manacost from 200/250/300 to 150/175/200.", "6.81b": " Reduced  Leech Seed damage per pulse from 24/36/48/60 to 15/30/45/60.", "6.77c": "  Living Armor Now reduces damage from all instances of damage that reduce its charges, instead of only physical damage. Now also reduces damage from non-heroes.", "5.65": " Created.", "6.35": " Increased armor from 0 to 1 (total armor is now 2.4).  Nature's Guise no longer considers dead trees.", "6.38": " Reduced Eyes in the Forest manacost from 100 to 100/75/50/25.", "6.72d": " Increased base  strength and gain from 27 + 3.4 to 25 + 2.8. Increased  Overgrowth cooldown from 100/95/90 to 115/105/95. Undid melee hero collision change from 6.72c", "6.76": " Increased  Strength gain from 2.8 to 3.3. Increased  Living Armor health regen from 4/6/8/10 to 4/7/10/13.", "6.79": " Reduced night vision from 1200 to 800.  Leech Seed Reduced damage per pulse from 30/45/60/75 to 24/36/48/60. Increased number of pulses from 4 to 6 (duration from 3 to 4.5).  Living Armor Increased Manacost increased from 25 to 50. Increased cooldown from 15 on each level to 32/26/20/14. Reduced  Nature's Guise cast time from 0.5 to 0.3.", "6.78": "  Leech Seed Healing effect no longer ends when the target dies. Increased movement speed slow from 24% to 28%.", "6.72b": " Reduced base armor from 0 to -1 (total armor is now 1.1). Increased  Leech Seed cooldown from 12 to 18/16/14/12.  Living Armor now affects buildings only in a 900 radius.", "6.72c": "  Nature's Guise now has a 2 second fade time. Reduced  Living Armor regeneration from 2/3/4/5 to 1/2/3/4. Reduced  Overgrowth radius from 725 to 625. Melee hero collision size now reduced from 24 to 12.", "6.75": " Increased attack damage 32-40 to 46-54 (total damage is now 71-79). Increased Base Attack Time from 1.7 to 1.9. Reworked  Living Armor", "6.77": " Increased base attack damage from 46-54 to 56-64 (total attack damage is now 81-89). Reduced  Leech Seed cooldown from 18/16/14/12 to 16/14/12/10.  Living Armor can now be cast through the minimap (only considers heroes, towers and barracks in this mode). Increased block instances from 6 to 7. Reduced  Overgrowth cooldown from 80 to 70.", "6.76c": "  Living Armor Reduced cooldown 20 to 15. Reduced manacost from 30/35/40/45 to 25. Reduced duration from 20 to 15.", "6.70": " Increased  Living Armor regeneration from 1/2/3/4 to 2/3/4/5.", "6.73": " Increased  Leech Seed manacost from 110/120/130/140 to 140 on each level. Reduced  Overgrowth damage per second from 70/100/130 to 50/75/100. Added to Captain's Mode.", "6.72": " Reduced base armor from 1 to 0 (total armor is now 0.1).  Nature's Guise Now increases the target's movement speed by 10%. Now keeps the target invisible for up to 1 second after leaving the proximity of a tree, except during the initial cast. Increased cooldown from 3 on each level to 10/8/6/4. Replaced Forest Sentinel with  Leech Seed", "5.78": " Rescaled Eyes in the Forest cooldown from 200/140/110/80 to 240/140/110/60. Reduced  Nature's Guise cooldown from 20/17/15/10 to 3 on each level.  Overgrowth Increased radius from 625 to 925. Increased damage per second from 50 to 125.", "5.79": "  Overgrowth Reduced radius from 925 to 725. Reduced damage per second from 125 to 85.", "5.72": " Increased base  strength and gain from 25 + 3.2 to 27 + 3.4. Reduced base  intelligence and gain from 19 + 2 to 17 + 1.8.  Nature's Guise Rescaled manacost from 50/60/70/80 to 90/80/70/60. Increased cooldown from 10 on each level to 20/17/15/10. Eyes in the Forest Reduced level requirement from 4/6/8/10 to 1/3/5/7. Increased cooldown from 210/180/150/120 to 240/180/150/120. Replaced Passion of the Forest with Overgrowth", "6.58": "  Living Armor can now be cast on buildings.", "5.75": " Reduced Eyes in the Forest cooldown from 240/180/150/120 to 200/140/110/80. Overgrowth Now deals 50 damage per second within a 150 radius, instead of 50 damage within 100 radius, 35 damage within 125 radius and 10 damage within 150 radius. Reduced cast tome from 1.5 to 0.5 Reduced cooldown from 90/60/30 to 15 on each level.", "5.76": " Reworked Overgrowth", "6.80": " Increased  Nature's Guise cast range from 300 to 600. Increased  Overgrowth radius from 625 to 675.", "6.82": " Reduced  Nature's Guise manacost from 90/80/70/60 to 60 on each level. Added  Aghanim's Scepter upgrade for Treant Protector: Grants a new ability:  Eyes in the Forest", "6.83": "  Living Armor is now castable on spell immune allies.  Eyes in the Forest Increased Overgrowth damage per second from 135 to 175. Reduced cooldown from 55 to 25.", "6.84": " Reduced  Eyes in the Forest radius from 800 to 700.", "6.78c": " Reduced  Living Armor block instances from 7 on each level to 4/5/6/7.", "5.84": " Reduced  Nature's Guise duration from 30/45/60/75 to 15/30/45/60. Increased  Overgrowth cooldown from 120 to 180.", "6.24": " Increased Eyes in the Forest cooldown from 240/140/110/60 to 300/225/150/75.", "6.20": " Increased  Overgrowth manacost from 100/150/200 to 200/250/300.", "6.21": " Increased Eyes in the Forest manacost from 50 to 100.", "6.10": " Fixed some leaks on  Overgrowth.", "6.48b": " Increased base  agility and gain from 10 + 1 to 15 + 2."}