{"6.44": "  Berserker's Rage no longer costs 50 mana to toggle.", "6.63": " Increased  Battle Trance attacks speed bonus from 60/80/100 to 60/100/140.", "6.60": " Blind Increased miss chance from 15%/24%/33%/42% to 20%/28%/36%/44%. Increased cooldown from 8 on each level to 15/12/9/6. Reworked  Fervor", "6.67": "  Berserker's Rage Increased bash proc chance from 5%/5%/10%/10% to 10% on each level. Rescaled bash damage from 25/50/25/50 to 20/30/40/50. Reduced bash stun duration from 2 on each level to 0.8/1.2/1.6/2.", "6.42": " Increased  Berserker's Rage movement speed bonus from 20 on each level to 20/20/20/30.", "6.09": " Changed Blind legacy hotkey from B to D. Changed Fervor legacy key from E to F.", "6.00": " Increased  Berserker's Rage level requirement form 0/2/4/6 to 1/3/5/7.", "6.69": " Increased  Battle Trance duration on self from 8 to 10.", "5.52": " Reduced attack range from 525 to 500. Reduced  Rampage movement speed bonus from 25%/50%/75% to 7%/14%/21%.", "5.60": "  Berserker's Rage Reduced transformation time from 0.2 to 0.1. Reduced manacost from 125/80/40/0 to 50 on each level. Reduced bash proc chance from 20% on each level to 5%/5%/10%/15%. Rescaled bash damage from 35 on each level to 50/35/35/35. Reduced bash stun duration from 2 on each level to 0.1/2/2/2.", "5.65": "  Berserker's Rage Reduced bash proc chance from 5%/5%/10%/15% to 5%/5%/10%/10%. Rescaled bash damage from 50/35/35/35 to 50/25/25/50.", "5.53": " Reduced base attack damage from 9-30 to 6-27 (total attack damage is now 27-48). Reduced  Berserker's Rage attack damage bonus from 31 to 26. Reduced  Rampage attack speed bonus from 50/100/150 to 40/80/120.", "5.41-5.50": " Reduced  strength gain from 2 to 1.6. Reduced base attack damage from 11-32 to 9-30 (total attack damage is now 30-51). Reduced attack range from 550 to 525.  Berserker's Rage Reduced level requirement from 1/3/5/7 to 0/2/4/6. Increased attack damage bonus from 16 to 31. Reduced health bonus from 100 to 75. Reduced Blind manacost from 40/49/58/67 to 40 on each level.", "6.50": " Increased base movement speed from 285 to 300.  Rampage Reduced movement speed bonus from 7%/9%/11% to 5%/7%/9%. Reduced cooldown from 90/80/70 to 55 on each level. Reduced manacost from 100/150/205 to 100/150/200. Can no longer be dispelled. Increased cast point from 0 to 0.3. No longer ignores cast backswing. Now interrupts channeling spells upon cast.", "6.35": " Increased base attack damage from 6-29 to 17-35 (total damage is now 38-56).  Berserker's Rage Rescaled attack damage bonus from 27-12 to 15-15. Increased armor bonus from 2 to 3.", "6.34": "  Berserker's Rage Now increases movement speed by 20 on each level. Now increases armor by 2 on each level.", "6.39": " Increased base movement speed from 280 to 285.", "5.40": " Created.", "6.57": " Increased  Fervor radius from 300 to 600.", "6.55": "  Rampage now interrupts channeling spells upon cast.", "5.55": "  Berserker's Rage Now also grants 3 armor. Increases health bonus from 75 to 100. Reduced  Fervor radius from 900 to 300.", "6.79": " Increased  Berserker's Rage movement speed bonus from 20/20/20/30 to 10/20/30/40. Reduced  Whirling Axes (Melee) damage from 125/175/225/275 to 75/125/175/225.", "6.78": "  Battle Trance Increased cooldown from 20 to 30. Reduced duration from 10 to 7.", "6.72c": "  Whirling Axes (Ranged) now deals 75 damage.  Fervor Increased attack speed bonus per stack from 5/10/15/20 to 20 on each level. Rescaled max stacks cap from 20/10/7/5 to 2/3/4/5. Melee hero collision size now reduced from 24 to 12.", "6.75": " Increased  Battle Trance duration on allies from 5 to 10 (same duration as for Troll Warlord).", "6.74": " Increased  Battle Trance attack speed bonus from 60/100/140 to 60/120/180.", "6.17": " Reduced base  strength from 19 to 17.", "6.73": "  Fervor now also works against buildings.", "6.72": "  Berserker's Rage no longer uses a 0.1 second transformation time. Replaced Blind with Whirling Axes", "5.58": " Increased base  strength and gain from 18 + 1.6 to 19 + 2.45. Reduced base  intelligence from 15 to 13. Increased base attack damage from 6-27 to 6-29 (total attack damage is now 27-50). Reduced base armor from 0 to -1 (total armor is now 1.94).  Berserker's Rage Now grants a 20% chance to bash for 35 damage and 2 second stun when in melee form. Rescaled attack damage bonus from 26-26 to 27-12 Blind Reduced manacost from 40 to 20. Reduced cooldown from 10 to 8.", "6.29b": "  Berserker's Rage no longer increases armor by 3.", "6.80": "  Fervor Rescaled attack speed bonus per stack from 20 on each level to 16/22/28/34. Rescaled max stacks cap from 2/3/4/5 to 4 on each level.", "6.81": " Reduced  Whirling Axes (Melee) cast point from 0.2 to 0.", "6.82": " Reduced  Whirling Axes (Ranged) cooldown from 20 to 20/19/18/17. Increased acquisition range from 600 to 800. This affects autoattack range. He now uses the same range as other ranged heroes.", "6.84": " Troll Warlord is no longer restricted from buying  Skull Basher and  Abyssal Blade (their bashes are still disabled on Troll Warlord).  Berserker's Rage No longer provides 15 attack damage bonus. Is no longer deactivated upon death.  Whirling Axes (Ranged) no longer provides 800 radius vision for 3 seconds along the path.  Whirling Axes (Melee) no longer provides 500 radius vision around the axes. Reduced  Battle Trance duration from 7 to 5.", "6.50b": "  Rampage Increased manacost from 100/150/200 to 100/150/205. Reduced cast point from 0.3 to 0. Now ignores cast backswing. No longer interrupts channeling spells upon cast.", "6.25": "  Berserker's Rage now reduces base attack time from 1.7 to 1.55 while active.", "6.20": "  Berserker's Rage Rescaled bash damage from 50/25/25/50 to 25/50/25/50. Increased bash stun duration from 0.1/2/2/2 to 2 on each level. Reduced  Rampage movement speed bonus from 7%/14%/21% to 7%/9%/11%.", "6.21": " Reduced  strength gain from 2.45 to 2.2.", "6.72d": " Undid melee hero collision change from 6.72c"}