{"6.80": "  Snowball Secondary units hit by the Snowball now take the same impact as the primary unit.  Walrus Punch No longer deals 400% crit to targets below 50% health. It now always deals the base crit. Increased base critical damage from 300% to 350%.", "6.81": "  Snowball Converted to two-part ability. Main to begin rolling in-place, sub-ability to launch. Will automatically launch 4 seconds after using the main ability. Reduced gather range from 200 + 40 per second to 100. Can now manually add allied units within 400 radius to the snowball by right-clicking them Each allied hero inside the Snowball now increases its damage by 20/30/40/50. Each allied hero inside the Snowball now increases its speed by 100. Base damage of 80/120/160/200 and base speed of 150% of Tusk's movement speed still stay.", "6.82": "  Ice Shards No longer stops when it hits a hero. Now travels until reaching the cast location and creates its shards there. Increased cast range from 1500 to 1800. No longer destroys trees.  Snowball Increased bonus speed per hero from 75 to 100. Allies can now click in the snowball to jump into it.", "6.83": "  Ice Shards Increased projectile speed from 900 to 1100. Increased shard duration from 5 to 7 seconds.  Walrus Punch is now an enemy target ability, and is auto-castable. Reduced cooldown from 25/20/15 to 20/16/12.", "6.84": "  Ice Shards Reduced manacost from 120 to 90. Reduced cooldown from 18/16/14/12 to 19/16/13/10. Increased vision duration from 0.5 to 2.  Snowball Now travels at a constant speed of 675, instead of 150% of Tusk's speed + 100 per gathered hero. No longer automatically gathers units within a 100 radius upon cast. Tusk can now add allies to Snowball while it is moving (allies can jump in by themselves as well while it travels). Added  Aghanim's Scepter Upgrade for Tusk: Grants Tusk the  Walrus Kick ability.", "6.78": " Reduced  Snowball cooldown from 24 to 21.", "6.72c": " Melee hero collision size now reduced from 24 to 12.", "6.81b": " Reduced  Snowball cooldown from 21 to 21/20/19/18. Reduced  Walrus Punch cooldown from 30/24/18 to 25/20/15.", "6.71": "  Snowball Reduced maximum roll duration from 3.25 to 3. Reduced Movement speed bonus per extra hero from 100% to 50%. Reduced  Frozen Sigil health from 300 to 220/240/260/280. Removed the 75/150/225 landing damage from  Walrus Punch.", "6.70": " Created.", "6.73": "  Snowball cooldown decreased from 40 to 28. Added to Captain's Mode.", "6.72": "  Ice Shards now destroy trees around the area they are created.  Snowball no longer moves faster based on the allies inside of it. Added -disablehelp support for  Snowball.", "6.75": "  Snowball Can now carry all Tusk's controlled units as well. Reduced Cooldown from 28 to 24. Increased  Walrus Punch crit damage from 250% to 300% for above 50% health targets.", "6.79": "  Frozen Sigil now requires 3/3/4/4 attacks to be destroyed, instead of having 200/220/240/260 health (heroes hurt it for 1, others for 0.25).", "6.70b": "  Snowball Reduced maximum roll duration from 4 to 3.25. No longer dispels debuffs on Tusk and his allies while rolling.  Walrus Punch Increased Cooldown from 18/16/14 to 30/24/18. Landing damage reduced from 100/200/300 to 75/150/225. Reduced crit damage from 250% to 225%.", "6.72d": "  Walrus Punch crit restored back to 250% (from 225%) for above 50% health targets. Undid melee hero collision change from 6.72c"}