{"6.44": " Fixed some memory leak issues on  Poison Nova.", "6.09": " Fixed  Poison Nova dummies of the first cast not disappearing when casting again before the first cast finished. Venomancer is now allowed to build  Refresher Orb again (debuff of Poison Nova still doesnt stack though).", "6.67": " Increased  Poison Nova duration from 12 to 12/14/15. Increased  Aghanim's Scepter upgraded  Poison Nova duration from 12 to 14/15/16.", "6.42": "  Plague Ward Reduced gold bounty from unknown to 3-9. Reduced manacost from 25 to 20. Reduced cooldown from 6 to 5.", "6.00": " Reduced cast time of all spells from 0.5 to 0. Recoded  Poison Nova to fix various bugs. No longer slows affected units by 10%. Multiple instances now work properly. Now properly hits all units within range. No longer randomly deals damage to units while passing through them.", "6.68": " Increased  Poison Sting movement speed slow from 10% on each level to 11%/12%/13%/14%.", "6.69": " Increased  Plague Ward gold bounty from 3-9 to 14-17.", "6.06": " Venomancer is no longer allowed to build  Refresher Orb (disabled because of bugs)", "6.07": " Reduced  Poison Nova radius from unknown to 575.", "6.79c": " Reduced movement speed from 290 to 285. Reduced  Plague Ward vision from 1200/1200 to 1200/800", "6.35": " Fixed  Poison Sting slowing attack speed, instead of movement speed.", "6.03b": " Fixed  Poison Nova dummies being selectable (and able to build night elf buildings).", "6.10": "  Poison Nova Reduced damage per second from 62/100/138 to 36/58/81. Increased duration from 7 to 12.  Aghanim's Scepter upgraded  Poison Nova Reduced damage per second from 100/138/185 to 58/81/108 Increased duration from 7 to 12.", "6.79": "  Venomous Gale No longer ignores its cast backswing. No longer ignores invisible units and units in the fog of war. Rescaled damage over time from 15/30/45/60 to 0/30/60/90.  Poison Sting Increased duration from 6/8/10/12 to 6/9/12/15. Damage no longer dispels consumables or  Blink Dagger.  Plague Ward Wards now have Poison Sting for 50% of the damage at the current level When Venomancer and a Plague Ward attack the same target, the one with the stronger damage over time is applied. Increased experience bounty from 12/12/25/25 to 20/25/30/35.  Poison Nova no longer ignores invisible units and units in the fog of war.", "6.78": " Increased  Poison Sting duration from 6/7/8/9 to 6/8/10/12.", "6.75": " Reduced  Plague Ward vision from 1400/1400 to 1200/1200.", "6.02": " Reduced  Poison Nova radius form unknown to unknown.", "6.76": "  Venomous Gale Rescaled manacost from 90/105/120/135 to 125 on each level. Reduced initial damage from 50/70/70/100 to 25/50/75/100. Increased damage over time from 10/20/40/50 to 15/30/45/60. Rescaled  Poison Sting duration from 7 on each level to 6/7/8/9.", "6.17": " Reduced movement speed from 300 to 295.", "6.15": " Reduced  Plague Ward manacost from 25/25/30/35 to 25 on each level.", "6.72": " Increased Base health regeneration from 0.25 to 0.75.", "6.58": " Replaced  Shadow Strike with  Venomous Gale", "6.80": " Reduced base attack damage from 24-26 to 19-21 (total attack damage is now 41-43). Reduced base health regeneration from 0.75 to 0.25.", "6.82": "  Poison Nova can now place its debuff on spell immune enemies.", "6.84": " Increased  Venomous Gale damage over time from 0/30/60/90 to 10/40/70/100.", "6.25": " Reduced movement speed from 295 to 290.", "6.20": " Reduced attack range from 490 to 450. Fixed some bugs on  Poison Nova."}