{"6.44": " Enemy heroes affected by  Shadow Word can now be denied when their health drops below 25%.", "6.45": "  Shadow Word Changed damagetype from Pure to Magical. Increased damage per second from 8/16/24/32 to 10/20/30/40.", "6.60": "  Shadow Word is now properly blocked by  Linken's Sphere.", "6.66": "  Fatal Bonds Reduced number of units bonded from 5 on eachlevel to 2/3/4/5. Increased shared damage from 3.75%/7.5%/11.25%/15% to 15% on each level.", "6.41": " Fixed interaction between  Fatal Bonds and  Marksmanship.", "6.64": " Fixed  Upheaval slowing around Warlock, instead of at the targeted area.", "6.65": " Increased  Upheaval cooldown from 20 to 65.", "6.68": " Reduced  Fatal Bonds cooldown from 30 to 25. Added  Aghanim's Scepter upgrade for Warlock: Causes  Chaotic Offering to spawn 2 golems, instead of one, witha 0.3 second delay between each other. Each golem deals aoe damage and stun upon spawning. Reduces Warlock's Golems's health from 900/1200/1500 to 450/600/750. Reduces Warlock's Golems's attack damage from 50/75/100 to 26/38/51. Reduces Warlock's Golems's gold bounty from 100/150/200 to 50/75/100.", "6.69": " Increased Warlock's Golems movement speed from 320/330/340 to 320/340/360.  Permanent Immolation from multiple golems now stack.", "6.42": " Enabled in Captain's Mode and Random Draft.", "6.36": " Created.", "6.39": " Reduced movement speed from 305 to 295. Fixed  Fatal Bonds status debuff icon not showing on illusions.  Shadow Word Fixed status buff/debuff icon not showing on illusions. Reduced cast range from 600 to 500. Reduced damage per second from 9/18/27/36 to 8/16/24/32. Increased cooldown from 22 to 24. Increased  Chaotic Offering cooldown from 130 to 165.", "6.38": " Increased  Shadow Word cooldown from 17 to 22.", "6.36b": "  Fatal Bonds Added a visible status debuff icon. Reduced shared damage from 6%/12%/18%/24% to 5%/10%/15%/20%. Reduced  Shadow Word damage per second from 10/20/30/40 to 9/18/27/36. Warlock's Golems Reduced health from 100/1600/2200 to 900/1400/1800 Reduced armor from 5/10/15 to 5/7/10.", "6.79": "  Fatal Bonds now links the closest units to the initial target, instead of randomly choosing targets in its radius.  Shadow Word no longer ignores its cast backswing.  Upheaval: Increased cast range from 700 to 1200. Increased max channel time from 10 to 12.  Chaotic Offering No longer deals 100  200) impact damage. Increased Warlock's Golems armor from 5/7/10 to 6/9/12. Increased manacost from 200/250/300 to 200/300/400.", "6.52": "  Fatal Bonds Changed damage type from unknown to HP Removal. Reduced shared damage from 5%/10%/15%/20% to 3.75%/7.5%/11.25%/15%.", "6.72c": " Reduced  Shadow Word cooldown from 24 to 20.", "6.75": " Increased  Shadow Word damage/heal per second from 10/20/30/40 to 15/25/35/45.", "6.74": " Increased  Shadow Word duration from 8 to 9. Increased  Permanent Immolation damage per second from 20/30/40 to 30/40/50.", "6.77": " Reduced  Shadow Word cooldown from 20 to 16.", "6.76": " Increased Warlock's Golems attack damage from 50/75/100 ( 38/56/75) to 75/100/125 ( 56/75/94).", "6.71": "  Aghanim's Scepter upgraded Warlock's Golems Increased health from 450/600/750 to 675/900/1125. Increased attack damage from 26/38/51 to 38/56/75.", "6.70": " Increased  Fatal Bonds shared damage from 15% to 20%.", "6.73": "  Flaming Fists Increased proc chance from 40% to 60%. Increased damage from 75/115/150 to 100/150/200.", "6.72": "  Fatal Bonds Increased number of units bonded from 2/3/4/5 to 3/4/5/6. Increased cast range from 600 to 800. Reduced  Upheaval cooldown from 65 to 50.", "6.39b": " Reduced Warlock's Golems health from 900/1400/1800 to 900/1200/1500.", "6.82c": "  Flaming Fists Changed damage type from magical to pure (this causes it to pierce spell immunity again). Reduced damage from 100/150/200 to 80/115/150.", "6.52b": " Fixed a potential suicide issue with  Fatal Bonds.", "6.58": "  Shadow Word Fixed some performance issues. Fixed the status buff/debuff icon lasting 2 seconds too long (visual only) Fixed being able to attack and deny allies affected by a healing Shadow Word.", "6.80": " Increased  Upheaval max channel time from 12 to 16.", "6.81": " Increased  Shadow Word duration from 9 to 11. Reduced  Upheaval cooldown from 50 on each level to 50/46/42/38.", "6.82": "  Fatal Bonds Now uses the same damage type that is dealt, instead of using HP Removal. Now spreads the damage before any reductions, instead of after. Increased shared damage from 20% to 25%. Warlock's Golems Increased attack range from 100 to 225. Reduced base attack time from 1.35 to 1.2. Increased health regeneration from 15/20/25 to 15/30/45. Increased  Permanent Immolation radius from 250 to 300.  Flaming Fists No longer pierces spell immunity. Reduced proc chance from 60% to 40%.", "6.83": "  Fatal Bonds Increased cast range from 800 to 900. Increased search radius from 575 to 700.  Shadow Word is now castable on spell immune allies.", "6.84": "  Fatal Bonds Increased cast range from 800 to 1000. Reduced cast point from 0.5 to 0.2. Increased Golems health regeneration from 15/30/45 to 25/50/75.  Permanent Immolation no longer ignores ancient creeps, Roshan and creep-heroes."}