{"6.80": "  Focus Fire Reduced cast point from 0.3 to 0. Reduced manacost from 200/300/400 to 150 on each level.", "6.81": " Activating  Windrun now disjoints incoming attack projectiles.  Aghanim's Scepter upgraded  Focus Fire No longer causes Focus Fire to not reduce damage of secondary item effects. Now reduces the attack damage reduction from 50%/40%/30% to 30%/15%/0%.", "6.82": " Increased  Shackleshot search range from 525 to 575. Increased  Windrun duration from 2.75/3.5/4.25/5 to 3/4/5/6.", "6.83": "  Powershot Increased cast range and travel distance from 1825 to 2600. Max damage is now reached after 1 second of channeling, instead of 0.7 seconds. Reduced cast point from 0.3 to 0. Reduced vision radius from 800 to 400. Increased  Focus Fire attack speed bonus from 400 to 500.", "6.84": " Reduced  Shackleshot cast point from 0.3 to 0.15.", "6.65": " Reduced  Windrun cooldown from 30/25/20/15 to 15 on each level.", "6.81b": " Reduces  Focus Fire manacost from 150 on each level to 75/100/125.", "6.69": " Reduced night vision from 1200 to 800. Reduced  Shackleshot search angle from 30° to 26°.", "6.60": " Reduced base attack time from 1.6 to 1.5. Added  Aghanim's Scepter upgrade for Windranger: Causes  Focus Fire to not reduce damage from secondary item effects and reduces cooldown from 60 to 15.", "6.59": " Reduced  Powershot cooldown from 12 to 9.", "6.72": " Increased  Shackleshot cooldown from 10 to 12.", "6.55": " Created.", "6.79": "  Focus Fire now remains sticky on the target it is cast on. This means that Windranger can change targets and when returning to the original target, her attack speed bonus will resume.", "6.58": "  Focus Fire no longer has a 10 attacks limit.", "6.57": " Fixed Windranger not appearing in Single Draft.  Shackleshot Fixed not registering  Sprout trees. Changed search angle from unknown to 30°. Changed search range from unknown to 525. Increased stun duration from 1.4/2.1/2.8/3.5 to 1.5/2.25/3/3.75. Reduced cooldown from 14 to 10.  Windrun No longer causes Windranger to forget her current order. Reduced cooldown from 65/50/35/20 to 30/25/20/15."}