{"6.45": "  Voodoo Restoration Increased heal per second from 6/12/18/24 to 6/12/24/30. Reduced initial manacost from 80/90/100/110 to 25/40/85/110. Reduced manacost per second from 10 on each level to 5/5/10/10.", "6.60": "  Linken's Sphere now blocks one instance of  Paralyzing Cask (does not end the bounces).", "6.61": " Increased base  intelligence from 19 to 24. Reduced base attack damage from 32-42 to 27-37 (total attack damage is still 51-61 because of the intelligence increase).", "6.40": " Reduced  Paralyzing Cask cooldown from 20 on each level to 20/18/16/14.", "6.65": "  Paralyzing Cask now deals 50 damage to heroes on each bounce.", "6.69": " Reduced  Paralyzing Cask initial projectile hero stun duration from 1.5 to 1 (same as the bounces now). Increased  Voodoo Restoration manacost per second from 6/9/12/15 to 8/14/20/26.", "6.63": " Reduced  Paralyzing Cask manacost from 140 on each level to 110/120/130/140. Reduced  Voodoo Restoration initial manacost from 50/75/100/125 to 25/50/75/100.", "6.31": " Reduced attack point from unknown to 0.4.  Paralyzing Cask now deals 75 damage to every non-hero unit it bounces to.", "6.33": " Increased base attack damage from 15-25 to 32-42 (total attack damage is now 51-61) Increased movement speed from 295 to 305.", "6.35": " Increased  Paralyzing Cask projectile speed from unknown to 600.", "6.39": " Increased  Paralyzing Cask creep damage from 75 on each level to 75/100/125/150.", "6.57": "  Voodoo Restoration Increased heal per second from 6/12/24/30 to 16/24/32/40. Increased initial manacost from 25/40/85/110 to 50/75/100/125. Increased manacost per second from 5/5/10/10 to 6/9/12/15.", "6.54": " Recoded  Maledict for some optimization.", "6.79": "  Paralyzing Cask now lasts 5 seconds on illusions (same as creep duration).   Voodoo Restoration Increased radius from 350 to 500. Reduced manacost per second from 8/14/20/26 to 8/12/16/20. Increased  Death Ward cast range from 400 to 600.", "6.78": " Increased  Maledict cast range from 400 to 525. Increased  Death Ward cast range from 300/350/400 to 400 on each level.", "6.51": " Reduced  Voodoo Restoration heal interval from 1 to 0.33 (same heal overall, just smoother).", "6.50": "  Paralyzing Cask Increased initial projectile speed from 600 to 1000 (bounces are still 600). Increased initial projectile hero stun duration from 1 to 1.5 (bounces are still 1). Increased  Maledict radius from 135 to 150.", "6.75": " Increased  Maledict lost health as burst damage from 10%/20%/30%/40% to 16%/24%/32%/40%. Reduced  Death Ward base attack time from 0.3 to 0.25.", "6.76": "  Death Ward Increased bouce search radius from 550 to 650. Reduced cooldown from 90 to 80.  Aghanim's Scepter No longer causes level 2  Death Ward to bounce once and level 3 Death Ward to attack 3 enemies at the same time. Now causes the Death Ward's attacks to bounce 4 times (still increases damage from 60/90/120 to 90/120/150).", "6.72": "  Death Ward is now automatically added to the player's current selection group.", "6.58": "  Voodoo Restoration no longer triggers  Essence Aura.", "6.80": "  Paralyzing Cask can now bounce to units in the fog of war. Reduced  Voodoo Restoration initial manacost from 25/50/75/100 to 20/30/40/50. Increased  Maledict radius from 150 to 165.", "6.81": " Reduced  Maledict cooldown from 35 to 20. Reduced  Death Ward base attack time from 0.25 to 0.22.", "6.82": " Increased  Maledict radius from 165 to 180.  Death Ward bounces' damage is no longer sourced to Witch Doctor (i.e.  Blade Mail no longer reflects bounces damage back to him).", "6.28": " Created.", "6.29": " Fixed various  Voodoo Restoration bugs.  Death Ward The Death Ward is now invulnerable. Reduced duration from 15 to 8. Reduced manacost from 200/250/300 to 200 on each level."}