{"6.63": " Reduced base  agility and gain from 15 + 1.7 to 11 + 1.2.", "6.60": "  Arc Lightning Can now be cast while the lightning of a previous cast is still bouncing. Increasd cooldown from 2 to 2.5.  Lightning Bolt is now fully blocked by  Linken's Sphere, instead of mini-stun only.", "6.67": " Increased  Static Field radius from 800 to 900.", "6.81b": " Lightning Bolt Increased vision and True Sight duration from 3 to 4.5. Increased hero search radius from 250 to 325.", "6.68": " Reduced  Arc Lightning cooldown from 2.5 to 2.25.", "6.41": "  Thundergod's Wrath no longer hits  Meepo clones.", "6.00": " Reduced base  strength and gain from 20 + 2 to 19 + 1.4. Increased  Arc Lightning manacost from 50/57/64/71 to 65/72/79/86.  Static Field no longer affects sleeping units (neutral creeps at night).", "6.35": " Increased  strength gain from 1.4 to 1.8. Increased  intelligence gain from 2.5 to 2.8. Increased movement speed from 290 to 295. Increased  Static Field radius from 600 to 1000.", "6.36": "  Lightning Bolt no longer turns the target invulnerable for 0.01 seconds before applying the damage. Reduced  Static Field radius from 1000 to 800.", "6.10": " Fixed some memory leak issues on  Lightning Bolt,  Static Field and  Thundergod's Wrath.", "6.33b": " Fixed  Static Field having a minor effect even without having it learned.", "6.72c": " Increased  Lightning Bolt vision radius from 1000/750 to 1000/1000. Increased  Thundergod's Wrath vision radius from 1000/750 to 1000/1000.", "6.75": " Reduced  Arc Lightning cooldown from 2 to 1.75. Reduced  Thundergod's Wrath cooldown from 120 to 90.", "6.17": "  Lightning Bolt Increased cast range from 600 to 700. Reduced manacost from 75/95/115/160 to 75/95/115/135 Reduced cooldown from 8 to 7.", "6.77": " Increased  strength gain from 1.8 to 2.3.", "6.76": "  Thundergod's Wrath Increased damage from 210/335/460 to 225/350/475. Increased  Aghanim's Scepter upgraded damage from 400/500/600 to 440/540/640.", "6.71": " Increased  Static Field radius from 900 to 1000. Increased  Aghanim's Scepter upgraded  Thundergod's Wrath damage from 355/460/570 to 400/500/600.", "6.70": " Reduced  Lightning Bolt cooldown from 7 to 6.5.", "6.73": " Increased  Arc Lightning damage from 85/100/115/130 to 85/100/115/145. Reduced  Lightning Bolt cooldown from 6.5 to 6.  Static Field now also affects creeps, invisible and fogged units.", "6.72": "  Arc Lightning Reduced cooldown from 2.25 to 2. Reduced manacost from 65/72/79/87 to 65/70/75/80.", "6.29b": " Increased  Static Field radius from 500 to 600.", "6.80": " Increased  Arc Lightning cast range from 700 to 850.", "6.81": " Reduced  Arc Lightning cast point from 0.4 to 0.2.  Lightning Bolt Can now be cast on the ground, affecting the closest enemy hero in a 250 range. Reduced True Sight radius from 900 to 750. Reduced flying vision radius from 900 to 750.", "6.82": " Increased  Static Field radius from 1000 to 1200.", "6.84": "  Thundergod's Wrath Reduced vision radius from 1000 to 500. Fixed sometimes hitting invisible units depending on the order of player slots.", "6.28": " Reworked  Static Field"}